SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 MODEM register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_MODEM_H
#define EFR32FG25_MODEM_H
#define MODEM_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_MODEM MODEM
 * @{
 * @brief EFR32FG25 MODEM Register Declaration.
 *****************************************************************************/

/** MODEM Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version                                         */
  __IOM uint32_t EN;                            /**< Enable peripheral clock to this module             */
  __IOM uint32_t IF;                            /**< Interrupt Flags                                    */
  __IOM uint32_t IEN;                           /**< Interrupt Enable                                   */
  __IOM uint32_t SEQIF;                         /**< SEQ Interrupt Flags                                */
  __IOM uint32_t SEQIEN;                        /**< SEQ Interrupt Enable                               */
  __IM uint32_t  STATUS;                        /**< Status Register                                    */
  __IM uint32_t  STATUS2;                       /**< Status Register 2                                  */
  __IM uint32_t  STATUS3;                       /**< Status Register 3                                  */
  __IM uint32_t  STATUS4;                       /**< ANT DIV RSSI Status                                */
  uint32_t       RESERVED0[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  STATUS6;                       /**< ANT DIV Correlation Status                         */
  __IM uint32_t  STATUS7;                       /**< PHASE Demod Status                                 */
  __IM uint32_t  TIMDETSTATUS;                  /**< Timing Detection Status Register                   */
  __IM uint32_t  FSMSTATUS;                     /**< Demod FSM Status Register                          */
  __IM uint32_t  FREQOFFEST;                    /**< Frequency Offset Estimate                          */
  __IOM uint32_t AFCADJRX;                      /**< AFC Adjustment RX                                  */
  __IOM uint32_t AFCADJTX;                      /**< AFC Adjustment TX                                  */
  uint32_t       RESERVED1[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t CTRL0;                         /**< Control Register 0                                 */
  __IOM uint32_t CTRL1;                         /**< Control Register 1                                 */
  __IOM uint32_t CTRL2;                         /**< Control Register 2                                 */
  __IOM uint32_t CTRL3;                         /**< Control Register 3                                 */
  __IOM uint32_t CTRL4;                         /**< Control Register 4                                 */
  __IOM uint32_t CTRL5;                         /**< Control Register 5                                 */
  __IOM uint32_t CTRL6;                         /**< Control Register 6                                 */
  __IOM uint32_t TXBR;                          /**< Transmit baudrate                                  */
  __IOM uint32_t RXBR;                          /**< Receive Baudrate                                   */
  uint32_t       RESERVED2[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t PRE;                           /**< Preamble Register                                  */
  __IOM uint32_t SYNC0;                         /**< Sync word 0                                        */
  __IOM uint32_t SYNC1;                         /**< Sync word 1                                        */
  __IOM uint32_t TIMING;                        /**< Timing Register                                    */
  __IOM uint32_t DSSS0;                         /**< DSSS symbol 0 Register                             */
  __IOM uint32_t MODINDEX;                      /**< Modulation Index                                   */
  __IOM uint32_t AFC;                           /**< Automatic Frequency Control                        */
  __IOM uint32_t AFCADJLIM;                     /**< AFC Adjustment Limit                               */
  __IOM uint32_t SHAPING0;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING1;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING2;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING3;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING4;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING5;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING6;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING7;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING8;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING9;                      /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING10;                     /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING11;                     /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING12;                     /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING13;                     /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING14;                     /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING15;                     /**< Shaping Coefficients                               */
  __IOM uint32_t OOKSHAPING;                    /**< OOK/ASK Shaping Control                            */
  __IOM uint32_t RAMPCTRL;                      /**< Ramping Register                                   */
  __IOM uint32_t RAMPLEV;                       /**< Ramping Register                                   */
  __IOM uint32_t ANARAMPCTRL;                   /**< Analog Ramping Control                             */
  __IOM uint32_t ANARAMP0;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP1;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP2;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP3;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP4;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP5;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP6;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP7;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP8;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP9;                      /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP10;                     /**< Analog Ramp LUT entries                            */
  uint32_t       RESERVED3[4U];                 /**< Reserved for future use                            */
  __IOM uint32_t INTAFC;                        /**< Internal AFC                                       */
  __IOM uint32_t DSATHD0;                       /**< DSA detector threshold-0                           */
  __IOM uint32_t DSATHD1;                       /**< DSA detector threshold-1                           */
  __IOM uint32_t DSATHD2;                       /**< DSA detector threshold-2                           */
  __IOM uint32_t DSATHD3;                       /**< DSA detector threshold 3                           */
  __IOM uint32_t DSATHD4;                       /**< DSA detector threshold 4                           */
  __IOM uint32_t DSACTRL;                       /**< DSA mode                                           */
  uint32_t       RESERVED4[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t VITERBIDEMOD;                  /**< Viterbi demodulator                                */
  __IOM uint32_t VTCORRCFG0;                    /**< Viterbi demodulator                                */
  __IOM uint32_t VTCORRCFG1;                    /**< Viterbi demodulator                                */
  __IOM uint32_t VTTRACK;                       /**< Viterbi demodulator tracking loop                  */
  __IOM uint32_t VTBLETIMING;                   /**< Viterbi BLE timing stamp control                   */
  __IM uint32_t  BREST;                         /**< Baudrate Estimate                                  */
  __IOM uint32_t AUTOCG;                        /**< Automatic clock gating                             */
  __IOM uint32_t CGCLKSTOP;                     /**< Automatic clock gating                             */
  __IM uint32_t  POE;                           /**< Phase Offset Estimate                              */
  __IOM uint32_t DIRECTMODE;                    /**< Direct Mode Control                                */
  uint32_t       RESERVED5[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t LONGRANGE1;                    /**< BLE Long Range Set1                                */
  __IOM uint32_t LONGRANGE2;                    /**< BLE Long Range Set2                                */
  __IOM uint32_t LONGRANGE3;                    /**< BLE Long Range Set3                                */
  __IOM uint32_t LONGRANGE4;                    /**< BLE Long Range Set4                                */
  __IOM uint32_t LONGRANGE5;                    /**< BLE Long Range Set5                                */
  __IOM uint32_t LONGRANGE6;                    /**< BLE Long Range Set6                                */
  __IOM uint32_t LRFRC;                         /**< BLE Long Range FRC interface                       */
  __IOM uint32_t COH0;                          /**< Coherent demodulator control signals               */
  __IOM uint32_t COH1;                          /**< Coherent demodulator control signals               */
  __IOM uint32_t COH2;                          /**< Coherent demodulator control signals               */
  __IOM uint32_t COH3;                          /**< Coherent demodulator control signals               */
  __IOM uint32_t CMD;                           /**< Command register                                   */
  uint32_t       RESERVED6[2U];                 /**< Reserved for future use                            */
  __IOM uint32_t SYNCPROPERTIES;                /**< Sync word properties                               */
  uint32_t       RESERVED7[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t PRSCTRL;                       /**< Mux control for PRS outputs                        */
  uint32_t       RESERVED8[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t REALTIMCFE;                    /**< Real time Cost Function Engine CTRL                */
  __IOM uint32_t ETSCTRL;                       /**< Early Time Stamp Control                           */
  __IOM uint32_t ETSTIM;                        /**< Early Time Stamp Timing                            */
  __IOM uint32_t ANTSWCTRL;                     /**< Antenna Switch Control                             */
  __IOM uint32_t ANTSWCTRL1;                    /**< Antenna Switch Control 1                           */
  __IOM uint32_t ANTSWSTART;                    /**< Antenna Switch Start                               */
  __IOM uint32_t ANTSWEND;                      /**< Antenna Switch End                                 */
  __IOM uint32_t TRECPMPATT;                    /**< TRECS Preamble pattern                             */
  __IOM uint32_t TRECPMDET;                     /**< TRECS preamble Detection CTRL                      */
  __IOM uint32_t TRECSCFG;                      /**< TRECS configuration                                */
  __IOM uint32_t CFGANTPATT;                    /**< Configure Antenna Pattern                          */
  uint32_t       RESERVED9[17U];                /**< Reserved for future use                            */
  __IOM uint32_t FRMSCHTIME;                    /**< FRAM SCH TIME-OUT length                           */
  __IOM uint32_t PREFILTCOEFF;                  /**< Preamble Filter Coefficients                       */
  __IOM uint32_t RXRESTART;                     /**< Collision restart control                          */
  __IOM uint32_t SQ;                            /**< Preamble Sense Mode                                */
  __IOM uint32_t SQEXT;                         /**< Preamble Sense Mode EXT                            */
  __IOM uint32_t SQI;                           /**< Signal quality indicator                           */
  __IOM uint32_t ANTDIVCTRL;                    /**< Antenna Diversity Mode Control Register            */
  __IOM uint32_t ANTDIVFW;                      /**< PHASE DEMOD FW mode                                */
  __IOM uint32_t PHDMODANTDIV;                  /**< PHASE DEMOD ANTENNA DIVSERSITY                     */
  __IOM uint32_t PHANTDECSION;                  /**< PHASE DEMOD ANT-DIV Decision                       */
  __IOM uint32_t PHDMODCTRL;                    /**< PHASE DEMOD CTRL                                   */
  uint32_t       RESERVED10[12U];               /**< Reserved for future use                            */
  __IOM uint32_t ADCTRL1;                       /**< ADCTRL1                                            */
  uint32_t       RESERVED11[1U];                /**< Reserved for future use                            */
  __IM uint32_t  ADQUAL0;                       /**< ADQUAL0                                            */
  __IM uint32_t  ADQUAL1;                       /**< ADQUAL1                                            */
  __IM uint32_t  ADQUAL2;                       /**< ADQUAL2                                            */
  __IM uint32_t  ADQUAL3;                       /**< ADQUAL3                                            */
  __IOM uint32_t ADQUAL4;                       /**< ADQUAL4                                            */
  __IOM uint32_t ADQUAL5;                       /**< ADQUAL5                                            */
  __IOM uint32_t ADQUAL6;                       /**< ADQUAL6                                            */
  __IOM uint32_t ADQUAL7;                       /**< ADQUAL7                                            */
  __IOM uint32_t ADQUAL8;                       /**< ADQUAL8                                            */
  __IM uint32_t  ADQUAL9;                       /**< ADQUAL9                                            */
  __IM uint32_t  ADQUAL10;                      /**< ADQUAL10                                           */
  __IOM uint32_t ADFSM0;                        /**< ADFSM0                                             */
  __IOM uint32_t ADFSM1;                        /**< ADFSM1                                             */
  __IOM uint32_t ADFSM2;                        /**< ADFSM2                                             */
  __IOM uint32_t ADFSM3;                        /**< ADFSM3                                             */
  __IOM uint32_t ADFSM4;                        /**< ADFSM4                                             */
  __IOM uint32_t ADFSM5;                        /**< ADFSM5                                             */
  __IOM uint32_t ADFSM6;                        /**< ADFSM6                                             */
  __IOM uint32_t ADFSM7;                        /**< ADFSM7                                             */
  __IOM uint32_t ADFSM8;                        /**< ADFSM8                                             */
  __IOM uint32_t ADFSM9;                        /**< ADFSM9                                             */
  __IOM uint32_t ADFSM10;                       /**< ADFSM10                                            */
  __IOM uint32_t ADFSM11;                       /**< ADFSM11                                            */
  __IOM uint32_t ADFSM12;                       /**< ADFSM12                                            */
  __IOM uint32_t ADFSM13;                       /**< ADFSM13                                            */
  __IOM uint32_t ADFSM14;                       /**< ADFSM14                                            */
  __IOM uint32_t ADFSM15;                       /**< ADFSM15                                            */
  __IOM uint32_t ADFSM16;                       /**< ADFSM16                                            */
  __IOM uint32_t ADFSM17;                       /**< ADFSM17                                            */
  __IOM uint32_t ADFSM18;                       /**< ADFSM18                                            */
  __IOM uint32_t ADFSM19;                       /**< ADFSM19                                            */
  __IOM uint32_t ADFSM20;                       /**< ADFSM20                                            */
  __IOM uint32_t ADFSM21;                       /**< ADFSM21                                            */
  __IM uint32_t  ADFSM22;                       /**< ADFSM22                                            */
  __IOM uint32_t ADFSM23;                       /**< ADFSM23                                            */
  __IOM uint32_t ADFSM24;                       /**< ADFSM24                                            */
  __IOM uint32_t ADFSM25;                       /**< ADFSM25                                            */
  __IOM uint32_t ADFSM26;                       /**< ADFSM26                                            */
  __IOM uint32_t ADFSM27;                       /**< ADFSM27                                            */
  __IOM uint32_t ADFSM28;                       /**< ADFSM28                                            */
  __IOM uint32_t ADFSM29;                       /**< ADFSM29                                            */
  __IOM uint32_t ADFSM30;                       /**< ADFSM30                                            */
  __IOM uint32_t BCRCTRL0;                      /**< BCRCTRL0                                           */
  __IOM uint32_t BCRCTRL1;                      /**< BCRCTRL1                                           */
  __IOM uint32_t BCRDEMODCTRL;                  /**< BCRDEMODCTRL                                       */
  __IOM uint32_t BCRDEMODOOK;                   /**< BCRDEMODOOK                                        */
  __IOM uint32_t BCRDEMODAFC0;                  /**< BCRDEMODAFC0                                       */
  __IOM uint32_t BCRDEMODAFC1;                  /**< BCRDEMODAFC1                                       */
  __IOM uint32_t BCRDEMOD4FSK0;                 /**< BCRDEMOD4FSK0                                      */
  __IOM uint32_t BCRDEMOD4FSK1;                 /**< BCRDEMOD4FSK1                                      */
  __IOM uint32_t BCRDEMODANT;                   /**< BCRDEMODANT                                        */
  __IOM uint32_t BCRDEMODRSSI;                  /**< BCRDEMODRSSI                                       */
  __IOM uint32_t BCRDEMODARR0;                  /**< BCRDEMODARR0                                       */
  __IOM uint32_t BCRDEMODARR1;                  /**< BCRDEMODARR1                                       */
  __IOM uint32_t BCRDEMODARR2;                  /**< BCRDEMODARR2                                       */
  __IOM uint32_t BCRDEMODKSI;                   /**< BCR DEMOD KSI                                      */
  __IOM uint32_t BCRDEMODPMEXP;                 /**< BCR DEMOD PM                                       */
  uint32_t       RESERVED12[37U];               /**< Reserved for future use                            */
  __IOM uint32_t SPARE;                         /**< Spare register                                     */
  uint32_t       RESERVED13[767U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version                                         */
  __IOM uint32_t EN_SET;                        /**< Enable peripheral clock to this module             */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable                                   */
  __IOM uint32_t SEQIF_SET;                     /**< SEQ Interrupt Flags                                */
  __IOM uint32_t SEQIEN_SET;                    /**< SEQ Interrupt Enable                               */
  __IM uint32_t  STATUS_SET;                    /**< Status Register                                    */
  __IM uint32_t  STATUS2_SET;                   /**< Status Register 2                                  */
  __IM uint32_t  STATUS3_SET;                   /**< Status Register 3                                  */
  __IM uint32_t  STATUS4_SET;                   /**< ANT DIV RSSI Status                                */
  uint32_t       RESERVED14[1U];                /**< Reserved for future use                            */
  __IM uint32_t  STATUS6_SET;                   /**< ANT DIV Correlation Status                         */
  __IM uint32_t  STATUS7_SET;                   /**< PHASE Demod Status                                 */
  __IM uint32_t  TIMDETSTATUS_SET;              /**< Timing Detection Status Register                   */
