SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
  __IM uint32_t  FSMSTATUS_SET;                 /**< Demod FSM Status Register                          */
  __IM uint32_t  FREQOFFEST_SET;                /**< Frequency Offset Estimate                          */
  __IOM uint32_t AFCADJRX_SET;                  /**< AFC Adjustment RX                                  */
  __IOM uint32_t AFCADJTX_SET;                  /**< AFC Adjustment TX                                  */
  uint32_t       RESERVED15[1U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL0_SET;                     /**< Control Register 0                                 */
  __IOM uint32_t CTRL1_SET;                     /**< Control Register 1                                 */
  __IOM uint32_t CTRL2_SET;                     /**< Control Register 2                                 */
  __IOM uint32_t CTRL3_SET;                     /**< Control Register 3                                 */
  __IOM uint32_t CTRL4_SET;                     /**< Control Register 4                                 */
  __IOM uint32_t CTRL5_SET;                     /**< Control Register 5                                 */
  __IOM uint32_t CTRL6_SET;                     /**< Control Register 6                                 */
  __IOM uint32_t TXBR_SET;                      /**< Transmit baudrate                                  */
  __IOM uint32_t RXBR_SET;                      /**< Receive Baudrate                                   */
  uint32_t       RESERVED16[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PRE_SET;                       /**< Preamble Register                                  */
  __IOM uint32_t SYNC0_SET;                     /**< Sync word 0                                        */
  __IOM uint32_t SYNC1_SET;                     /**< Sync word 1                                        */
  __IOM uint32_t TIMING_SET;                    /**< Timing Register                                    */
  __IOM uint32_t DSSS0_SET;                     /**< DSSS symbol 0 Register                             */
  __IOM uint32_t MODINDEX_SET;                  /**< Modulation Index                                   */
  __IOM uint32_t AFC_SET;                       /**< Automatic Frequency Control                        */
  __IOM uint32_t AFCADJLIM_SET;                 /**< AFC Adjustment Limit                               */
  __IOM uint32_t SHAPING0_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING1_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING2_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING3_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING4_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING5_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING6_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING7_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING8_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING9_SET;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING10_SET;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING11_SET;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING12_SET;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING13_SET;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING14_SET;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING15_SET;                 /**< Shaping Coefficients                               */
  __IOM uint32_t OOKSHAPING_SET;                /**< OOK/ASK Shaping Control                            */
  __IOM uint32_t RAMPCTRL_SET;                  /**< Ramping Register                                   */
  __IOM uint32_t RAMPLEV_SET;                   /**< Ramping Register                                   */
  __IOM uint32_t ANARAMPCTRL_SET;               /**< Analog Ramping Control                             */
  __IOM uint32_t ANARAMP0_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP1_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP2_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP3_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP4_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP5_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP6_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP7_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP8_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP9_SET;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP10_SET;                 /**< Analog Ramp LUT entries                            */
  uint32_t       RESERVED17[4U];                /**< Reserved for future use                            */
  __IOM uint32_t INTAFC_SET;                    /**< Internal AFC                                       */
  __IOM uint32_t DSATHD0_SET;                   /**< DSA detector threshold-0                           */
  __IOM uint32_t DSATHD1_SET;                   /**< DSA detector threshold-1                           */
  __IOM uint32_t DSATHD2_SET;                   /**< DSA detector threshold-2                           */
  __IOM uint32_t DSATHD3_SET;                   /**< DSA detector threshold 3                           */
  __IOM uint32_t DSATHD4_SET;                   /**< DSA detector threshold 4                           */
  __IOM uint32_t DSACTRL_SET;                   /**< DSA mode                                           */
  uint32_t       RESERVED18[1U];                /**< Reserved for future use                            */
  __IOM uint32_t VITERBIDEMOD_SET;              /**< Viterbi demodulator                                */
  __IOM uint32_t VTCORRCFG0_SET;                /**< Viterbi demodulator                                */
  __IOM uint32_t VTCORRCFG1_SET;                /**< Viterbi demodulator                                */
  __IOM uint32_t VTTRACK_SET;                   /**< Viterbi demodulator tracking loop                  */
  __IOM uint32_t VTBLETIMING_SET;               /**< Viterbi BLE timing stamp control                   */
  __IM uint32_t  BREST_SET;                     /**< Baudrate Estimate                                  */
  __IOM uint32_t AUTOCG_SET;                    /**< Automatic clock gating                             */
  __IOM uint32_t CGCLKSTOP_SET;                 /**< Automatic clock gating                             */
  __IM uint32_t  POE_SET;                       /**< Phase Offset Estimate                              */
  __IOM uint32_t DIRECTMODE_SET;                /**< Direct Mode Control                                */
  uint32_t       RESERVED19[1U];                /**< Reserved for future use                            */
  __IOM uint32_t LONGRANGE1_SET;                /**< BLE Long Range Set1                                */
  __IOM uint32_t LONGRANGE2_SET;                /**< BLE Long Range Set2                                */
  __IOM uint32_t LONGRANGE3_SET;                /**< BLE Long Range Set3                                */
  __IOM uint32_t LONGRANGE4_SET;                /**< BLE Long Range Set4                                */
  __IOM uint32_t LONGRANGE5_SET;                /**< BLE Long Range Set5                                */
  __IOM uint32_t LONGRANGE6_SET;                /**< BLE Long Range Set6                                */
  __IOM uint32_t LRFRC_SET;                     /**< BLE Long Range FRC interface                       */
  __IOM uint32_t COH0_SET;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH1_SET;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH2_SET;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH3_SET;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t CMD_SET;                       /**< Command register                                   */
  uint32_t       RESERVED20[2U];                /**< Reserved for future use                            */
  __IOM uint32_t SYNCPROPERTIES_SET;            /**< Sync word properties                               */
  uint32_t       RESERVED21[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PRSCTRL_SET;                   /**< Mux control for PRS outputs                        */
  uint32_t       RESERVED22[1U];                /**< Reserved for future use                            */
  __IOM uint32_t REALTIMCFE_SET;                /**< Real time Cost Function Engine CTRL                */
  __IOM uint32_t ETSCTRL_SET;                   /**< Early Time Stamp Control                           */
  __IOM uint32_t ETSTIM_SET;                    /**< Early Time Stamp Timing                            */
  __IOM uint32_t ANTSWCTRL_SET;                 /**< Antenna Switch Control                             */
  __IOM uint32_t ANTSWCTRL1_SET;                /**< Antenna Switch Control 1                           */
  __IOM uint32_t ANTSWSTART_SET;                /**< Antenna Switch Start                               */
  __IOM uint32_t ANTSWEND_SET;                  /**< Antenna Switch End                                 */
  __IOM uint32_t TRECPMPATT_SET;                /**< TRECS Preamble pattern                             */
  __IOM uint32_t TRECPMDET_SET;                 /**< TRECS preamble Detection CTRL                      */
  __IOM uint32_t TRECSCFG_SET;                  /**< TRECS configuration                                */
  __IOM uint32_t CFGANTPATT_SET;                /**< Configure Antenna Pattern                          */
  uint32_t       RESERVED23[17U];               /**< Reserved for future use                            */
  __IOM uint32_t FRMSCHTIME_SET;                /**< FRAM SCH TIME-OUT length                           */
  __IOM uint32_t PREFILTCOEFF_SET;              /**< Preamble Filter Coefficients                       */
  __IOM uint32_t RXRESTART_SET;                 /**< Collision restart control                          */
  __IOM uint32_t SQ_SET;                        /**< Preamble Sense Mode                                */
  __IOM uint32_t SQEXT_SET;                     /**< Preamble Sense Mode EXT                            */
  __IOM uint32_t SQI_SET;                       /**< Signal quality indicator                           */
  __IOM uint32_t ANTDIVCTRL_SET;                /**< Antenna Diversity Mode Control Register            */
  __IOM uint32_t ANTDIVFW_SET;                  /**< PHASE DEMOD FW mode                                */
  __IOM uint32_t PHDMODANTDIV_SET;              /**< PHASE DEMOD ANTENNA DIVSERSITY                     */
  __IOM uint32_t PHANTDECSION_SET;              /**< PHASE DEMOD ANT-DIV Decision                       */
  __IOM uint32_t PHDMODCTRL_SET;                /**< PHASE DEMOD CTRL                                   */
  uint32_t       RESERVED24[12U];               /**< Reserved for future use                            */
  __IOM uint32_t ADCTRL1_SET;                   /**< ADCTRL1                                            */
  uint32_t       RESERVED25[1U];                /**< Reserved for future use                            */
  __IM uint32_t  ADQUAL0_SET;                   /**< ADQUAL0                                            */
  __IM uint32_t  ADQUAL1_SET;                   /**< ADQUAL1                                            */
  __IM uint32_t  ADQUAL2_SET;                   /**< ADQUAL2                                            */
  __IM uint32_t  ADQUAL3_SET;                   /**< ADQUAL3                                            */
  __IOM uint32_t ADQUAL4_SET;                   /**< ADQUAL4                                            */
  __IOM uint32_t ADQUAL5_SET;                   /**< ADQUAL5                                            */
  __IOM uint32_t ADQUAL6_SET;                   /**< ADQUAL6                                            */
  __IOM uint32_t ADQUAL7_SET;                   /**< ADQUAL7                                            */
  __IOM uint32_t ADQUAL8_SET;                   /**< ADQUAL8                                            */
  __IM uint32_t  ADQUAL9_SET;                   /**< ADQUAL9                                            */
  __IM uint32_t  ADQUAL10_SET;                  /**< ADQUAL10                                           */
  __IOM uint32_t ADFSM0_SET;                    /**< ADFSM0                                             */
  __IOM uint32_t ADFSM1_SET;                    /**< ADFSM1                                             */
  __IOM uint32_t ADFSM2_SET;                    /**< ADFSM2                                             */
  __IOM uint32_t ADFSM3_SET;                    /**< ADFSM3                                             */
  __IOM uint32_t ADFSM4_SET;                    /**< ADFSM4                                             */
  __IOM uint32_t ADFSM5_SET;                    /**< ADFSM5                                             */
  __IOM uint32_t ADFSM6_SET;                    /**< ADFSM6                                             */
  __IOM uint32_t ADFSM7_SET;                    /**< ADFSM7                                             */
  __IOM uint32_t ADFSM8_SET;                    /**< ADFSM8                                             */
  __IOM uint32_t ADFSM9_SET;                    /**< ADFSM9                                             */
  __IOM uint32_t ADFSM10_SET;                   /**< ADFSM10                                            */
  __IOM uint32_t ADFSM11_SET;                   /**< ADFSM11                                            */
  __IOM uint32_t ADFSM12_SET;                   /**< ADFSM12                                            */
  __IOM uint32_t ADFSM13_SET;                   /**< ADFSM13                                            */
  __IOM uint32_t ADFSM14_SET;                   /**< ADFSM14                                            */
  __IOM uint32_t ADFSM15_SET;                   /**< ADFSM15                                            */
  __IOM uint32_t ADFSM16_SET;                   /**< ADFSM16                                            */
  __IOM uint32_t ADFSM17_SET;                   /**< ADFSM17                                            */
  __IOM uint32_t ADFSM18_SET;                   /**< ADFSM18                                            */
  __IOM uint32_t ADFSM19_SET;                   /**< ADFSM19                                            */
  __IOM uint32_t ADFSM20_SET;                   /**< ADFSM20                                            */
  __IOM uint32_t ADFSM21_SET;                   /**< ADFSM21                                            */
  __IM uint32_t  ADFSM22_SET;                   /**< ADFSM22                                            */
  __IOM uint32_t ADFSM23_SET;                   /**< ADFSM23                                            */
  __IOM uint32_t ADFSM24_SET;                   /**< ADFSM24                                            */
  __IOM uint32_t ADFSM25_SET;                   /**< ADFSM25                                            */
  __IOM uint32_t ADFSM26_SET;                   /**< ADFSM26                                            */
  __IOM uint32_t ADFSM27_SET;                   /**< ADFSM27                                            */
  __IOM uint32_t ADFSM28_SET;                   /**< ADFSM28                                            */
  __IOM uint32_t ADFSM29_SET;                   /**< ADFSM29                                            */
  __IOM uint32_t ADFSM30_SET;                   /**< ADFSM30                                            */
  __IOM uint32_t BCRCTRL0_SET;                  /**< BCRCTRL0                                           */
  __IOM uint32_t BCRCTRL1_SET;                  /**< BCRCTRL1                                           */
  __IOM uint32_t BCRDEMODCTRL_SET;              /**< BCRDEMODCTRL                                       */
  __IOM uint32_t BCRDEMODOOK_SET;               /**< BCRDEMODOOK                                        */
  __IOM uint32_t BCRDEMODAFC0_SET;              /**< BCRDEMODAFC0                                       */
  __IOM uint32_t BCRDEMODAFC1_SET;              /**< BCRDEMODAFC1                                       */
  __IOM uint32_t BCRDEMOD4FSK0_SET;             /**< BCRDEMOD4FSK0                                      */
  __IOM uint32_t BCRDEMOD4FSK1_SET;             /**< BCRDEMOD4FSK1                                      */
  __IOM uint32_t BCRDEMODANT_SET;               /**< BCRDEMODANT                                        */
  __IOM uint32_t BCRDEMODRSSI_SET;              /**< BCRDEMODRSSI                                       */
  __IOM uint32_t BCRDEMODARR0_SET;              /**< BCRDEMODARR0                                       */
  __IOM uint32_t BCRDEMODARR1_SET;              /**< BCRDEMODARR1                                       */
  __IOM uint32_t BCRDEMODARR2_SET;              /**< BCRDEMODARR2                                       */
  __IOM uint32_t BCRDEMODKSI_SET;               /**< BCR DEMOD KSI                                      */
  __IOM uint32_t BCRDEMODPMEXP_SET;             /**< BCR DEMOD PM                                       */
  uint32_t       RESERVED26[37U];               /**< Reserved for future use                            */
  __IOM uint32_t SPARE_SET;                     /**< Spare register                                     */
  uint32_t       RESERVED27[767U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version                                         */
  __IOM uint32_t EN_CLR;                        /**< Enable peripheral clock to this module             */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable                                   */
  __IOM uint32_t SEQIF_CLR;                     /**< SEQ Interrupt Flags                                */
  __IOM uint32_t SEQIEN_CLR;                    /**< SEQ Interrupt Enable                               */
  __IM uint32_t  STATUS_CLR;                    /**< Status Register                                    */
  __IM uint32_t  STATUS2_CLR;                   /**< Status Register 2                                  */
  __IM uint32_t  STATUS3_CLR;                   /**< Status Register 3                                  */
  __IM uint32_t  STATUS4_CLR;                   /**< ANT DIV RSSI Status                                */
  uint32_t       RESERVED28[1U];                /**< Reserved for future use                            */
  __IM uint32_t  STATUS6_CLR;                   /**< ANT DIV Correlation Status                         */
  __IM uint32_t  STATUS7_CLR;                   /**< PHASE Demod Status                                 */
  __IM uint32_t  TIMDETSTATUS_CLR;              /**< Timing Detection Status Register                   */
  __IM uint32_t  FSMSTATUS_CLR;                 /**< Demod FSM Status Register                          */
  __IM uint32_t  FREQOFFEST_CLR;                /**< Frequency Offset Estimate                          */
  __IOM uint32_t AFCADJRX_CLR;                  /**< AFC Adjustment RX                                  */
  __IOM uint32_t AFCADJTX_CLR;                  /**< AFC Adjustment TX                                  */
  uint32_t       RESERVED29[1U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL0_CLR;                     /**< Control Register 0                                 */
  __IOM uint32_t CTRL1_CLR;                     /**< Control Register 1                                 */
  __IOM uint32_t CTRL2_CLR;                     /**< Control Register 2                                 */
  __IOM uint32_t CTRL3_CLR;                     /**< Control Register 3                                 */
  __IOM uint32_t CTRL4_CLR;                     /**< Control Register 4                                 */
  __IOM uint32_t CTRL5_CLR;                     /**< Control Register 5                                 */
  __IOM uint32_t CTRL6_CLR;                     /**< Control Register 6                                 */
  __IOM uint32_t TXBR_CLR;                      /**< Transmit baudrate                                  */
  __IOM uint32_t RXBR_CLR;                      /**< Receive Baudrate                                   */
  uint32_t       RESERVED30[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PRE_CLR;                       /**< Preamble Register                                  */
  __IOM uint32_t SYNC0_CLR;                     /**< Sync word 0                                        */
  __IOM uint32_t SYNC1_CLR;                     /**< Sync word 1                                        */
  __IOM uint32_t TIMING_CLR;                    /**< Timing Register                                    */
  __IOM uint32_t DSSS0_CLR;                     /**< DSSS symbol 0 Register                             */
  __IOM uint32_t MODINDEX_CLR;                  /**< Modulation Index                                   */
  __IOM uint32_t AFC_CLR;                       /**< Automatic Frequency Control                        */
  __IOM uint32_t AFCADJLIM_CLR;                 /**< AFC Adjustment Limit                               */
  __IOM uint32_t SHAPING0_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING1_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING2_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING3_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING4_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING5_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING6_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING7_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING8_CLR;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING9_CLR;                  /**< Shaping Coefficients                               */
