SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
  __IOM uint32_t SHAPING10_CLR;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING11_CLR;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING12_CLR;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING13_CLR;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING14_CLR;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING15_CLR;                 /**< Shaping Coefficients                               */
  __IOM uint32_t OOKSHAPING_CLR;                /**< OOK/ASK Shaping Control                            */
  __IOM uint32_t RAMPCTRL_CLR;                  /**< Ramping Register                                   */
  __IOM uint32_t RAMPLEV_CLR;                   /**< Ramping Register                                   */
  __IOM uint32_t ANARAMPCTRL_CLR;               /**< Analog Ramping Control                             */
  __IOM uint32_t ANARAMP0_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP1_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP2_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP3_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP4_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP5_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP6_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP7_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP8_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP9_CLR;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP10_CLR;                 /**< Analog Ramp LUT entries                            */
  uint32_t       RESERVED31[4U];                /**< Reserved for future use                            */
  __IOM uint32_t INTAFC_CLR;                    /**< Internal AFC                                       */
  __IOM uint32_t DSATHD0_CLR;                   /**< DSA detector threshold-0                           */
  __IOM uint32_t DSATHD1_CLR;                   /**< DSA detector threshold-1                           */
  __IOM uint32_t DSATHD2_CLR;                   /**< DSA detector threshold-2                           */
  __IOM uint32_t DSATHD3_CLR;                   /**< DSA detector threshold 3                           */
  __IOM uint32_t DSATHD4_CLR;                   /**< DSA detector threshold 4                           */
  __IOM uint32_t DSACTRL_CLR;                   /**< DSA mode                                           */
  uint32_t       RESERVED32[1U];                /**< Reserved for future use                            */
  __IOM uint32_t VITERBIDEMOD_CLR;              /**< Viterbi demodulator                                */
  __IOM uint32_t VTCORRCFG0_CLR;                /**< Viterbi demodulator                                */
  __IOM uint32_t VTCORRCFG1_CLR;                /**< Viterbi demodulator                                */
  __IOM uint32_t VTTRACK_CLR;                   /**< Viterbi demodulator tracking loop                  */
  __IOM uint32_t VTBLETIMING_CLR;               /**< Viterbi BLE timing stamp control                   */
  __IM uint32_t  BREST_CLR;                     /**< Baudrate Estimate                                  */
  __IOM uint32_t AUTOCG_CLR;                    /**< Automatic clock gating                             */
  __IOM uint32_t CGCLKSTOP_CLR;                 /**< Automatic clock gating                             */
  __IM uint32_t  POE_CLR;                       /**< Phase Offset Estimate                              */
  __IOM uint32_t DIRECTMODE_CLR;                /**< Direct Mode Control                                */
  uint32_t       RESERVED33[1U];                /**< Reserved for future use                            */
  __IOM uint32_t LONGRANGE1_CLR;                /**< BLE Long Range Set1                                */
  __IOM uint32_t LONGRANGE2_CLR;                /**< BLE Long Range Set2                                */
  __IOM uint32_t LONGRANGE3_CLR;                /**< BLE Long Range Set3                                */
  __IOM uint32_t LONGRANGE4_CLR;                /**< BLE Long Range Set4                                */
  __IOM uint32_t LONGRANGE5_CLR;                /**< BLE Long Range Set5                                */
  __IOM uint32_t LONGRANGE6_CLR;                /**< BLE Long Range Set6                                */
  __IOM uint32_t LRFRC_CLR;                     /**< BLE Long Range FRC interface                       */
  __IOM uint32_t COH0_CLR;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH1_CLR;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH2_CLR;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH3_CLR;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t CMD_CLR;                       /**< Command register                                   */
  uint32_t       RESERVED34[2U];                /**< Reserved for future use                            */
  __IOM uint32_t SYNCPROPERTIES_CLR;            /**< Sync word properties                               */
  uint32_t       RESERVED35[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PRSCTRL_CLR;                   /**< Mux control for PRS outputs                        */
  uint32_t       RESERVED36[1U];                /**< Reserved for future use                            */
  __IOM uint32_t REALTIMCFE_CLR;                /**< Real time Cost Function Engine CTRL                */
  __IOM uint32_t ETSCTRL_CLR;                   /**< Early Time Stamp Control                           */
  __IOM uint32_t ETSTIM_CLR;                    /**< Early Time Stamp Timing                            */
  __IOM uint32_t ANTSWCTRL_CLR;                 /**< Antenna Switch Control                             */
  __IOM uint32_t ANTSWCTRL1_CLR;                /**< Antenna Switch Control 1                           */
  __IOM uint32_t ANTSWSTART_CLR;                /**< Antenna Switch Start                               */
  __IOM uint32_t ANTSWEND_CLR;                  /**< Antenna Switch End                                 */
  __IOM uint32_t TRECPMPATT_CLR;                /**< TRECS Preamble pattern                             */
  __IOM uint32_t TRECPMDET_CLR;                 /**< TRECS preamble Detection CTRL                      */
  __IOM uint32_t TRECSCFG_CLR;                  /**< TRECS configuration                                */
  __IOM uint32_t CFGANTPATT_CLR;                /**< Configure Antenna Pattern                          */
  uint32_t       RESERVED37[17U];               /**< Reserved for future use                            */
  __IOM uint32_t FRMSCHTIME_CLR;                /**< FRAM SCH TIME-OUT length                           */
  __IOM uint32_t PREFILTCOEFF_CLR;              /**< Preamble Filter Coefficients                       */
  __IOM uint32_t RXRESTART_CLR;                 /**< Collision restart control                          */
  __IOM uint32_t SQ_CLR;                        /**< Preamble Sense Mode                                */
  __IOM uint32_t SQEXT_CLR;                     /**< Preamble Sense Mode EXT                            */
  __IOM uint32_t SQI_CLR;                       /**< Signal quality indicator                           */
  __IOM uint32_t ANTDIVCTRL_CLR;                /**< Antenna Diversity Mode Control Register            */
  __IOM uint32_t ANTDIVFW_CLR;                  /**< PHASE DEMOD FW mode                                */
  __IOM uint32_t PHDMODANTDIV_CLR;              /**< PHASE DEMOD ANTENNA DIVSERSITY                     */
  __IOM uint32_t PHANTDECSION_CLR;              /**< PHASE DEMOD ANT-DIV Decision                       */
  __IOM uint32_t PHDMODCTRL_CLR;                /**< PHASE DEMOD CTRL                                   */
  uint32_t       RESERVED38[12U];               /**< Reserved for future use                            */
  __IOM uint32_t ADCTRL1_CLR;                   /**< ADCTRL1                                            */
  uint32_t       RESERVED39[1U];                /**< Reserved for future use                            */
  __IM uint32_t  ADQUAL0_CLR;                   /**< ADQUAL0                                            */
  __IM uint32_t  ADQUAL1_CLR;                   /**< ADQUAL1                                            */
  __IM uint32_t  ADQUAL2_CLR;                   /**< ADQUAL2                                            */
  __IM uint32_t  ADQUAL3_CLR;                   /**< ADQUAL3                                            */
  __IOM uint32_t ADQUAL4_CLR;                   /**< ADQUAL4                                            */
  __IOM uint32_t ADQUAL5_CLR;                   /**< ADQUAL5                                            */
  __IOM uint32_t ADQUAL6_CLR;                   /**< ADQUAL6                                            */
  __IOM uint32_t ADQUAL7_CLR;                   /**< ADQUAL7                                            */
  __IOM uint32_t ADQUAL8_CLR;                   /**< ADQUAL8                                            */
  __IM uint32_t  ADQUAL9_CLR;                   /**< ADQUAL9                                            */
  __IM uint32_t  ADQUAL10_CLR;                  /**< ADQUAL10                                           */
  __IOM uint32_t ADFSM0_CLR;                    /**< ADFSM0                                             */
  __IOM uint32_t ADFSM1_CLR;                    /**< ADFSM1                                             */
  __IOM uint32_t ADFSM2_CLR;                    /**< ADFSM2                                             */
  __IOM uint32_t ADFSM3_CLR;                    /**< ADFSM3                                             */
  __IOM uint32_t ADFSM4_CLR;                    /**< ADFSM4                                             */
  __IOM uint32_t ADFSM5_CLR;                    /**< ADFSM5                                             */
  __IOM uint32_t ADFSM6_CLR;                    /**< ADFSM6                                             */
  __IOM uint32_t ADFSM7_CLR;                    /**< ADFSM7                                             */
  __IOM uint32_t ADFSM8_CLR;                    /**< ADFSM8                                             */
  __IOM uint32_t ADFSM9_CLR;                    /**< ADFSM9                                             */
  __IOM uint32_t ADFSM10_CLR;                   /**< ADFSM10                                            */
  __IOM uint32_t ADFSM11_CLR;                   /**< ADFSM11                                            */
  __IOM uint32_t ADFSM12_CLR;                   /**< ADFSM12                                            */
  __IOM uint32_t ADFSM13_CLR;                   /**< ADFSM13                                            */
  __IOM uint32_t ADFSM14_CLR;                   /**< ADFSM14                                            */
  __IOM uint32_t ADFSM15_CLR;                   /**< ADFSM15                                            */
  __IOM uint32_t ADFSM16_CLR;                   /**< ADFSM16                                            */
  __IOM uint32_t ADFSM17_CLR;                   /**< ADFSM17                                            */
  __IOM uint32_t ADFSM18_CLR;                   /**< ADFSM18                                            */
  __IOM uint32_t ADFSM19_CLR;                   /**< ADFSM19                                            */
  __IOM uint32_t ADFSM20_CLR;                   /**< ADFSM20                                            */
  __IOM uint32_t ADFSM21_CLR;                   /**< ADFSM21                                            */
  __IM uint32_t  ADFSM22_CLR;                   /**< ADFSM22                                            */
  __IOM uint32_t ADFSM23_CLR;                   /**< ADFSM23                                            */
  __IOM uint32_t ADFSM24_CLR;                   /**< ADFSM24                                            */
  __IOM uint32_t ADFSM25_CLR;                   /**< ADFSM25                                            */
  __IOM uint32_t ADFSM26_CLR;                   /**< ADFSM26                                            */
  __IOM uint32_t ADFSM27_CLR;                   /**< ADFSM27                                            */
  __IOM uint32_t ADFSM28_CLR;                   /**< ADFSM28                                            */
  __IOM uint32_t ADFSM29_CLR;                   /**< ADFSM29                                            */
  __IOM uint32_t ADFSM30_CLR;                   /**< ADFSM30                                            */
  __IOM uint32_t BCRCTRL0_CLR;                  /**< BCRCTRL0                                           */
  __IOM uint32_t BCRCTRL1_CLR;                  /**< BCRCTRL1                                           */
  __IOM uint32_t BCRDEMODCTRL_CLR;              /**< BCRDEMODCTRL                                       */
  __IOM uint32_t BCRDEMODOOK_CLR;               /**< BCRDEMODOOK                                        */
  __IOM uint32_t BCRDEMODAFC0_CLR;              /**< BCRDEMODAFC0                                       */
  __IOM uint32_t BCRDEMODAFC1_CLR;              /**< BCRDEMODAFC1                                       */
  __IOM uint32_t BCRDEMOD4FSK0_CLR;             /**< BCRDEMOD4FSK0                                      */
  __IOM uint32_t BCRDEMOD4FSK1_CLR;             /**< BCRDEMOD4FSK1                                      */
  __IOM uint32_t BCRDEMODANT_CLR;               /**< BCRDEMODANT                                        */
  __IOM uint32_t BCRDEMODRSSI_CLR;              /**< BCRDEMODRSSI                                       */
  __IOM uint32_t BCRDEMODARR0_CLR;              /**< BCRDEMODARR0                                       */
  __IOM uint32_t BCRDEMODARR1_CLR;              /**< BCRDEMODARR1                                       */
  __IOM uint32_t BCRDEMODARR2_CLR;              /**< BCRDEMODARR2                                       */
  __IOM uint32_t BCRDEMODKSI_CLR;               /**< BCR DEMOD KSI                                      */
  __IOM uint32_t BCRDEMODPMEXP_CLR;             /**< BCR DEMOD PM                                       */
  uint32_t       RESERVED40[37U];               /**< Reserved for future use                            */
  __IOM uint32_t SPARE_CLR;                     /**< Spare register                                     */
  uint32_t       RESERVED41[767U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version                                         */
  __IOM uint32_t EN_TGL;                        /**< Enable peripheral clock to this module             */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable                                   */
  __IOM uint32_t SEQIF_TGL;                     /**< SEQ Interrupt Flags                                */
  __IOM uint32_t SEQIEN_TGL;                    /**< SEQ Interrupt Enable                               */
  __IM uint32_t  STATUS_TGL;                    /**< Status Register                                    */
  __IM uint32_t  STATUS2_TGL;                   /**< Status Register 2                                  */
  __IM uint32_t  STATUS3_TGL;                   /**< Status Register 3                                  */
  __IM uint32_t  STATUS4_TGL;                   /**< ANT DIV RSSI Status                                */
  uint32_t       RESERVED42[1U];                /**< Reserved for future use                            */
  __IM uint32_t  STATUS6_TGL;                   /**< ANT DIV Correlation Status                         */
  __IM uint32_t  STATUS7_TGL;                   /**< PHASE Demod Status                                 */
  __IM uint32_t  TIMDETSTATUS_TGL;              /**< Timing Detection Status Register                   */
  __IM uint32_t  FSMSTATUS_TGL;                 /**< Demod FSM Status Register                          */
  __IM uint32_t  FREQOFFEST_TGL;                /**< Frequency Offset Estimate                          */
  __IOM uint32_t AFCADJRX_TGL;                  /**< AFC Adjustment RX                                  */
  __IOM uint32_t AFCADJTX_TGL;                  /**< AFC Adjustment TX                                  */
  uint32_t       RESERVED43[1U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL0_TGL;                     /**< Control Register 0                                 */
  __IOM uint32_t CTRL1_TGL;                     /**< Control Register 1                                 */
  __IOM uint32_t CTRL2_TGL;                     /**< Control Register 2                                 */
  __IOM uint32_t CTRL3_TGL;                     /**< Control Register 3                                 */
  __IOM uint32_t CTRL4_TGL;                     /**< Control Register 4                                 */
  __IOM uint32_t CTRL5_TGL;                     /**< Control Register 5                                 */
  __IOM uint32_t CTRL6_TGL;                     /**< Control Register 6                                 */
  __IOM uint32_t TXBR_TGL;                      /**< Transmit baudrate                                  */
  __IOM uint32_t RXBR_TGL;                      /**< Receive Baudrate                                   */
  uint32_t       RESERVED44[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PRE_TGL;                       /**< Preamble Register                                  */
  __IOM uint32_t SYNC0_TGL;                     /**< Sync word 0                                        */
  __IOM uint32_t SYNC1_TGL;                     /**< Sync word 1                                        */
  __IOM uint32_t TIMING_TGL;                    /**< Timing Register                                    */
  __IOM uint32_t DSSS0_TGL;                     /**< DSSS symbol 0 Register                             */
  __IOM uint32_t MODINDEX_TGL;                  /**< Modulation Index                                   */
  __IOM uint32_t AFC_TGL;                       /**< Automatic Frequency Control                        */
  __IOM uint32_t AFCADJLIM_TGL;                 /**< AFC Adjustment Limit                               */
  __IOM uint32_t SHAPING0_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING1_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING2_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING3_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING4_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING5_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING6_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING7_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING8_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING9_TGL;                  /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING10_TGL;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING11_TGL;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING12_TGL;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING13_TGL;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING14_TGL;                 /**< Shaping Coefficients                               */
  __IOM uint32_t SHAPING15_TGL;                 /**< Shaping Coefficients                               */
  __IOM uint32_t OOKSHAPING_TGL;                /**< OOK/ASK Shaping Control                            */
  __IOM uint32_t RAMPCTRL_TGL;                  /**< Ramping Register                                   */
  __IOM uint32_t RAMPLEV_TGL;                   /**< Ramping Register                                   */
  __IOM uint32_t ANARAMPCTRL_TGL;               /**< Analog Ramping Control                             */
  __IOM uint32_t ANARAMP0_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP1_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP2_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP3_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP4_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP5_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP6_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP7_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP8_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP9_TGL;                  /**< Analog Ramp LUT entries                            */
  __IOM uint32_t ANARAMP10_TGL;                 /**< Analog Ramp LUT entries                            */
  uint32_t       RESERVED45[4U];                /**< Reserved for future use                            */
  __IOM uint32_t INTAFC_TGL;                    /**< Internal AFC                                       */
  __IOM uint32_t DSATHD0_TGL;                   /**< DSA detector threshold-0                           */
  __IOM uint32_t DSATHD1_TGL;                   /**< DSA detector threshold-1                           */
  __IOM uint32_t DSATHD2_TGL;                   /**< DSA detector threshold-2                           */
  __IOM uint32_t DSATHD3_TGL;                   /**< DSA detector threshold 3                           */
  __IOM uint32_t DSATHD4_TGL;                   /**< DSA detector threshold 4                           */
  __IOM uint32_t DSACTRL_TGL;                   /**< DSA mode                                           */
  uint32_t       RESERVED46[1U];                /**< Reserved for future use                            */
  __IOM uint32_t VITERBIDEMOD_TGL;              /**< Viterbi demodulator                                */
  __IOM uint32_t VTCORRCFG0_TGL;                /**< Viterbi demodulator                                */
  __IOM uint32_t VTCORRCFG1_TGL;                /**< Viterbi demodulator                                */
