SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
  __IOM uint32_t VTTRACK_TGL;                   /**< Viterbi demodulator tracking loop                  */
  __IOM uint32_t VTBLETIMING_TGL;               /**< Viterbi BLE timing stamp control                   */
  __IM uint32_t  BREST_TGL;                     /**< Baudrate Estimate                                  */
  __IOM uint32_t AUTOCG_TGL;                    /**< Automatic clock gating                             */
  __IOM uint32_t CGCLKSTOP_TGL;                 /**< Automatic clock gating                             */
  __IM uint32_t  POE_TGL;                       /**< Phase Offset Estimate                              */
  __IOM uint32_t DIRECTMODE_TGL;                /**< Direct Mode Control                                */
  uint32_t       RESERVED47[1U];                /**< Reserved for future use                            */
  __IOM uint32_t LONGRANGE1_TGL;                /**< BLE Long Range Set1                                */
  __IOM uint32_t LONGRANGE2_TGL;                /**< BLE Long Range Set2                                */
  __IOM uint32_t LONGRANGE3_TGL;                /**< BLE Long Range Set3                                */
  __IOM uint32_t LONGRANGE4_TGL;                /**< BLE Long Range Set4                                */
  __IOM uint32_t LONGRANGE5_TGL;                /**< BLE Long Range Set5                                */
  __IOM uint32_t LONGRANGE6_TGL;                /**< BLE Long Range Set6                                */
  __IOM uint32_t LRFRC_TGL;                     /**< BLE Long Range FRC interface                       */
  __IOM uint32_t COH0_TGL;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH1_TGL;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH2_TGL;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t COH3_TGL;                      /**< Coherent demodulator control signals               */
  __IOM uint32_t CMD_TGL;                       /**< Command register                                   */
  uint32_t       RESERVED48[2U];                /**< Reserved for future use                            */
  __IOM uint32_t SYNCPROPERTIES_TGL;            /**< Sync word properties                               */
  uint32_t       RESERVED49[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PRSCTRL_TGL;                   /**< Mux control for PRS outputs                        */
  uint32_t       RESERVED50[1U];                /**< Reserved for future use                            */
  __IOM uint32_t REALTIMCFE_TGL;                /**< Real time Cost Function Engine CTRL                */
  __IOM uint32_t ETSCTRL_TGL;                   /**< Early Time Stamp Control                           */
  __IOM uint32_t ETSTIM_TGL;                    /**< Early Time Stamp Timing                            */
  __IOM uint32_t ANTSWCTRL_TGL;                 /**< Antenna Switch Control                             */
  __IOM uint32_t ANTSWCTRL1_TGL;                /**< Antenna Switch Control 1                           */
  __IOM uint32_t ANTSWSTART_TGL;                /**< Antenna Switch Start                               */
  __IOM uint32_t ANTSWEND_TGL;                  /**< Antenna Switch End                                 */
  __IOM uint32_t TRECPMPATT_TGL;                /**< TRECS Preamble pattern                             */
  __IOM uint32_t TRECPMDET_TGL;                 /**< TRECS preamble Detection CTRL                      */
  __IOM uint32_t TRECSCFG_TGL;                  /**< TRECS configuration                                */
  __IOM uint32_t CFGANTPATT_TGL;                /**< Configure Antenna Pattern                          */
  uint32_t       RESERVED51[17U];               /**< Reserved for future use                            */
  __IOM uint32_t FRMSCHTIME_TGL;                /**< FRAM SCH TIME-OUT length                           */
  __IOM uint32_t PREFILTCOEFF_TGL;              /**< Preamble Filter Coefficients                       */
  __IOM uint32_t RXRESTART_TGL;                 /**< Collision restart control                          */
  __IOM uint32_t SQ_TGL;                        /**< Preamble Sense Mode                                */
  __IOM uint32_t SQEXT_TGL;                     /**< Preamble Sense Mode EXT                            */
  __IOM uint32_t SQI_TGL;                       /**< Signal quality indicator                           */
  __IOM uint32_t ANTDIVCTRL_TGL;                /**< Antenna Diversity Mode Control Register            */
  __IOM uint32_t ANTDIVFW_TGL;                  /**< PHASE DEMOD FW mode                                */
  __IOM uint32_t PHDMODANTDIV_TGL;              /**< PHASE DEMOD ANTENNA DIVSERSITY                     */
  __IOM uint32_t PHANTDECSION_TGL;              /**< PHASE DEMOD ANT-DIV Decision                       */
  __IOM uint32_t PHDMODCTRL_TGL;                /**< PHASE DEMOD CTRL                                   */
  uint32_t       RESERVED52[12U];               /**< Reserved for future use                            */
  __IOM uint32_t ADCTRL1_TGL;                   /**< ADCTRL1                                            */
  uint32_t       RESERVED53[1U];                /**< Reserved for future use                            */
  __IM uint32_t  ADQUAL0_TGL;                   /**< ADQUAL0                                            */
  __IM uint32_t  ADQUAL1_TGL;                   /**< ADQUAL1                                            */
  __IM uint32_t  ADQUAL2_TGL;                   /**< ADQUAL2                                            */
  __IM uint32_t  ADQUAL3_TGL;                   /**< ADQUAL3                                            */
  __IOM uint32_t ADQUAL4_TGL;                   /**< ADQUAL4                                            */
  __IOM uint32_t ADQUAL5_TGL;                   /**< ADQUAL5                                            */
  __IOM uint32_t ADQUAL6_TGL;                   /**< ADQUAL6                                            */
  __IOM uint32_t ADQUAL7_TGL;                   /**< ADQUAL7                                            */
  __IOM uint32_t ADQUAL8_TGL;                   /**< ADQUAL8                                            */
  __IM uint32_t  ADQUAL9_TGL;                   /**< ADQUAL9                                            */
  __IM uint32_t  ADQUAL10_TGL;                  /**< ADQUAL10                                           */
  __IOM uint32_t ADFSM0_TGL;                    /**< ADFSM0                                             */
  __IOM uint32_t ADFSM1_TGL;                    /**< ADFSM1                                             */
  __IOM uint32_t ADFSM2_TGL;                    /**< ADFSM2                                             */
  __IOM uint32_t ADFSM3_TGL;                    /**< ADFSM3                                             */
  __IOM uint32_t ADFSM4_TGL;                    /**< ADFSM4                                             */
  __IOM uint32_t ADFSM5_TGL;                    /**< ADFSM5                                             */
  __IOM uint32_t ADFSM6_TGL;                    /**< ADFSM6                                             */
  __IOM uint32_t ADFSM7_TGL;                    /**< ADFSM7                                             */
  __IOM uint32_t ADFSM8_TGL;                    /**< ADFSM8                                             */
  __IOM uint32_t ADFSM9_TGL;                    /**< ADFSM9                                             */
  __IOM uint32_t ADFSM10_TGL;                   /**< ADFSM10                                            */
  __IOM uint32_t ADFSM11_TGL;                   /**< ADFSM11                                            */
  __IOM uint32_t ADFSM12_TGL;                   /**< ADFSM12                                            */
  __IOM uint32_t ADFSM13_TGL;                   /**< ADFSM13                                            */
  __IOM uint32_t ADFSM14_TGL;                   /**< ADFSM14                                            */
  __IOM uint32_t ADFSM15_TGL;                   /**< ADFSM15                                            */
  __IOM uint32_t ADFSM16_TGL;                   /**< ADFSM16                                            */
  __IOM uint32_t ADFSM17_TGL;                   /**< ADFSM17                                            */
  __IOM uint32_t ADFSM18_TGL;                   /**< ADFSM18                                            */
  __IOM uint32_t ADFSM19_TGL;                   /**< ADFSM19                                            */
  __IOM uint32_t ADFSM20_TGL;                   /**< ADFSM20                                            */
  __IOM uint32_t ADFSM21_TGL;                   /**< ADFSM21                                            */
  __IM uint32_t  ADFSM22_TGL;                   /**< ADFSM22                                            */
  __IOM uint32_t ADFSM23_TGL;                   /**< ADFSM23                                            */
  __IOM uint32_t ADFSM24_TGL;                   /**< ADFSM24                                            */
  __IOM uint32_t ADFSM25_TGL;                   /**< ADFSM25                                            */
  __IOM uint32_t ADFSM26_TGL;                   /**< ADFSM26                                            */
  __IOM uint32_t ADFSM27_TGL;                   /**< ADFSM27                                            */
  __IOM uint32_t ADFSM28_TGL;                   /**< ADFSM28                                            */
  __IOM uint32_t ADFSM29_TGL;                   /**< ADFSM29                                            */
  __IOM uint32_t ADFSM30_TGL;                   /**< ADFSM30                                            */
  __IOM uint32_t BCRCTRL0_TGL;                  /**< BCRCTRL0                                           */
  __IOM uint32_t BCRCTRL1_TGL;                  /**< BCRCTRL1                                           */
  __IOM uint32_t BCRDEMODCTRL_TGL;              /**< BCRDEMODCTRL                                       */
  __IOM uint32_t BCRDEMODOOK_TGL;               /**< BCRDEMODOOK                                        */
  __IOM uint32_t BCRDEMODAFC0_TGL;              /**< BCRDEMODAFC0                                       */
  __IOM uint32_t BCRDEMODAFC1_TGL;              /**< BCRDEMODAFC1                                       */
  __IOM uint32_t BCRDEMOD4FSK0_TGL;             /**< BCRDEMOD4FSK0                                      */
  __IOM uint32_t BCRDEMOD4FSK1_TGL;             /**< BCRDEMOD4FSK1                                      */
  __IOM uint32_t BCRDEMODANT_TGL;               /**< BCRDEMODANT                                        */
  __IOM uint32_t BCRDEMODRSSI_TGL;              /**< BCRDEMODRSSI                                       */
  __IOM uint32_t BCRDEMODARR0_TGL;              /**< BCRDEMODARR0                                       */
  __IOM uint32_t BCRDEMODARR1_TGL;              /**< BCRDEMODARR1                                       */
  __IOM uint32_t BCRDEMODARR2_TGL;              /**< BCRDEMODARR2                                       */
  __IOM uint32_t BCRDEMODKSI_TGL;               /**< BCR DEMOD KSI                                      */
  __IOM uint32_t BCRDEMODPMEXP_TGL;             /**< BCR DEMOD PM                                       */
  uint32_t       RESERVED54[37U];               /**< Reserved for future use                            */
  __IOM uint32_t SPARE_TGL;                     /**< Spare register                                     */
} MODEM_TypeDef;
/** @} End of group EFR32FG25_MODEM */

/**************************************************************************//**
 * @addtogroup EFR32FG25_MODEM
 * @{
 * @defgroup EFR32FG25_MODEM_BitFields MODEM Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for MODEM IPVERSION */
#define _MODEM_IPVERSION_RESETVALUE                          0x00000004UL                              /**< Default value for MODEM_IPVERSION           */
#define _MODEM_IPVERSION_MASK                                0xFFFFFFFFUL                              /**< Mask for MODEM_IPVERSION                    */
#define _MODEM_IPVERSION_IPVERSION_SHIFT                     0                                         /**< Shift value for MODEM_IPVERSION             */
#define _MODEM_IPVERSION_IPVERSION_MASK                      0xFFFFFFFFUL                              /**< Bit mask for MODEM_IPVERSION                */
#define _MODEM_IPVERSION_IPVERSION_DEFAULT                   0x00000004UL                              /**< Mode DEFAULT for MODEM_IPVERSION            */
#define MODEM_IPVERSION_IPVERSION_DEFAULT                    (_MODEM_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_IPVERSION    */

