SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM SEQIF */
#define _MODEM_SEQIF_RESETVALUE                              0x00000000UL                                /**< Default value for MODEM_SEQIF               */
#define _MODEM_SEQIF_MASK                                    0x0FE7FFFFUL                                /**< Mask for MODEM_SEQIF                        */
#define MODEM_SEQIF_TXFRAMESENT                              (0x1UL << 0)                                /**< Frame sent                                  */
#define _MODEM_SEQIF_TXFRAMESENT_SHIFT                       0                                           /**< Shift value for MODEM_TXFRAMESENT           */
#define _MODEM_SEQIF_TXFRAMESENT_MASK                        0x1UL                                       /**< Bit mask for MODEM_TXFRAMESENT              */
#define _MODEM_SEQIF_TXFRAMESENT_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_TXFRAMESENT_DEFAULT                      (_MODEM_SEQIF_TXFRAMESENT_DEFAULT << 0)     /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_TXSYNCSENT                               (0x1UL << 1)                                /**< Sync word sent                              */
#define _MODEM_SEQIF_TXSYNCSENT_SHIFT                        1                                           /**< Shift value for MODEM_TXSYNCSENT            */
#define _MODEM_SEQIF_TXSYNCSENT_MASK                         0x2UL                                       /**< Bit mask for MODEM_TXSYNCSENT               */
#define _MODEM_SEQIF_TXSYNCSENT_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_TXSYNCSENT_DEFAULT                       (_MODEM_SEQIF_TXSYNCSENT_DEFAULT << 1)      /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_TXPRESENT                                (0x1UL << 2)                                /**< Preamble sent                               */
#define _MODEM_SEQIF_TXPRESENT_SHIFT                         2                                           /**< Shift value for MODEM_TXPRESENT             */
#define _MODEM_SEQIF_TXPRESENT_MASK                          0x4UL                                       /**< Bit mask for MODEM_TXPRESENT                */
#define _MODEM_SEQIF_TXPRESENT_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_TXPRESENT_DEFAULT                        (_MODEM_SEQIF_TXPRESENT_DEFAULT << 2)       /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_TXRAMPDONE                               (0x1UL << 3)                                /**< Mod ramper idle                             */
#define _MODEM_SEQIF_TXRAMPDONE_SHIFT                        3                                           /**< Shift value for MODEM_TXRAMPDONE            */
#define _MODEM_SEQIF_TXRAMPDONE_MASK                         0x8UL                                       /**< Bit mask for MODEM_TXRAMPDONE               */
#define _MODEM_SEQIF_TXRAMPDONE_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_TXRAMPDONE_DEFAULT                       (_MODEM_SEQIF_TXRAMPDONE_DEFAULT << 3)      /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_LDTNOARR                                 (0x1UL << 4)                                /**< No signal Detected in LDT                   */
#define _MODEM_SEQIF_LDTNOARR_SHIFT                          4                                           /**< Shift value for MODEM_LDTNOARR              */
#define _MODEM_SEQIF_LDTNOARR_MASK                           0x10UL                                      /**< Bit mask for MODEM_LDTNOARR                 */
#define _MODEM_SEQIF_LDTNOARR_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_LDTNOARR_DEFAULT                         (_MODEM_SEQIF_LDTNOARR_DEFAULT << 4)        /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_PHDSADET                                 (0x1UL << 5)                                /**< PHASE DSA DETECT                            */
#define _MODEM_SEQIF_PHDSADET_SHIFT                          5                                           /**< Shift value for MODEM_PHDSADET              */
#define _MODEM_SEQIF_PHDSADET_MASK                           0x20UL                                      /**< Bit mask for MODEM_PHDSADET                 */
#define _MODEM_SEQIF_PHDSADET_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_PHDSADET_DEFAULT                         (_MODEM_SEQIF_PHDSADET_DEFAULT << 5)        /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_PHYUNCODEDET                             (0x1UL << 6)                                /**< CONCURRENT UNCODED PHY DET                  */
#define _MODEM_SEQIF_PHYUNCODEDET_SHIFT                      6                                           /**< Shift value for MODEM_PHYUNCODEDET          */
#define _MODEM_SEQIF_PHYUNCODEDET_MASK                       0x40UL                                      /**< Bit mask for MODEM_PHYUNCODEDET             */
#define _MODEM_SEQIF_PHYUNCODEDET_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_PHYUNCODEDET_DEFAULT                     (_MODEM_SEQIF_PHYUNCODEDET_DEFAULT << 6)    /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_PHYCODEDET                               (0x1UL << 7)                                /**< CONCURRENT CODED PHY DET                    */
#define _MODEM_SEQIF_PHYCODEDET_SHIFT                        7                                           /**< Shift value for MODEM_PHYCODEDET            */
#define _MODEM_SEQIF_PHYCODEDET_MASK                         0x80UL                                      /**< Bit mask for MODEM_PHYCODEDET               */
#define _MODEM_SEQIF_PHYCODEDET_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_PHYCODEDET_DEFAULT                       (_MODEM_SEQIF_PHYCODEDET_DEFAULT << 7)      /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_RXTIMDET                                 (0x1UL << 8)                                /**< Timing detected                             */
#define _MODEM_SEQIF_RXTIMDET_SHIFT                          8                                           /**< Shift value for MODEM_RXTIMDET              */
#define _MODEM_SEQIF_RXTIMDET_MASK                           0x100UL                                     /**< Bit mask for MODEM_RXTIMDET                 */
#define _MODEM_SEQIF_RXTIMDET_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_RXTIMDET_DEFAULT                         (_MODEM_SEQIF_RXTIMDET_DEFAULT << 8)        /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_RXPREDET                                 (0x1UL << 9)                                /**< Preamble detected                           */
#define _MODEM_SEQIF_RXPREDET_SHIFT                          9                                           /**< Shift value for MODEM_RXPREDET              */
#define _MODEM_SEQIF_RXPREDET_MASK                           0x200UL                                     /**< Bit mask for MODEM_RXPREDET                 */
#define _MODEM_SEQIF_RXPREDET_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_RXPREDET_DEFAULT                         (_MODEM_SEQIF_RXPREDET_DEFAULT << 9)        /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_RXFRAMEDET0                              (0x1UL << 10)                               /**< Frame with sync-word 0 detected             */
#define _MODEM_SEQIF_RXFRAMEDET0_SHIFT                       10                                          /**< Shift value for MODEM_RXFRAMEDET0           */
#define _MODEM_SEQIF_RXFRAMEDET0_MASK                        0x400UL                                     /**< Bit mask for MODEM_RXFRAMEDET0              */
#define _MODEM_SEQIF_RXFRAMEDET0_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_RXFRAMEDET0_DEFAULT                      (_MODEM_SEQIF_RXFRAMEDET0_DEFAULT << 10)    /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_RXFRAMEDET1                              (0x1UL << 11)                               /**< Frame with sync-word 1 detected             */
#define _MODEM_SEQIF_RXFRAMEDET1_SHIFT                       11                                          /**< Shift value for MODEM_RXFRAMEDET1           */
#define _MODEM_SEQIF_RXFRAMEDET1_MASK                        0x800UL                                     /**< Bit mask for MODEM_RXFRAMEDET1              */
#define _MODEM_SEQIF_RXFRAMEDET1_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_RXFRAMEDET1_DEFAULT                      (_MODEM_SEQIF_RXFRAMEDET1_DEFAULT << 11)    /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_RXTIMLOST                                (0x1UL << 12)                               /**< Timing lost                                 */
#define _MODEM_SEQIF_RXTIMLOST_SHIFT                         12                                          /**< Shift value for MODEM_RXTIMLOST             */
#define _MODEM_SEQIF_RXTIMLOST_MASK                          0x1000UL                                    /**< Bit mask for MODEM_RXTIMLOST                */
#define _MODEM_SEQIF_RXTIMLOST_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_RXTIMLOST_DEFAULT                        (_MODEM_SEQIF_RXTIMLOST_DEFAULT << 12)      /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_RXPRELOST                                (0x1UL << 13)                               /**< Preamble lost                               */
#define _MODEM_SEQIF_RXPRELOST_SHIFT                         13                                          /**< Shift value for MODEM_RXPRELOST             */
#define _MODEM_SEQIF_RXPRELOST_MASK                          0x2000UL                                    /**< Bit mask for MODEM_RXPRELOST                */
#define _MODEM_SEQIF_RXPRELOST_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_RXPRELOST_DEFAULT                        (_MODEM_SEQIF_RXPRELOST_DEFAULT << 13)      /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_RXFRAMEDETOF                             (0x1UL << 14)                               /**< Frame detection overflow                    */
#define _MODEM_SEQIF_RXFRAMEDETOF_SHIFT                      14                                          /**< Shift value for MODEM_RXFRAMEDETOF          */
#define _MODEM_SEQIF_RXFRAMEDETOF_MASK                       0x4000UL                                    /**< Bit mask for MODEM_RXFRAMEDETOF             */
#define _MODEM_SEQIF_RXFRAMEDETOF_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_RXFRAMEDETOF_DEFAULT                     (_MODEM_SEQIF_RXFRAMEDETOF_DEFAULT << 14)   /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_RXTIMNF                                  (0x1UL << 15)                               /**< Timing not found                            */
#define _MODEM_SEQIF_RXTIMNF_SHIFT                           15                                          /**< Shift value for MODEM_RXTIMNF               */
#define _MODEM_SEQIF_RXTIMNF_MASK                            0x8000UL                                    /**< Bit mask for MODEM_RXTIMNF                  */
#define _MODEM_SEQIF_RXTIMNF_DEFAULT                         0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_RXTIMNF_DEFAULT                          (_MODEM_SEQIF_RXTIMNF_DEFAULT << 15)        /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_FRCTIMOUT                                (0x1UL << 16)                               /**< DEMOD-FRC req/ack timeout                   */
#define _MODEM_SEQIF_FRCTIMOUT_SHIFT                         16                                          /**< Shift value for MODEM_FRCTIMOUT             */
#define _MODEM_SEQIF_FRCTIMOUT_MASK                          0x10000UL                                   /**< Bit mask for MODEM_FRCTIMOUT                */
#define _MODEM_SEQIF_FRCTIMOUT_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_FRCTIMOUT_DEFAULT                        (_MODEM_SEQIF_FRCTIMOUT_DEFAULT << 16)      /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_ETS                                      (0x1UL << 17)                               /**< Early timestamp                             */
#define _MODEM_SEQIF_ETS_SHIFT                               17                                          /**< Shift value for MODEM_ETS                   */
#define _MODEM_SEQIF_ETS_MASK                                0x20000UL                                   /**< Bit mask for MODEM_ETS                      */
#define _MODEM_SEQIF_ETS_DEFAULT                             0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_ETS_DEFAULT                              (_MODEM_SEQIF_ETS_DEFAULT << 17)            /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_CFGANTPATTRD                             (0x1UL << 18)                               /**< CFGANTPATTRD                                */
#define _MODEM_SEQIF_CFGANTPATTRD_SHIFT                      18                                          /**< Shift value for MODEM_CFGANTPATTRD          */
#define _MODEM_SEQIF_CFGANTPATTRD_MASK                       0x40000UL                                   /**< Bit mask for MODEM_CFGANTPATTRD             */
#define _MODEM_SEQIF_CFGANTPATTRD_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_CFGANTPATTRD_DEFAULT                     (_MODEM_SEQIF_CFGANTPATTRD_DEFAULT << 18)   /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_SQDET                                    (0x1UL << 21)                               /**< SQ Detected                                 */
#define _MODEM_SEQIF_SQDET_SHIFT                             21                                          /**< Shift value for MODEM_SQDET                 */
#define _MODEM_SEQIF_SQDET_MASK                              0x200000UL                                  /**< Bit mask for MODEM_SQDET                    */
#define _MODEM_SEQIF_SQDET_DEFAULT                           0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_SQDET_DEFAULT                            (_MODEM_SEQIF_SQDET_DEFAULT << 21)          /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_SQNOTDET                                 (0x1UL << 22)                               /**< SQ NOT Detected                             */
#define _MODEM_SEQIF_SQNOTDET_SHIFT                          22                                          /**< Shift value for MODEM_SQNOTDET              */
#define _MODEM_SEQIF_SQNOTDET_MASK                           0x400000UL                                  /**< Bit mask for MODEM_SQNOTDET                 */
#define _MODEM_SEQIF_SQNOTDET_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_SQNOTDET_DEFAULT                         (_MODEM_SEQIF_SQNOTDET_DEFAULT << 22)       /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_ANTDIVRDY                                (0x1UL << 23)                               /**< RSSI and CORR data Ready                    */
#define _MODEM_SEQIF_ANTDIVRDY_SHIFT                         23                                          /**< Shift value for MODEM_ANTDIVRDY             */
#define _MODEM_SEQIF_ANTDIVRDY_MASK                          0x800000UL                                  /**< Bit mask for MODEM_ANTDIVRDY                */
#define _MODEM_SEQIF_ANTDIVRDY_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_ANTDIVRDY_DEFAULT                        (_MODEM_SEQIF_ANTDIVRDY_DEFAULT << 23)      /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_SOFTRESETDONE                            (0x1UL << 24)                               /**< Soft reset done                             */
#define _MODEM_SEQIF_SOFTRESETDONE_SHIFT                     24                                          /**< Shift value for MODEM_SOFTRESETDONE         */
#define _MODEM_SEQIF_SOFTRESETDONE_MASK                      0x1000000UL                                 /**< Bit mask for MODEM_SOFTRESETDONE            */
#define _MODEM_SEQIF_SOFTRESETDONE_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_SOFTRESETDONE_DEFAULT                    (_MODEM_SEQIF_SOFTRESETDONE_DEFAULT << 24)  /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_SQPRENOTDET                              (0x1UL << 25)                               /**< SQ NOT Detected                             */
#define _MODEM_SEQIF_SQPRENOTDET_SHIFT                       25                                          /**< Shift value for MODEM_SQPRENOTDET           */
#define _MODEM_SEQIF_SQPRENOTDET_MASK                        0x2000000UL                                 /**< Bit mask for MODEM_SQPRENOTDET              */
#define _MODEM_SEQIF_SQPRENOTDET_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_SQPRENOTDET_DEFAULT                      (_MODEM_SEQIF_SQPRENOTDET_DEFAULT << 25)    /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_SQFRAMENOTDET                            (0x1UL << 26)                               /**< SQ NOT Detected                             */
#define _MODEM_SEQIF_SQFRAMENOTDET_SHIFT                     26                                          /**< Shift value for MODEM_SQFRAMENOTDET         */
#define _MODEM_SEQIF_SQFRAMENOTDET_MASK                      0x4000000UL                                 /**< Bit mask for MODEM_SQFRAMENOTDET            */
#define _MODEM_SEQIF_SQFRAMENOTDET_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_SQFRAMENOTDET_DEFAULT                    (_MODEM_SEQIF_SQFRAMENOTDET_DEFAULT << 26)  /**< Shifted mode DEFAULT for MODEM_SEQIF        */
#define MODEM_SEQIF_SQAFCOUTOFBAND                           (0x1UL << 27)                               /**< SQ afc out of band                          */
#define _MODEM_SEQIF_SQAFCOUTOFBAND_SHIFT                    27                                          /**< Shift value for MODEM_SQAFCOUTOFBAND        */
#define _MODEM_SEQIF_SQAFCOUTOFBAND_MASK                     0x8000000UL                                 /**< Bit mask for MODEM_SQAFCOUTOFBAND           */
#define _MODEM_SEQIF_SQAFCOUTOFBAND_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for MODEM_SEQIF                */
#define MODEM_SEQIF_SQAFCOUTOFBAND_DEFAULT                   (_MODEM_SEQIF_SQAFCOUTOFBAND_DEFAULT << 27) /**< Shifted mode DEFAULT for MODEM_SEQIF        */

