SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM STATUS6 */
#define _MODEM_STATUS6_RESETVALUE                            0x00000000UL                            /**< Default value for MODEM_STATUS6             */
#define _MODEM_STATUS6_MASK                                  0xC00FFFFFUL                            /**< Mask for MODEM_STATUS6                      */
#define _MODEM_STATUS6_ANT0CORR_SHIFT                        0                                       /**< Shift value for MODEM_ANT0CORR              */
#define _MODEM_STATUS6_ANT0CORR_MASK                         0x3FFUL                                 /**< Bit mask for MODEM_ANT0CORR                 */
#define _MODEM_STATUS6_ANT0CORR_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for MODEM_STATUS6              */
#define MODEM_STATUS6_ANT0CORR_DEFAULT                       (_MODEM_STATUS6_ANT0CORR_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_STATUS6      */
#define _MODEM_STATUS6_ANT1CORR_SHIFT                        10                                      /**< Shift value for MODEM_ANT1CORR              */
#define _MODEM_STATUS6_ANT1CORR_MASK                         0xFFC00UL                               /**< Bit mask for MODEM_ANT1CORR                 */
#define _MODEM_STATUS6_ANT1CORR_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for MODEM_STATUS6              */
#define MODEM_STATUS6_ANT1CORR_DEFAULT                       (_MODEM_STATUS6_ANT1CORR_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_STATUS6      */
#define MODEM_STATUS6_ANT0OUT                                (0x1UL << 30)                           /**< ANT0 OUTPUT                                 */
#define _MODEM_STATUS6_ANT0OUT_SHIFT                         30                                      /**< Shift value for MODEM_ANT0OUT               */
#define _MODEM_STATUS6_ANT0OUT_MASK                          0x40000000UL                            /**< Bit mask for MODEM_ANT0OUT                  */
#define _MODEM_STATUS6_ANT0OUT_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for MODEM_STATUS6              */
#define MODEM_STATUS6_ANT0OUT_DEFAULT                        (_MODEM_STATUS6_ANT0OUT_DEFAULT << 30)  /**< Shifted mode DEFAULT for MODEM_STATUS6      */
#define MODEM_STATUS6_ANT1OUT                                (0x1UL << 31)                           /**< ANT1 OUTPUT                                 */
#define _MODEM_STATUS6_ANT1OUT_SHIFT                         31                                      /**< Shift value for MODEM_ANT1OUT               */
#define _MODEM_STATUS6_ANT1OUT_MASK                          0x80000000UL                            /**< Bit mask for MODEM_ANT1OUT                  */
#define _MODEM_STATUS6_ANT1OUT_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for MODEM_STATUS6              */
#define MODEM_STATUS6_ANT1OUT_DEFAULT                        (_MODEM_STATUS6_ANT1OUT_DEFAULT << 31)  /**< Shifted mode DEFAULT for MODEM_STATUS6      */

/* Bit fields for MODEM STATUS7 */
#define _MODEM_STATUS7_RESETVALUE                            0x00000000UL                               /**< Default value for MODEM_STATUS7             */
#define _MODEM_STATUS7_MASK                                  0xBFFFFFFFUL                               /**< Mask for MODEM_STATUS7                      */
#define _MODEM_STATUS7_FDEVEST_SHIFT                         0                                          /**< Shift value for MODEM_FDEVEST               */
#define _MODEM_STATUS7_FDEVEST_MASK                          0x3FUL                                     /**< Bit mask for MODEM_FDEVEST                  */
#define _MODEM_STATUS7_FDEVEST_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for MODEM_STATUS7              */
#define MODEM_STATUS7_FDEVEST_DEFAULT                        (_MODEM_STATUS7_FDEVEST_DEFAULT << 0)      /**< Shifted mode DEFAULT for MODEM_STATUS7      */
#define _MODEM_STATUS7_DEMODSOFT_SHIFT                       6                                          /**< Shift value for MODEM_DEMODSOFT             */
#define _MODEM_STATUS7_DEMODSOFT_MASK                        0x7FFC0UL                                  /**< Bit mask for MODEM_DEMODSOFT                */
#define _MODEM_STATUS7_DEMODSOFT_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for MODEM_STATUS7              */
#define MODEM_STATUS7_DEMODSOFT_DEFAULT                      (_MODEM_STATUS7_DEMODSOFT_DEFAULT << 6)    /**< Shifted mode DEFAULT for MODEM_STATUS7      */
#define _MODEM_STATUS7_CFEPHDIFF_SHIFT                       19                                         /**< Shift value for MODEM_CFEPHDIFF             */
#define _MODEM_STATUS7_CFEPHDIFF_MASK                        0x1FF80000UL                               /**< Bit mask for MODEM_CFEPHDIFF                */
#define _MODEM_STATUS7_CFEPHDIFF_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for MODEM_STATUS7              */
#define MODEM_STATUS7_CFEPHDIFF_DEFAULT                      (_MODEM_STATUS7_CFEPHDIFF_DEFAULT << 19)   /**< Shifted mode DEFAULT for MODEM_STATUS7      */
#define MODEM_STATUS7_MINCOSTPASS                            (0x1UL << 29)                              /**< Min.COST Threshold Pass                     */
#define _MODEM_STATUS7_MINCOSTPASS_SHIFT                     29                                         /**< Shift value for MODEM_MINCOSTPASS           */
#define _MODEM_STATUS7_MINCOSTPASS_MASK                      0x20000000UL                               /**< Bit mask for MODEM_MINCOSTPASS              */
#define _MODEM_STATUS7_MINCOSTPASS_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for MODEM_STATUS7              */
#define MODEM_STATUS7_MINCOSTPASS_DEFAULT                    (_MODEM_STATUS7_MINCOSTPASS_DEFAULT << 29) /**< Shifted mode DEFAULT for MODEM_STATUS7      */
#define MODEM_STATUS7_CFEDSADET                              (0x1UL << 31)                              /**< CFE-based DSA Detection                     */
#define _MODEM_STATUS7_CFEDSADET_SHIFT                       31                                         /**< Shift value for MODEM_CFEDSADET             */
#define _MODEM_STATUS7_CFEDSADET_MASK                        0x80000000UL                               /**< Bit mask for MODEM_CFEDSADET                */
#define _MODEM_STATUS7_CFEDSADET_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for MODEM_STATUS7              */
#define MODEM_STATUS7_CFEDSADET_DEFAULT                      (_MODEM_STATUS7_CFEDSADET_DEFAULT << 31)   /**< Shifted mode DEFAULT for MODEM_STATUS7      */

/* Bit fields for MODEM TIMDETSTATUS */
#define _MODEM_TIMDETSTATUS_RESETVALUE                       0x00000000UL                                        /**< Default value for MODEM_TIMDETSTATUS        */
#define _MODEM_TIMDETSTATUS_MASK                             0x1F0FFFFFUL                                        /**< Mask for MODEM_TIMDETSTATUS                 */
#define _MODEM_TIMDETSTATUS_TIMDETCORR_SHIFT                 0                                                   /**< Shift value for MODEM_TIMDETCORR            */
#define _MODEM_TIMDETSTATUS_TIMDETCORR_MASK                  0xFFUL                                              /**< Bit mask for MODEM_TIMDETCORR               */
#define _MODEM_TIMDETSTATUS_TIMDETCORR_DEFAULT               0x00000000UL                                        /**< Mode DEFAULT for MODEM_TIMDETSTATUS         */
#define MODEM_TIMDETSTATUS_TIMDETCORR_DEFAULT                (_MODEM_TIMDETSTATUS_TIMDETCORR_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_TIMDETSTATUS */
#define _MODEM_TIMDETSTATUS_TIMDETFREQOFFEST_SHIFT           8                                                   /**< Shift value for MODEM_TIMDETFREQOFFEST      */
#define _MODEM_TIMDETSTATUS_TIMDETFREQOFFEST_MASK            0xFF00UL                                            /**< Bit mask for MODEM_TIMDETFREQOFFEST         */
#define _MODEM_TIMDETSTATUS_TIMDETFREQOFFEST_DEFAULT         0x00000000UL                                        /**< Mode DEFAULT for MODEM_TIMDETSTATUS         */
#define MODEM_TIMDETSTATUS_TIMDETFREQOFFEST_DEFAULT          (_MODEM_TIMDETSTATUS_TIMDETFREQOFFEST_DEFAULT << 8) /**< Shifted mode DEFAULT for MODEM_TIMDETSTATUS */
#define _MODEM_TIMDETSTATUS_TIMDETPREERRORS_SHIFT            16                                                  /**< Shift value for MODEM_TIMDETPREERRORS       */
#define _MODEM_TIMDETSTATUS_TIMDETPREERRORS_MASK             0xF0000UL                                           /**< Bit mask for MODEM_TIMDETPREERRORS          */
#define _MODEM_TIMDETSTATUS_TIMDETPREERRORS_DEFAULT          0x00000000UL                                        /**< Mode DEFAULT for MODEM_TIMDETSTATUS         */
#define MODEM_TIMDETSTATUS_TIMDETPREERRORS_DEFAULT           (_MODEM_TIMDETSTATUS_TIMDETPREERRORS_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_TIMDETSTATUS */
#define MODEM_TIMDETSTATUS_TIMDETPASS                        (0x1UL << 24)                                       /**< Timing detection pass                       */
#define _MODEM_TIMDETSTATUS_TIMDETPASS_SHIFT                 24                                                  /**< Shift value for MODEM_TIMDETPASS            */
#define _MODEM_TIMDETSTATUS_TIMDETPASS_MASK                  0x1000000UL                                         /**< Bit mask for MODEM_TIMDETPASS               */
#define _MODEM_TIMDETSTATUS_TIMDETPASS_DEFAULT               0x00000000UL                                        /**< Mode DEFAULT for MODEM_TIMDETSTATUS         */
#define MODEM_TIMDETSTATUS_TIMDETPASS_DEFAULT                (_MODEM_TIMDETSTATUS_TIMDETPASS_DEFAULT << 24)      /**< Shifted mode DEFAULT for MODEM_TIMDETSTATUS */
#define _MODEM_TIMDETSTATUS_TIMDETINDEX_SHIFT                25                                                  /**< Shift value for MODEM_TIMDETINDEX           */
#define _MODEM_TIMDETSTATUS_TIMDETINDEX_MASK                 0x1E000000UL                                        /**< Bit mask for MODEM_TIMDETINDEX              */
#define _MODEM_TIMDETSTATUS_TIMDETINDEX_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for MODEM_TIMDETSTATUS         */
#define MODEM_TIMDETSTATUS_TIMDETINDEX_DEFAULT               (_MODEM_TIMDETSTATUS_TIMDETINDEX_DEFAULT << 25)     /**< Shifted mode DEFAULT for MODEM_TIMDETSTATUS */

