SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM RAMPLEV */
#define _MODEM_RAMPLEV_RESETVALUE                            0x009F9F9FUL                            /**< Default value for MODEM_RAMPLEV             */
#define _MODEM_RAMPLEV_MASK                                  0x00FFFFFFUL                            /**< Mask for MODEM_RAMPLEV                      */
#define _MODEM_RAMPLEV_RAMPLEV0_SHIFT                        0                                       /**< Shift value for MODEM_RAMPLEV0              */
#define _MODEM_RAMPLEV_RAMPLEV0_MASK                         0xFFUL                                  /**< Bit mask for MODEM_RAMPLEV0                 */
#define _MODEM_RAMPLEV_RAMPLEV0_DEFAULT                      0x0000009FUL                            /**< Mode DEFAULT for MODEM_RAMPLEV              */
#define MODEM_RAMPLEV_RAMPLEV0_DEFAULT                       (_MODEM_RAMPLEV_RAMPLEV0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_RAMPLEV      */
#define _MODEM_RAMPLEV_RAMPLEV1_SHIFT                        8                                       /**< Shift value for MODEM_RAMPLEV1              */
#define _MODEM_RAMPLEV_RAMPLEV1_MASK                         0xFF00UL                                /**< Bit mask for MODEM_RAMPLEV1                 */
#define _MODEM_RAMPLEV_RAMPLEV1_DEFAULT                      0x0000009FUL                            /**< Mode DEFAULT for MODEM_RAMPLEV              */
#define MODEM_RAMPLEV_RAMPLEV1_DEFAULT                       (_MODEM_RAMPLEV_RAMPLEV1_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_RAMPLEV      */
#define _MODEM_RAMPLEV_RAMPLEV2_SHIFT                        16                                      /**< Shift value for MODEM_RAMPLEV2              */
#define _MODEM_RAMPLEV_RAMPLEV2_MASK                         0xFF0000UL                              /**< Bit mask for MODEM_RAMPLEV2                 */
#define _MODEM_RAMPLEV_RAMPLEV2_DEFAULT                      0x0000009FUL                            /**< Mode DEFAULT for MODEM_RAMPLEV              */
#define MODEM_RAMPLEV_RAMPLEV2_DEFAULT                       (_MODEM_RAMPLEV_RAMPLEV2_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_RAMPLEV      */

/* Bit fields for MODEM ANARAMPCTRL */
#define _MODEM_ANARAMPCTRL_RESETVALUE                        0x00000A81UL                                     /**< Default value for MODEM_ANARAMPCTRL         */
#define _MODEM_ANARAMPCTRL_MASK                              0x00001FFFUL                                     /**< Mask for MODEM_ANARAMPCTRL                  */
#define MODEM_ANARAMPCTRL_ANARAMPEN                          (0x1UL << 0)                                     /**< PA Analog Ramp Enable                       */
#define _MODEM_ANARAMPCTRL_ANARAMPEN_SHIFT                   0                                                /**< Shift value for MODEM_ANARAMPEN             */
#define _MODEM_ANARAMPCTRL_ANARAMPEN_MASK                    0x1UL                                            /**< Bit mask for MODEM_ANARAMPEN                */
#define _MODEM_ANARAMPCTRL_ANARAMPEN_DEFAULT                 0x00000001UL                                     /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define MODEM_ANARAMPCTRL_ANARAMPEN_DEFAULT                  (_MODEM_ANARAMPCTRL_ANARAMPEN_DEFAULT << 0)      /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_RAMPOVREN                          (0x1UL << 1)                                     /**< PA Analog Ramp Override                     */
#define _MODEM_ANARAMPCTRL_RAMPOVREN_SHIFT                   1                                                /**< Shift value for MODEM_RAMPOVREN             */
#define _MODEM_ANARAMPCTRL_RAMPOVREN_MASK                    0x2UL                                            /**< Bit mask for MODEM_RAMPOVREN                */
#define _MODEM_ANARAMPCTRL_RAMPOVREN_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define MODEM_ANARAMPCTRL_RAMPOVREN_DEFAULT                  (_MODEM_ANARAMPCTRL_RAMPOVREN_DEFAULT << 1)      /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_RAMPOVRUPD                         (0x1UL << 2)                                     /**< PA Analog Ramp Override Update Pulse        */
#define _MODEM_ANARAMPCTRL_RAMPOVRUPD_SHIFT                  2                                                /**< Shift value for MODEM_RAMPOVRUPD            */
#define _MODEM_ANARAMPCTRL_RAMPOVRUPD_MASK                   0x4UL                                            /**< Bit mask for MODEM_RAMPOVRUPD               */
#define _MODEM_ANARAMPCTRL_RAMPOVRUPD_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define MODEM_ANARAMPCTRL_RAMPOVRUPD_DEFAULT                 (_MODEM_ANARAMPCTRL_RAMPOVRUPD_DEFAULT << 2)     /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define _MODEM_ANARAMPCTRL_ANARAMPLUTODEV_SHIFT              3                                                /**< Shift value for MODEM_ANARAMPLUTODEV        */
#define _MODEM_ANARAMPCTRL_ANARAMPLUTODEV_MASK               0x1F8UL                                          /**< Bit mask for MODEM_ANARAMPLUTODEV           */
#define _MODEM_ANARAMPCTRL_ANARAMPLUTODEV_DEFAULT            0x00000010UL                                     /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define MODEM_ANARAMPCTRL_ANARAMPLUTODEV_DEFAULT             (_MODEM_ANARAMPCTRL_ANARAMPLUTODEV_DEFAULT << 3) /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_SHIFT                    9                                                /**< Shift value for MODEM_VMIDCTRL              */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_MASK                     0x600UL                                          /**< Bit mask for MODEM_VMIDCTRL                 */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_DEFAULT                  0x00000001UL                                     /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_OFF                      0x00000000UL                                     /**< Mode OFF for MODEM_ANARAMPCTRL              */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_MID                      0x00000001UL                                     /**< Mode MID for MODEM_ANARAMPCTRL              */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_HIGH                     0x00000002UL                                     /**< Mode HIGH for MODEM_ANARAMPCTRL             */
#define _MODEM_ANARAMPCTRL_VMIDCTRL_ON                       0x00000003UL                                     /**< Mode ON for MODEM_ANARAMPCTRL               */
#define MODEM_ANARAMPCTRL_VMIDCTRL_DEFAULT                   (_MODEM_ANARAMPCTRL_VMIDCTRL_DEFAULT << 9)       /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_VMIDCTRL_OFF                       (_MODEM_ANARAMPCTRL_VMIDCTRL_OFF << 9)           /**< Shifted mode OFF for MODEM_ANARAMPCTRL      */
#define MODEM_ANARAMPCTRL_VMIDCTRL_MID                       (_MODEM_ANARAMPCTRL_VMIDCTRL_MID << 9)           /**< Shifted mode MID for MODEM_ANARAMPCTRL      */
#define MODEM_ANARAMPCTRL_VMIDCTRL_HIGH                      (_MODEM_ANARAMPCTRL_VMIDCTRL_HIGH << 9)          /**< Shifted mode HIGH for MODEM_ANARAMPCTRL     */
#define MODEM_ANARAMPCTRL_VMIDCTRL_ON                        (_MODEM_ANARAMPCTRL_VMIDCTRL_ON << 9)            /**< Shifted mode ON for MODEM_ANARAMPCTRL       */
#define _MODEM_ANARAMPCTRL_MUTEDLY_SHIFT                     11                                               /**< Shift value for MODEM_MUTEDLY               */
#define _MODEM_ANARAMPCTRL_MUTEDLY_MASK                      0x1800UL                                         /**< Bit mask for MODEM_MUTEDLY                  */
#define _MODEM_ANARAMPCTRL_MUTEDLY_DEFAULT                   0x00000001UL                                     /**< Mode DEFAULT for MODEM_ANARAMPCTRL          */
#define _MODEM_ANARAMPCTRL_MUTEDLY_TIME0US                   0x00000000UL                                     /**< Mode TIME0US for MODEM_ANARAMPCTRL          */
#define _MODEM_ANARAMPCTRL_MUTEDLY_TIME0P5US                 0x00000001UL                                     /**< Mode TIME0P5US for MODEM_ANARAMPCTRL        */
#define _MODEM_ANARAMPCTRL_MUTEDLY_TIME0P25US                0x00000002UL                                     /**< Mode TIME0P25US for MODEM_ANARAMPCTRL       */
#define _MODEM_ANARAMPCTRL_MUTEDLY_NOTUSED                   0x00000003UL                                     /**< Mode NOTUSED for MODEM_ANARAMPCTRL          */
#define MODEM_ANARAMPCTRL_MUTEDLY_DEFAULT                    (_MODEM_ANARAMPCTRL_MUTEDLY_DEFAULT << 11)       /**< Shifted mode DEFAULT for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_MUTEDLY_TIME0US                    (_MODEM_ANARAMPCTRL_MUTEDLY_TIME0US << 11)       /**< Shifted mode TIME0US for MODEM_ANARAMPCTRL  */
#define MODEM_ANARAMPCTRL_MUTEDLY_TIME0P5US                  (_MODEM_ANARAMPCTRL_MUTEDLY_TIME0P5US << 11)     /**< Shifted mode TIME0P5US for MODEM_ANARAMPCTRL*/
#define MODEM_ANARAMPCTRL_MUTEDLY_TIME0P25US                 (_MODEM_ANARAMPCTRL_MUTEDLY_TIME0P25US << 11)    /**< Shifted mode TIME0P25US for MODEM_ANARAMPCTRL*/
#define MODEM_ANARAMPCTRL_MUTEDLY_NOTUSED                    (_MODEM_ANARAMPCTRL_MUTEDLY_NOTUSED << 11)       /**< Shifted mode NOTUSED for MODEM_ANARAMPCTRL  */

/* Bit fields for MODEM ANARAMP0 */
#define _MODEM_ANARAMP0_RESETVALUE                           0x08418C40UL                                /**< Default value for MODEM_ANARAMP0            */
#define _MODEM_ANARAMP0_MASK                                 0x3FFFFFFFUL                                /**< Mask for MODEM_ANARAMP0                     */
#define _MODEM_ANARAMP0_ANARAMPLUT0_SHIFT                    0                                           /**< Shift value for MODEM_ANARAMPLUT0           */
#define _MODEM_ANARAMP0_ANARAMPLUT0_MASK                     0x1FUL                                      /**< Bit mask for MODEM_ANARAMPLUT0              */
#define _MODEM_ANARAMP0_ANARAMPLUT0_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for MODEM_ANARAMP0             */
#define MODEM_ANARAMP0_ANARAMPLUT0_DEFAULT                   (_MODEM_ANARAMP0_ANARAMPLUT0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP0     */
#define _MODEM_ANARAMP0_ANARAMPLUT1_SHIFT                    5                                           /**< Shift value for MODEM_ANARAMPLUT1           */
#define _MODEM_ANARAMP0_ANARAMPLUT1_MASK                     0x3E0UL                                     /**< Bit mask for MODEM_ANARAMPLUT1              */
#define _MODEM_ANARAMP0_ANARAMPLUT1_DEFAULT                  0x00000002UL                                /**< Mode DEFAULT for MODEM_ANARAMP0             */
#define MODEM_ANARAMP0_ANARAMPLUT1_DEFAULT                   (_MODEM_ANARAMP0_ANARAMPLUT1_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP0     */
#define _MODEM_ANARAMP0_ANARAMPLUT2_SHIFT                    10                                          /**< Shift value for MODEM_ANARAMPLUT2           */
#define _MODEM_ANARAMP0_ANARAMPLUT2_MASK                     0x7C00UL                                    /**< Bit mask for MODEM_ANARAMPLUT2              */
#define _MODEM_ANARAMP0_ANARAMPLUT2_DEFAULT                  0x00000003UL                                /**< Mode DEFAULT for MODEM_ANARAMP0             */
#define MODEM_ANARAMP0_ANARAMPLUT2_DEFAULT                   (_MODEM_ANARAMP0_ANARAMPLUT2_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP0     */
#define _MODEM_ANARAMP0_ANARAMPLUT3_SHIFT                    15                                          /**< Shift value for MODEM_ANARAMPLUT3           */
#define _MODEM_ANARAMP0_ANARAMPLUT3_MASK                     0xF8000UL                                   /**< Bit mask for MODEM_ANARAMPLUT3              */
#define _MODEM_ANARAMP0_ANARAMPLUT3_DEFAULT                  0x00000003UL                                /**< Mode DEFAULT for MODEM_ANARAMP0             */
#define MODEM_ANARAMP0_ANARAMPLUT3_DEFAULT                   (_MODEM_ANARAMP0_ANARAMPLUT3_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP0     */
#define _MODEM_ANARAMP0_ANARAMPLUT4_SHIFT                    20                                          /**< Shift value for MODEM_ANARAMPLUT4           */
#define _MODEM_ANARAMP0_ANARAMPLUT4_MASK                     0x1F00000UL                                 /**< Bit mask for MODEM_ANARAMPLUT4              */
#define _MODEM_ANARAMP0_ANARAMPLUT4_DEFAULT                  0x00000004UL                                /**< Mode DEFAULT for MODEM_ANARAMP0             */
#define MODEM_ANARAMP0_ANARAMPLUT4_DEFAULT                   (_MODEM_ANARAMP0_ANARAMPLUT4_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP0     */
#define _MODEM_ANARAMP0_ANARAMPLUT5_SHIFT                    25                                          /**< Shift value for MODEM_ANARAMPLUT5           */
#define _MODEM_ANARAMP0_ANARAMPLUT5_MASK                     0x3E000000UL                                /**< Bit mask for MODEM_ANARAMPLUT5              */
#define _MODEM_ANARAMP0_ANARAMPLUT5_DEFAULT                  0x00000004UL                                /**< Mode DEFAULT for MODEM_ANARAMP0             */
#define MODEM_ANARAMP0_ANARAMPLUT5_DEFAULT                   (_MODEM_ANARAMP0_ANARAMPLUT5_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP0     */

/* Bit fields for MODEM ANARAMP1 */
#define _MODEM_ANARAMP1_RESETVALUE                           0x18A4A0C5UL                                 /**< Default value for MODEM_ANARAMP1            */
#define _MODEM_ANARAMP1_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP1                     */
#define _MODEM_ANARAMP1_ANARAMPLUT6_SHIFT                    0                                            /**< Shift value for MODEM_ANARAMPLUT6           */
#define _MODEM_ANARAMP1_ANARAMPLUT6_MASK                     0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT6              */
#define _MODEM_ANARAMP1_ANARAMPLUT6_DEFAULT                  0x00000005UL                                 /**< Mode DEFAULT for MODEM_ANARAMP1             */
#define MODEM_ANARAMP1_ANARAMPLUT6_DEFAULT                   (_MODEM_ANARAMP1_ANARAMPLUT6_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ANARAMP1     */
#define _MODEM_ANARAMP1_ANARAMPLUT7_SHIFT                    5                                            /**< Shift value for MODEM_ANARAMPLUT7           */
#define _MODEM_ANARAMP1_ANARAMPLUT7_MASK                     0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT7              */
#define _MODEM_ANARAMP1_ANARAMPLUT7_DEFAULT                  0x00000006UL                                 /**< Mode DEFAULT for MODEM_ANARAMP1             */
#define MODEM_ANARAMP1_ANARAMPLUT7_DEFAULT                   (_MODEM_ANARAMP1_ANARAMPLUT7_DEFAULT << 5)   /**< Shifted mode DEFAULT for MODEM_ANARAMP1     */
#define _MODEM_ANARAMP1_ANARAMPLUT8_SHIFT                    10                                           /**< Shift value for MODEM_ANARAMPLUT8           */
#define _MODEM_ANARAMP1_ANARAMPLUT8_MASK                     0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT8              */
#define _MODEM_ANARAMP1_ANARAMPLUT8_DEFAULT                  0x00000008UL                                 /**< Mode DEFAULT for MODEM_ANARAMP1             */
#define MODEM_ANARAMP1_ANARAMPLUT8_DEFAULT                   (_MODEM_ANARAMP1_ANARAMPLUT8_DEFAULT << 10)  /**< Shifted mode DEFAULT for MODEM_ANARAMP1     */
#define _MODEM_ANARAMP1_ANARAMPLUT9_SHIFT                    15                                           /**< Shift value for MODEM_ANARAMPLUT9           */
#define _MODEM_ANARAMP1_ANARAMPLUT9_MASK                     0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT9              */
#define _MODEM_ANARAMP1_ANARAMPLUT9_DEFAULT                  0x00000009UL                                 /**< Mode DEFAULT for MODEM_ANARAMP1             */
#define MODEM_ANARAMP1_ANARAMPLUT9_DEFAULT                   (_MODEM_ANARAMP1_ANARAMPLUT9_DEFAULT << 15)  /**< Shifted mode DEFAULT for MODEM_ANARAMP1     */
#define _MODEM_ANARAMP1_ANARAMPLUT10_SHIFT                   20                                           /**< Shift value for MODEM_ANARAMPLUT10          */
#define _MODEM_ANARAMP1_ANARAMPLUT10_MASK                    0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT10             */
#define _MODEM_ANARAMP1_ANARAMPLUT10_DEFAULT                 0x0000000AUL                                 /**< Mode DEFAULT for MODEM_ANARAMP1             */
#define MODEM_ANARAMP1_ANARAMPLUT10_DEFAULT                  (_MODEM_ANARAMP1_ANARAMPLUT10_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP1     */
#define _MODEM_ANARAMP1_ANARAMPLUT11_SHIFT                   25                                           /**< Shift value for MODEM_ANARAMPLUT11          */
#define _MODEM_ANARAMP1_ANARAMPLUT11_MASK                    0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT11             */
#define _MODEM_ANARAMP1_ANARAMPLUT11_DEFAULT                 0x0000000CUL                                 /**< Mode DEFAULT for MODEM_ANARAMP1             */
#define MODEM_ANARAMP1_ANARAMPLUT11_DEFAULT                  (_MODEM_ANARAMP1_ANARAMPLUT11_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP1     */

/* Bit fields for MODEM ANARAMP2 */
#define _MODEM_ANARAMP2_RESETVALUE                           0x020ED60DUL                                 /**< Default value for MODEM_ANARAMP2            */
#define _MODEM_ANARAMP2_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP2                     */
#define _MODEM_ANARAMP2_ANARAMPLUT12_SHIFT                   0                                            /**< Shift value for MODEM_ANARAMPLUT12          */
#define _MODEM_ANARAMP2_ANARAMPLUT12_MASK                    0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT12             */
#define _MODEM_ANARAMP2_ANARAMPLUT12_DEFAULT                 0x0000000DUL                                 /**< Mode DEFAULT for MODEM_ANARAMP2             */
#define MODEM_ANARAMP2_ANARAMPLUT12_DEFAULT                  (_MODEM_ANARAMP2_ANARAMPLUT12_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP2     */
#define _MODEM_ANARAMP2_ANARAMPLUT13_SHIFT                   5                                            /**< Shift value for MODEM_ANARAMPLUT13          */
#define _MODEM_ANARAMP2_ANARAMPLUT13_MASK                    0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT13             */
#define _MODEM_ANARAMP2_ANARAMPLUT13_DEFAULT                 0x00000010UL                                 /**< Mode DEFAULT for MODEM_ANARAMP2             */
#define MODEM_ANARAMP2_ANARAMPLUT13_DEFAULT                  (_MODEM_ANARAMP2_ANARAMPLUT13_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP2     */
#define _MODEM_ANARAMP2_ANARAMPLUT14_SHIFT                   10                                           /**< Shift value for MODEM_ANARAMPLUT14          */
#define _MODEM_ANARAMP2_ANARAMPLUT14_MASK                    0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT14             */
#define _MODEM_ANARAMP2_ANARAMPLUT14_DEFAULT                 0x00000015UL                                 /**< Mode DEFAULT for MODEM_ANARAMP2             */
#define MODEM_ANARAMP2_ANARAMPLUT14_DEFAULT                  (_MODEM_ANARAMP2_ANARAMPLUT14_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP2     */
#define _MODEM_ANARAMP2_ANARAMPLUT15_SHIFT                   15                                           /**< Shift value for MODEM_ANARAMPLUT15          */
#define _MODEM_ANARAMP2_ANARAMPLUT15_MASK                    0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT15             */
#define _MODEM_ANARAMP2_ANARAMPLUT15_DEFAULT                 0x0000001DUL                                 /**< Mode DEFAULT for MODEM_ANARAMP2             */
#define MODEM_ANARAMP2_ANARAMPLUT15_DEFAULT                  (_MODEM_ANARAMP2_ANARAMPLUT15_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP2     */
#define _MODEM_ANARAMP2_ANARAMPLUT16_SHIFT                   20                                           /**< Shift value for MODEM_ANARAMPLUT16          */
#define _MODEM_ANARAMP2_ANARAMPLUT16_MASK                    0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT16             */
#define _MODEM_ANARAMP2_ANARAMPLUT16_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ANARAMP2             */
#define MODEM_ANARAMP2_ANARAMPLUT16_DEFAULT                  (_MODEM_ANARAMP2_ANARAMPLUT16_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP2     */
#define _MODEM_ANARAMP2_ANARAMPLUT17_SHIFT                   25                                           /**< Shift value for MODEM_ANARAMPLUT17          */
#define _MODEM_ANARAMP2_ANARAMPLUT17_MASK                    0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT17             */
#define _MODEM_ANARAMP2_ANARAMPLUT17_DEFAULT                 0x00000001UL                                 /**< Mode DEFAULT for MODEM_ANARAMP2             */
#define MODEM_ANARAMP2_ANARAMPLUT17_DEFAULT                  (_MODEM_ANARAMP2_ANARAMPLUT17_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP2     */

