SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM ANARAMP5 */
#define _MODEM_ANARAMP5_RESETVALUE                           0x0C6294A5UL                                 /**< Default value for MODEM_ANARAMP5            */
#define _MODEM_ANARAMP5_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP5                     */
#define _MODEM_ANARAMP5_ANARAMPLUT30_SHIFT                   0                                            /**< Shift value for MODEM_ANARAMPLUT30          */
#define _MODEM_ANARAMP5_ANARAMPLUT30_MASK                    0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT30             */
#define _MODEM_ANARAMP5_ANARAMPLUT30_DEFAULT                 0x00000005UL                                 /**< Mode DEFAULT for MODEM_ANARAMP5             */
#define MODEM_ANARAMP5_ANARAMPLUT30_DEFAULT                  (_MODEM_ANARAMP5_ANARAMPLUT30_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP5     */
#define _MODEM_ANARAMP5_ANARAMPLUT31_SHIFT                   5                                            /**< Shift value for MODEM_ANARAMPLUT31          */
#define _MODEM_ANARAMP5_ANARAMPLUT31_MASK                    0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT31             */
#define _MODEM_ANARAMP5_ANARAMPLUT31_DEFAULT                 0x00000005UL                                 /**< Mode DEFAULT for MODEM_ANARAMP5             */
#define MODEM_ANARAMP5_ANARAMPLUT31_DEFAULT                  (_MODEM_ANARAMP5_ANARAMPLUT31_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP5     */
#define _MODEM_ANARAMP5_ANARAMPLUT32_SHIFT                   10                                           /**< Shift value for MODEM_ANARAMPLUT32          */
#define _MODEM_ANARAMP5_ANARAMPLUT32_MASK                    0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT32             */
#define _MODEM_ANARAMP5_ANARAMPLUT32_DEFAULT                 0x00000005UL                                 /**< Mode DEFAULT for MODEM_ANARAMP5             */
#define MODEM_ANARAMP5_ANARAMPLUT32_DEFAULT                  (_MODEM_ANARAMP5_ANARAMPLUT32_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP5     */
#define _MODEM_ANARAMP5_ANARAMPLUT33_SHIFT                   15                                           /**< Shift value for MODEM_ANARAMPLUT33          */
#define _MODEM_ANARAMP5_ANARAMPLUT33_MASK                    0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT33             */
#define _MODEM_ANARAMP5_ANARAMPLUT33_DEFAULT                 0x00000005UL                                 /**< Mode DEFAULT for MODEM_ANARAMP5             */
#define MODEM_ANARAMP5_ANARAMPLUT33_DEFAULT                  (_MODEM_ANARAMP5_ANARAMPLUT33_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP5     */
#define _MODEM_ANARAMP5_ANARAMPLUT34_SHIFT                   20                                           /**< Shift value for MODEM_ANARAMPLUT34          */
#define _MODEM_ANARAMP5_ANARAMPLUT34_MASK                    0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT34             */
#define _MODEM_ANARAMP5_ANARAMPLUT34_DEFAULT                 0x00000006UL                                 /**< Mode DEFAULT for MODEM_ANARAMP5             */
#define MODEM_ANARAMP5_ANARAMPLUT34_DEFAULT                  (_MODEM_ANARAMP5_ANARAMPLUT34_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP5     */
#define _MODEM_ANARAMP5_ANARAMPLUT35_SHIFT                   25                                           /**< Shift value for MODEM_ANARAMPLUT35          */
#define _MODEM_ANARAMP5_ANARAMPLUT35_MASK                    0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT35             */
#define _MODEM_ANARAMP5_ANARAMPLUT35_DEFAULT                 0x00000006UL                                 /**< Mode DEFAULT for MODEM_ANARAMP5             */
#define MODEM_ANARAMP5_ANARAMPLUT35_DEFAULT                  (_MODEM_ANARAMP5_ANARAMPLUT35_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP5     */

/* Bit fields for MODEM ANARAMP6 */
#define _MODEM_ANARAMP6_RESETVALUE                           0x10739CE6UL                                 /**< Default value for MODEM_ANARAMP6            */
#define _MODEM_ANARAMP6_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP6                     */
#define _MODEM_ANARAMP6_ANARAMPLUT36_SHIFT                   0                                            /**< Shift value for MODEM_ANARAMPLUT36          */
#define _MODEM_ANARAMP6_ANARAMPLUT36_MASK                    0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT36             */
#define _MODEM_ANARAMP6_ANARAMPLUT36_DEFAULT                 0x00000006UL                                 /**< Mode DEFAULT for MODEM_ANARAMP6             */
#define MODEM_ANARAMP6_ANARAMPLUT36_DEFAULT                  (_MODEM_ANARAMP6_ANARAMPLUT36_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP6     */
#define _MODEM_ANARAMP6_ANARAMPLUT37_SHIFT                   5                                            /**< Shift value for MODEM_ANARAMPLUT37          */
#define _MODEM_ANARAMP6_ANARAMPLUT37_MASK                    0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT37             */
#define _MODEM_ANARAMP6_ANARAMPLUT37_DEFAULT                 0x00000007UL                                 /**< Mode DEFAULT for MODEM_ANARAMP6             */
#define MODEM_ANARAMP6_ANARAMPLUT37_DEFAULT                  (_MODEM_ANARAMP6_ANARAMPLUT37_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP6     */
#define _MODEM_ANARAMP6_ANARAMPLUT38_SHIFT                   10                                           /**< Shift value for MODEM_ANARAMPLUT38          */
#define _MODEM_ANARAMP6_ANARAMPLUT38_MASK                    0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT38             */
#define _MODEM_ANARAMP6_ANARAMPLUT38_DEFAULT                 0x00000007UL                                 /**< Mode DEFAULT for MODEM_ANARAMP6             */
#define MODEM_ANARAMP6_ANARAMPLUT38_DEFAULT                  (_MODEM_ANARAMP6_ANARAMPLUT38_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP6     */
#define _MODEM_ANARAMP6_ANARAMPLUT39_SHIFT                   15                                           /**< Shift value for MODEM_ANARAMPLUT39          */
#define _MODEM_ANARAMP6_ANARAMPLUT39_MASK                    0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT39             */
#define _MODEM_ANARAMP6_ANARAMPLUT39_DEFAULT                 0x00000007UL                                 /**< Mode DEFAULT for MODEM_ANARAMP6             */
#define MODEM_ANARAMP6_ANARAMPLUT39_DEFAULT                  (_MODEM_ANARAMP6_ANARAMPLUT39_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP6     */
#define _MODEM_ANARAMP6_ANARAMPLUT40_SHIFT                   20                                           /**< Shift value for MODEM_ANARAMPLUT40          */
#define _MODEM_ANARAMP6_ANARAMPLUT40_MASK                    0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT40             */
#define _MODEM_ANARAMP6_ANARAMPLUT40_DEFAULT                 0x00000007UL                                 /**< Mode DEFAULT for MODEM_ANARAMP6             */
#define MODEM_ANARAMP6_ANARAMPLUT40_DEFAULT                  (_MODEM_ANARAMP6_ANARAMPLUT40_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP6     */
#define _MODEM_ANARAMP6_ANARAMPLUT41_SHIFT                   25                                           /**< Shift value for MODEM_ANARAMPLUT41          */
#define _MODEM_ANARAMP6_ANARAMPLUT41_MASK                    0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT41             */
#define _MODEM_ANARAMP6_ANARAMPLUT41_DEFAULT                 0x00000008UL                                 /**< Mode DEFAULT for MODEM_ANARAMP6             */
#define MODEM_ANARAMP6_ANARAMPLUT41_DEFAULT                  (_MODEM_ANARAMP6_ANARAMPLUT41_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP6     */

/* Bit fields for MODEM ANARAMP7 */
#define _MODEM_ANARAMP7_RESETVALUE                           0x1494A508UL                                 /**< Default value for MODEM_ANARAMP7            */
#define _MODEM_ANARAMP7_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP7                     */
#define _MODEM_ANARAMP7_ANARAMPLUT42_SHIFT                   0                                            /**< Shift value for MODEM_ANARAMPLUT42          */
#define _MODEM_ANARAMP7_ANARAMPLUT42_MASK                    0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT42             */
#define _MODEM_ANARAMP7_ANARAMPLUT42_DEFAULT                 0x00000008UL                                 /**< Mode DEFAULT for MODEM_ANARAMP7             */
#define MODEM_ANARAMP7_ANARAMPLUT42_DEFAULT                  (_MODEM_ANARAMP7_ANARAMPLUT42_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP7     */
#define _MODEM_ANARAMP7_ANARAMPLUT43_SHIFT                   5                                            /**< Shift value for MODEM_ANARAMPLUT43          */
#define _MODEM_ANARAMP7_ANARAMPLUT43_MASK                    0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT43             */
#define _MODEM_ANARAMP7_ANARAMPLUT43_DEFAULT                 0x00000008UL                                 /**< Mode DEFAULT for MODEM_ANARAMP7             */
#define MODEM_ANARAMP7_ANARAMPLUT43_DEFAULT                  (_MODEM_ANARAMP7_ANARAMPLUT43_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP7     */
#define _MODEM_ANARAMP7_ANARAMPLUT44_SHIFT                   10                                           /**< Shift value for MODEM_ANARAMPLUT44          */
#define _MODEM_ANARAMP7_ANARAMPLUT44_MASK                    0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT44             */
#define _MODEM_ANARAMP7_ANARAMPLUT44_DEFAULT                 0x00000009UL                                 /**< Mode DEFAULT for MODEM_ANARAMP7             */
#define MODEM_ANARAMP7_ANARAMPLUT44_DEFAULT                  (_MODEM_ANARAMP7_ANARAMPLUT44_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP7     */
#define _MODEM_ANARAMP7_ANARAMPLUT45_SHIFT                   15                                           /**< Shift value for MODEM_ANARAMPLUT45          */
#define _MODEM_ANARAMP7_ANARAMPLUT45_MASK                    0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT45             */
#define _MODEM_ANARAMP7_ANARAMPLUT45_DEFAULT                 0x00000009UL                                 /**< Mode DEFAULT for MODEM_ANARAMP7             */
#define MODEM_ANARAMP7_ANARAMPLUT45_DEFAULT                  (_MODEM_ANARAMP7_ANARAMPLUT45_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP7     */
#define _MODEM_ANARAMP7_ANARAMPLUT46_SHIFT                   20                                           /**< Shift value for MODEM_ANARAMPLUT46          */
#define _MODEM_ANARAMP7_ANARAMPLUT46_MASK                    0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT46             */
#define _MODEM_ANARAMP7_ANARAMPLUT46_DEFAULT                 0x00000009UL                                 /**< Mode DEFAULT for MODEM_ANARAMP7             */
#define MODEM_ANARAMP7_ANARAMPLUT46_DEFAULT                  (_MODEM_ANARAMP7_ANARAMPLUT46_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP7     */
#define _MODEM_ANARAMP7_ANARAMPLUT47_SHIFT                   25                                           /**< Shift value for MODEM_ANARAMPLUT47          */
#define _MODEM_ANARAMP7_ANARAMPLUT47_MASK                    0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT47             */
#define _MODEM_ANARAMP7_ANARAMPLUT47_DEFAULT                 0x0000000AUL                                 /**< Mode DEFAULT for MODEM_ANARAMP7             */
#define MODEM_ANARAMP7_ANARAMPLUT47_DEFAULT                  (_MODEM_ANARAMP7_ANARAMPLUT47_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP7     */

/* Bit fields for MODEM ANARAMP8 */
#define _MODEM_ANARAMP8_RESETVALUE                           0x18C5AD4AUL                                 /**< Default value for MODEM_ANARAMP8            */
#define _MODEM_ANARAMP8_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP8                     */
#define _MODEM_ANARAMP8_ANARAMPLUT48_SHIFT                   0                                            /**< Shift value for MODEM_ANARAMPLUT48          */
#define _MODEM_ANARAMP8_ANARAMPLUT48_MASK                    0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT48             */
#define _MODEM_ANARAMP8_ANARAMPLUT48_DEFAULT                 0x0000000AUL                                 /**< Mode DEFAULT for MODEM_ANARAMP8             */
#define MODEM_ANARAMP8_ANARAMPLUT48_DEFAULT                  (_MODEM_ANARAMP8_ANARAMPLUT48_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP8     */
#define _MODEM_ANARAMP8_ANARAMPLUT49_SHIFT                   5                                            /**< Shift value for MODEM_ANARAMPLUT49          */
#define _MODEM_ANARAMP8_ANARAMPLUT49_MASK                    0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT49             */
#define _MODEM_ANARAMP8_ANARAMPLUT49_DEFAULT                 0x0000000AUL                                 /**< Mode DEFAULT for MODEM_ANARAMP8             */
#define MODEM_ANARAMP8_ANARAMPLUT49_DEFAULT                  (_MODEM_ANARAMP8_ANARAMPLUT49_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP8     */
#define _MODEM_ANARAMP8_ANARAMPLUT50_SHIFT                   10                                           /**< Shift value for MODEM_ANARAMPLUT50          */
#define _MODEM_ANARAMP8_ANARAMPLUT50_MASK                    0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT50             */
#define _MODEM_ANARAMP8_ANARAMPLUT50_DEFAULT                 0x0000000BUL                                 /**< Mode DEFAULT for MODEM_ANARAMP8             */
#define MODEM_ANARAMP8_ANARAMPLUT50_DEFAULT                  (_MODEM_ANARAMP8_ANARAMPLUT50_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP8     */
#define _MODEM_ANARAMP8_ANARAMPLUT51_SHIFT                   15                                           /**< Shift value for MODEM_ANARAMPLUT51          */
#define _MODEM_ANARAMP8_ANARAMPLUT51_MASK                    0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT51             */
#define _MODEM_ANARAMP8_ANARAMPLUT51_DEFAULT                 0x0000000BUL                                 /**< Mode DEFAULT for MODEM_ANARAMP8             */
#define MODEM_ANARAMP8_ANARAMPLUT51_DEFAULT                  (_MODEM_ANARAMP8_ANARAMPLUT51_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP8     */
#define _MODEM_ANARAMP8_ANARAMPLUT52_SHIFT                   20                                           /**< Shift value for MODEM_ANARAMPLUT52          */
#define _MODEM_ANARAMP8_ANARAMPLUT52_MASK                    0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT52             */
#define _MODEM_ANARAMP8_ANARAMPLUT52_DEFAULT                 0x0000000CUL                                 /**< Mode DEFAULT for MODEM_ANARAMP8             */
#define MODEM_ANARAMP8_ANARAMPLUT52_DEFAULT                  (_MODEM_ANARAMP8_ANARAMPLUT52_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP8     */
#define _MODEM_ANARAMP8_ANARAMPLUT53_SHIFT                   25                                           /**< Shift value for MODEM_ANARAMPLUT53          */
#define _MODEM_ANARAMP8_ANARAMPLUT53_MASK                    0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT53             */
#define _MODEM_ANARAMP8_ANARAMPLUT53_DEFAULT                 0x0000000CUL                                 /**< Mode DEFAULT for MODEM_ANARAMP8             */
#define MODEM_ANARAMP8_ANARAMPLUT53_DEFAULT                  (_MODEM_ANARAMP8_ANARAMPLUT53_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP8     */

