SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM ANARAMP9 */
#define _MODEM_ANARAMP9_RESETVALUE                           0x2307B9ADUL                                 /**< Default value for MODEM_ANARAMP9            */
#define _MODEM_ANARAMP9_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP9                     */
#define _MODEM_ANARAMP9_ANARAMPLUT54_SHIFT                   0                                            /**< Shift value for MODEM_ANARAMPLUT54          */
#define _MODEM_ANARAMP9_ANARAMPLUT54_MASK                    0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT54             */
#define _MODEM_ANARAMP9_ANARAMPLUT54_DEFAULT                 0x0000000DUL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT54_DEFAULT                  (_MODEM_ANARAMP9_ANARAMPLUT54_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT55_SHIFT                   5                                            /**< Shift value for MODEM_ANARAMPLUT55          */
#define _MODEM_ANARAMP9_ANARAMPLUT55_MASK                    0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT55             */
#define _MODEM_ANARAMP9_ANARAMPLUT55_DEFAULT                 0x0000000DUL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT55_DEFAULT                  (_MODEM_ANARAMP9_ANARAMPLUT55_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT56_SHIFT                   10                                           /**< Shift value for MODEM_ANARAMPLUT56          */
#define _MODEM_ANARAMP9_ANARAMPLUT56_MASK                    0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT56             */
#define _MODEM_ANARAMP9_ANARAMPLUT56_DEFAULT                 0x0000000EUL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT56_DEFAULT                  (_MODEM_ANARAMP9_ANARAMPLUT56_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT57_SHIFT                   15                                           /**< Shift value for MODEM_ANARAMPLUT57          */
#define _MODEM_ANARAMP9_ANARAMPLUT57_MASK                    0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT57             */
#define _MODEM_ANARAMP9_ANARAMPLUT57_DEFAULT                 0x0000000FUL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT57_DEFAULT                  (_MODEM_ANARAMP9_ANARAMPLUT57_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT58_SHIFT                   20                                           /**< Shift value for MODEM_ANARAMPLUT58          */
#define _MODEM_ANARAMP9_ANARAMPLUT58_MASK                    0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT58             */
#define _MODEM_ANARAMP9_ANARAMPLUT58_DEFAULT                 0x00000010UL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT58_DEFAULT                  (_MODEM_ANARAMP9_ANARAMPLUT58_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT59_SHIFT                   25                                           /**< Shift value for MODEM_ANARAMPLUT59          */
#define _MODEM_ANARAMP9_ANARAMPLUT59_MASK                    0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT59             */
#define _MODEM_ANARAMP9_ANARAMPLUT59_DEFAULT                 0x00000011UL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT59_DEFAULT                  (_MODEM_ANARAMP9_ANARAMPLUT59_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */

/* Bit fields for MODEM ANARAMP10 */
#define _MODEM_ANARAMP10_RESETVALUE                          0x000FF2F3UL                                  /**< Default value for MODEM_ANARAMP10           */
#define _MODEM_ANARAMP10_MASK                                0x000FFFFFUL                                  /**< Mask for MODEM_ANARAMP10                    */
#define _MODEM_ANARAMP10_ANARAMPLUT60_SHIFT                  0                                             /**< Shift value for MODEM_ANARAMPLUT60          */
#define _MODEM_ANARAMP10_ANARAMPLUT60_MASK                   0x1FUL                                        /**< Bit mask for MODEM_ANARAMPLUT60             */
#define _MODEM_ANARAMP10_ANARAMPLUT60_DEFAULT                0x00000013UL                                  /**< Mode DEFAULT for MODEM_ANARAMP10            */
#define MODEM_ANARAMP10_ANARAMPLUT60_DEFAULT                 (_MODEM_ANARAMP10_ANARAMPLUT60_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP10    */
#define _MODEM_ANARAMP10_ANARAMPLUT61_SHIFT                  5                                             /**< Shift value for MODEM_ANARAMPLUT61          */
#define _MODEM_ANARAMP10_ANARAMPLUT61_MASK                   0x3E0UL                                       /**< Bit mask for MODEM_ANARAMPLUT61             */
#define _MODEM_ANARAMP10_ANARAMPLUT61_DEFAULT                0x00000017UL                                  /**< Mode DEFAULT for MODEM_ANARAMP10            */
#define MODEM_ANARAMP10_ANARAMPLUT61_DEFAULT                 (_MODEM_ANARAMP10_ANARAMPLUT61_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP10    */
#define _MODEM_ANARAMP10_ANARAMPLUT62_SHIFT                  10                                            /**< Shift value for MODEM_ANARAMPLUT62          */
#define _MODEM_ANARAMP10_ANARAMPLUT62_MASK                   0x7C00UL                                      /**< Bit mask for MODEM_ANARAMPLUT62             */
#define _MODEM_ANARAMP10_ANARAMPLUT62_DEFAULT                0x0000001CUL                                  /**< Mode DEFAULT for MODEM_ANARAMP10            */
#define MODEM_ANARAMP10_ANARAMPLUT62_DEFAULT                 (_MODEM_ANARAMP10_ANARAMPLUT62_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP10    */
#define _MODEM_ANARAMP10_ANARAMPLUT63_SHIFT                  15                                            /**< Shift value for MODEM_ANARAMPLUT63          */
#define _MODEM_ANARAMP10_ANARAMPLUT63_MASK                   0xF8000UL                                     /**< Bit mask for MODEM_ANARAMPLUT63             */
#define _MODEM_ANARAMP10_ANARAMPLUT63_DEFAULT                0x0000001FUL                                  /**< Mode DEFAULT for MODEM_ANARAMP10            */
#define MODEM_ANARAMP10_ANARAMPLUT63_DEFAULT                 (_MODEM_ANARAMP10_ANARAMPLUT63_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP10    */

/* Bit fields for MODEM INTAFC */
#define _MODEM_INTAFC_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_INTAFC              */
#define _MODEM_INTAFC_MASK                                   0x00FFFFFFUL                             /**< Mask for MODEM_INTAFC                       */
#define _MODEM_INTAFC_FOEPREAVG0_SHIFT                       0                                        /**< Shift value for MODEM_FOEPREAVG0            */
#define _MODEM_INTAFC_FOEPREAVG0_MASK                        0x7UL                                    /**< Bit mask for MODEM_FOEPREAVG0               */
#define _MODEM_INTAFC_FOEPREAVG0_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_INTAFC               */
#define MODEM_INTAFC_FOEPREAVG0_DEFAULT                      (_MODEM_INTAFC_FOEPREAVG0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_INTAFC       */
#define _MODEM_INTAFC_FOEPREAVG1_SHIFT                       3                                        /**< Shift value for MODEM_FOEPREAVG1            */
#define _MODEM_INTAFC_FOEPREAVG1_MASK                        0x38UL                                   /**< Bit mask for MODEM_FOEPREAVG1               */
#define _MODEM_INTAFC_FOEPREAVG1_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_INTAFC               */
#define MODEM_INTAFC_FOEPREAVG1_DEFAULT                      (_MODEM_INTAFC_FOEPREAVG1_DEFAULT << 3)  /**< Shifted mode DEFAULT for MODEM_INTAFC       */
#define _MODEM_INTAFC_FOEPREAVG2_SHIFT                       6                                        /**< Shift value for MODEM_FOEPREAVG2            */
#define _MODEM_INTAFC_FOEPREAVG2_MASK                        0x1C0UL                                  /**< Bit mask for MODEM_FOEPREAVG2               */
#define _MODEM_INTAFC_FOEPREAVG2_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_INTAFC               */
#define MODEM_INTAFC_FOEPREAVG2_DEFAULT                      (_MODEM_INTAFC_FOEPREAVG2_DEFAULT << 6)  /**< Shifted mode DEFAULT for MODEM_INTAFC       */
#define _MODEM_INTAFC_FOEPREAVG3_SHIFT                       9                                        /**< Shift value for MODEM_FOEPREAVG3            */
#define _MODEM_INTAFC_FOEPREAVG3_MASK                        0xE00UL                                  /**< Bit mask for MODEM_FOEPREAVG3               */
#define _MODEM_INTAFC_FOEPREAVG3_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_INTAFC               */
#define MODEM_INTAFC_FOEPREAVG3_DEFAULT                      (_MODEM_INTAFC_FOEPREAVG3_DEFAULT << 9)  /**< Shifted mode DEFAULT for MODEM_INTAFC       */
#define _MODEM_INTAFC_FOEPREAVG4_SHIFT                       12                                       /**< Shift value for MODEM_FOEPREAVG4            */
#define _MODEM_INTAFC_FOEPREAVG4_MASK                        0x7000UL                                 /**< Bit mask for MODEM_FOEPREAVG4               */
#define _MODEM_INTAFC_FOEPREAVG4_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_INTAFC               */
#define MODEM_INTAFC_FOEPREAVG4_DEFAULT                      (_MODEM_INTAFC_FOEPREAVG4_DEFAULT << 12) /**< Shifted mode DEFAULT for MODEM_INTAFC       */
#define _MODEM_INTAFC_FOEPREAVG5_SHIFT                       15                                       /**< Shift value for MODEM_FOEPREAVG5            */
#define _MODEM_INTAFC_FOEPREAVG5_MASK                        0x38000UL                                /**< Bit mask for MODEM_FOEPREAVG5               */
#define _MODEM_INTAFC_FOEPREAVG5_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_INTAFC               */
#define MODEM_INTAFC_FOEPREAVG5_DEFAULT                      (_MODEM_INTAFC_FOEPREAVG5_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_INTAFC       */
#define _MODEM_INTAFC_FOEPREAVG6_SHIFT                       18                                       /**< Shift value for MODEM_FOEPREAVG6            */
#define _MODEM_INTAFC_FOEPREAVG6_MASK                        0x1C0000UL                               /**< Bit mask for MODEM_FOEPREAVG6               */
#define _MODEM_INTAFC_FOEPREAVG6_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_INTAFC               */
#define MODEM_INTAFC_FOEPREAVG6_DEFAULT                      (_MODEM_INTAFC_FOEPREAVG6_DEFAULT << 18) /**< Shifted mode DEFAULT for MODEM_INTAFC       */
#define _MODEM_INTAFC_FOEPREAVG7_SHIFT                       21                                       /**< Shift value for MODEM_FOEPREAVG7            */
#define _MODEM_INTAFC_FOEPREAVG7_MASK                        0xE00000UL                               /**< Bit mask for MODEM_FOEPREAVG7               */
#define _MODEM_INTAFC_FOEPREAVG7_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_INTAFC               */
#define MODEM_INTAFC_FOEPREAVG7_DEFAULT                      (_MODEM_INTAFC_FOEPREAVG7_DEFAULT << 21) /**< Shifted mode DEFAULT for MODEM_INTAFC       */

/* Bit fields for MODEM DSATHD0 */
#define _MODEM_DSATHD0_RESETVALUE                            0x07830464UL                              /**< Default value for MODEM_DSATHD0             */
#define _MODEM_DSATHD0_MASK                                  0xFFFFFFFFUL                              /**< Mask for MODEM_DSATHD0                      */
#define _MODEM_DSATHD0_SPIKETHD_SHIFT                        0                                         /**< Shift value for MODEM_SPIKETHD              */
#define _MODEM_DSATHD0_SPIKETHD_MASK                         0xFFUL                                    /**< Bit mask for MODEM_SPIKETHD                 */
#define _MODEM_DSATHD0_SPIKETHD_DEFAULT                      0x00000064UL                              /**< Mode DEFAULT for MODEM_DSATHD0              */
#define MODEM_DSATHD0_SPIKETHD_DEFAULT                       (_MODEM_DSATHD0_SPIKETHD_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_DSATHD0      */
#define _MODEM_DSATHD0_UNMODTHD_SHIFT                        8                                         /**< Shift value for MODEM_UNMODTHD              */
#define _MODEM_DSATHD0_UNMODTHD_MASK                         0x3F00UL                                  /**< Bit mask for MODEM_UNMODTHD                 */
#define _MODEM_DSATHD0_UNMODTHD_DEFAULT                      0x00000004UL                              /**< Mode DEFAULT for MODEM_DSATHD0              */
#define MODEM_DSATHD0_UNMODTHD_DEFAULT                       (_MODEM_DSATHD0_UNMODTHD_DEFAULT << 8)    /**< Shifted mode DEFAULT for MODEM_DSATHD0      */
#define _MODEM_DSATHD0_FDEVMINTHD_SHIFT                      14                                        /**< Shift value for MODEM_FDEVMINTHD            */
#define _MODEM_DSATHD0_FDEVMINTHD_MASK                       0xFC000UL                                 /**< Bit mask for MODEM_FDEVMINTHD               */
#define _MODEM_DSATHD0_FDEVMINTHD_DEFAULT                    0x0000000CUL                              /**< Mode DEFAULT for MODEM_DSATHD0              */
#define MODEM_DSATHD0_FDEVMINTHD_DEFAULT                     (_MODEM_DSATHD0_FDEVMINTHD_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_DSATHD0      */
#define _MODEM_DSATHD0_FDEVMAXTHD_SHIFT                      20                                        /**< Shift value for MODEM_FDEVMAXTHD            */
#define _MODEM_DSATHD0_FDEVMAXTHD_MASK                       0xFFF00000UL                              /**< Bit mask for MODEM_FDEVMAXTHD               */
#define _MODEM_DSATHD0_FDEVMAXTHD_DEFAULT                    0x00000078UL                              /**< Mode DEFAULT for MODEM_DSATHD0              */
#define MODEM_DSATHD0_FDEVMAXTHD_DEFAULT                     (_MODEM_DSATHD0_FDEVMAXTHD_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_DSATHD0      */

/* Bit fields for MODEM DSATHD1 */
#define _MODEM_DSATHD1_RESETVALUE                            0x3AC81388UL                              /**< Default value for MODEM_DSATHD1             */
#define _MODEM_DSATHD1_MASK                                  0x7FFFFFFFUL                              /**< Mask for MODEM_DSATHD1                      */
#define _MODEM_DSATHD1_POWABSTHD_SHIFT                       0                                         /**< Shift value for MODEM_POWABSTHD             */
#define _MODEM_DSATHD1_POWABSTHD_MASK                        0xFFFFUL                                  /**< Bit mask for MODEM_POWABSTHD                */
#define _MODEM_DSATHD1_POWABSTHD_DEFAULT                     0x00001388UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define MODEM_DSATHD1_POWABSTHD_DEFAULT                      (_MODEM_DSATHD1_POWABSTHD_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_DSATHD1      */
#define _MODEM_DSATHD1_POWRELTHD_SHIFT                       16                                        /**< Shift value for MODEM_POWRELTHD             */
#define _MODEM_DSATHD1_POWRELTHD_MASK                        0x30000UL                                 /**< Bit mask for MODEM_POWRELTHD                */
#define _MODEM_DSATHD1_POWRELTHD_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define _MODEM_DSATHD1_POWRELTHD_DISABLED                    0x00000000UL                              /**< Mode DISABLED for MODEM_DSATHD1             */
#define _MODEM_DSATHD1_POWRELTHD_MODE1                       0x00000001UL                              /**< Mode MODE1 for MODEM_DSATHD1                */
#define _MODEM_DSATHD1_POWRELTHD_MODE2                       0x00000002UL                              /**< Mode MODE2 for MODEM_DSATHD1                */
#define _MODEM_DSATHD1_POWRELTHD_MODE3                       0x00000003UL                              /**< Mode MODE3 for MODEM_DSATHD1                */
#define MODEM_DSATHD1_POWRELTHD_DEFAULT                      (_MODEM_DSATHD1_POWRELTHD_DEFAULT << 16)  /**< Shifted mode DEFAULT for MODEM_DSATHD1      */
#define MODEM_DSATHD1_POWRELTHD_DISABLED                     (_MODEM_DSATHD1_POWRELTHD_DISABLED << 16) /**< Shifted mode DISABLED for MODEM_DSATHD1     */
#define MODEM_DSATHD1_POWRELTHD_MODE1                        (_MODEM_DSATHD1_POWRELTHD_MODE1 << 16)    /**< Shifted mode MODE1 for MODEM_DSATHD1        */
#define MODEM_DSATHD1_POWRELTHD_MODE2                        (_MODEM_DSATHD1_POWRELTHD_MODE2 << 16)    /**< Shifted mode MODE2 for MODEM_DSATHD1        */
#define MODEM_DSATHD1_POWRELTHD_MODE3                        (_MODEM_DSATHD1_POWRELTHD_MODE3 << 16)    /**< Shifted mode MODE3 for MODEM_DSATHD1        */
#define _MODEM_DSATHD1_DSARSTCNT_SHIFT                       18                                        /**< Shift value for MODEM_DSARSTCNT             */
#define _MODEM_DSATHD1_DSARSTCNT_MASK                        0x1C0000UL                                /**< Bit mask for MODEM_DSARSTCNT                */
#define _MODEM_DSATHD1_DSARSTCNT_DEFAULT                     0x00000002UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define MODEM_DSATHD1_DSARSTCNT_DEFAULT                      (_MODEM_DSATHD1_DSARSTCNT_DEFAULT << 18)  /**< Shifted mode DEFAULT for MODEM_DSATHD1      */
#define _MODEM_DSATHD1_RSSIJMPTHD_SHIFT                      21                                        /**< Shift value for MODEM_RSSIJMPTHD            */
#define _MODEM_DSATHD1_RSSIJMPTHD_MASK                       0x1E00000UL                               /**< Bit mask for MODEM_RSSIJMPTHD               */
#define _MODEM_DSATHD1_RSSIJMPTHD_DEFAULT                    0x00000006UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define MODEM_DSATHD1_RSSIJMPTHD_DEFAULT                     (_MODEM_DSATHD1_RSSIJMPTHD_DEFAULT << 21) /**< Shifted mode DEFAULT for MODEM_DSATHD1      */
#define _MODEM_DSATHD1_FREQLATDLY_SHIFT                      25                                        /**< Shift value for MODEM_FREQLATDLY            */
#define _MODEM_DSATHD1_FREQLATDLY_MASK                       0x6000000UL                               /**< Bit mask for MODEM_FREQLATDLY               */
#define _MODEM_DSATHD1_FREQLATDLY_DEFAULT                    0x00000001UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define MODEM_DSATHD1_FREQLATDLY_DEFAULT                     (_MODEM_DSATHD1_FREQLATDLY_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_DSATHD1      */
#define MODEM_DSATHD1_PWRFLTBYP                              (0x1UL << 27)                             /**< Power filter bypass                         */
#define _MODEM_DSATHD1_PWRFLTBYP_SHIFT                       27                                        /**< Shift value for MODEM_PWRFLTBYP             */
#define _MODEM_DSATHD1_PWRFLTBYP_MASK                        0x8000000UL                               /**< Bit mask for MODEM_PWRFLTBYP                */
#define _MODEM_DSATHD1_PWRFLTBYP_DEFAULT                     0x00000001UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define MODEM_DSATHD1_PWRFLTBYP_DEFAULT                      (_MODEM_DSATHD1_PWRFLTBYP_DEFAULT << 27)  /**< Shifted mode DEFAULT for MODEM_DSATHD1      */
#define MODEM_DSATHD1_AMPFLTBYP                              (0x1UL << 28)                             /**< Amplitude filter bypass                     */
#define _MODEM_DSATHD1_AMPFLTBYP_SHIFT                       28                                        /**< Shift value for MODEM_AMPFLTBYP             */
#define _MODEM_DSATHD1_AMPFLTBYP_MASK                        0x10000000UL                              /**< Bit mask for MODEM_AMPFLTBYP                */
#define _MODEM_DSATHD1_AMPFLTBYP_DEFAULT                     0x00000001UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define MODEM_DSATHD1_AMPFLTBYP_DEFAULT                      (_MODEM_DSATHD1_AMPFLTBYP_DEFAULT << 28)  /**< Shifted mode DEFAULT for MODEM_DSATHD1      */
#define MODEM_DSATHD1_PWRDETDIS                              (0x1UL << 29)                             /**< Power detection disabled                    */
#define _MODEM_DSATHD1_PWRDETDIS_SHIFT                       29                                        /**< Shift value for MODEM_PWRDETDIS             */
#define _MODEM_DSATHD1_PWRDETDIS_MASK                        0x20000000UL                              /**< Bit mask for MODEM_PWRDETDIS                */
#define _MODEM_DSATHD1_PWRDETDIS_DEFAULT                     0x00000001UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define MODEM_DSATHD1_PWRDETDIS_DEFAULT                      (_MODEM_DSATHD1_PWRDETDIS_DEFAULT << 29)  /**< Shifted mode DEFAULT for MODEM_DSATHD1      */
#define MODEM_DSATHD1_FREQSCALE                              (0x1UL << 30)                             /**< Frequency scale factor                      */
#define _MODEM_DSATHD1_FREQSCALE_SHIFT                       30                                        /**< Shift value for MODEM_FREQSCALE             */
#define _MODEM_DSATHD1_FREQSCALE_MASK                        0x40000000UL                              /**< Bit mask for MODEM_FREQSCALE                */
#define _MODEM_DSATHD1_FREQSCALE_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for MODEM_DSATHD1              */
#define MODEM_DSATHD1_FREQSCALE_DEFAULT                      (_MODEM_DSATHD1_FREQSCALE_DEFAULT << 30)  /**< Shifted mode DEFAULT for MODEM_DSATHD1      */

