SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM SYNCPROPERTIES */
#define _MODEM_SYNCPROPERTIES_RESETVALUE                     0x00000000UL                                            /**< Default value for MODEM_SYNCPROPERTIES      */
#define _MODEM_SYNCPROPERTIES_MASK                           0x0001FF00UL                                            /**< Mask for MODEM_SYNCPROPERTIES               */
#define MODEM_SYNCPROPERTIES_STATICSYNCTHRESHEN              (0x1UL << 8)                                            /**< Static Sync Threshold Enable                */
#define _MODEM_SYNCPROPERTIES_STATICSYNCTHRESHEN_SHIFT       8                                                       /**< Shift value for MODEM_STATICSYNCTHRESHEN    */
#define _MODEM_SYNCPROPERTIES_STATICSYNCTHRESHEN_MASK        0x100UL                                                 /**< Bit mask for MODEM_STATICSYNCTHRESHEN       */
#define _MODEM_SYNCPROPERTIES_STATICSYNCTHRESHEN_DEFAULT     0x00000000UL                                            /**< Mode DEFAULT for MODEM_SYNCPROPERTIES       */
#define MODEM_SYNCPROPERTIES_STATICSYNCTHRESHEN_DEFAULT      (_MODEM_SYNCPROPERTIES_STATICSYNCTHRESHEN_DEFAULT << 8) /**< Shifted mode DEFAULT for MODEM_SYNCPROPERTIES*/
#define _MODEM_SYNCPROPERTIES_STATICSYNCTHRESH_SHIFT         9                                                       /**< Shift value for MODEM_STATICSYNCTHRESH      */
#define _MODEM_SYNCPROPERTIES_STATICSYNCTHRESH_MASK          0x1FE00UL                                               /**< Bit mask for MODEM_STATICSYNCTHRESH         */
#define _MODEM_SYNCPROPERTIES_STATICSYNCTHRESH_DEFAULT       0x00000000UL                                            /**< Mode DEFAULT for MODEM_SYNCPROPERTIES       */
#define MODEM_SYNCPROPERTIES_STATICSYNCTHRESH_DEFAULT        (_MODEM_SYNCPROPERTIES_STATICSYNCTHRESH_DEFAULT << 9)   /**< Shifted mode DEFAULT for MODEM_SYNCPROPERTIES*/

/* Bit fields for MODEM PRSCTRL */
#define _MODEM_PRSCTRL_RESETVALUE                            0x00000000UL                                      /**< Default value for MODEM_PRSCTRL             */
#define _MODEM_PRSCTRL_MASK                                  0x000FFFFFUL                                      /**< Mask for MODEM_PRSCTRL                      */
#define _MODEM_PRSCTRL_POSTPONESEL_SHIFT                     0                                                 /**< Shift value for MODEM_POSTPONESEL           */
#define _MODEM_PRSCTRL_POSTPONESEL_MASK                      0x3UL                                             /**< Bit mask for MODEM_POSTPONESEL              */
#define _MODEM_PRSCTRL_POSTPONESEL_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_POSTPONESEL_POSTPONED                 0x00000000UL                                      /**< Mode POSTPONED for MODEM_PRSCTRL            */
#define _MODEM_PRSCTRL_POSTPONESEL_DSA_MUX                   0x00000001UL                                      /**< Mode DSA_MUX for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_POSTPONESEL_DSA_PHASE                 0x00000002UL                                      /**< Mode DSA_PHASE for MODEM_PRSCTRL            */
#define _MODEM_PRSCTRL_POSTPONESEL_UNUSED                    0x00000003UL                                      /**< Mode UNUSED for MODEM_PRSCTRL               */
#define MODEM_PRSCTRL_POSTPONESEL_DEFAULT                    (_MODEM_PRSCTRL_POSTPONESEL_DEFAULT << 0)         /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_POSTPONESEL_POSTPONED                  (_MODEM_PRSCTRL_POSTPONESEL_POSTPONED << 0)       /**< Shifted mode POSTPONED for MODEM_PRSCTRL    */
#define MODEM_PRSCTRL_POSTPONESEL_DSA_MUX                    (_MODEM_PRSCTRL_POSTPONESEL_DSA_MUX << 0)         /**< Shifted mode DSA_MUX for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_POSTPONESEL_DSA_PHASE                  (_MODEM_PRSCTRL_POSTPONESEL_DSA_PHASE << 0)       /**< Shifted mode DSA_PHASE for MODEM_PRSCTRL    */
#define MODEM_PRSCTRL_POSTPONESEL_UNUSED                     (_MODEM_PRSCTRL_POSTPONESEL_UNUSED << 0)          /**< Shifted mode UNUSED for MODEM_PRSCTRL       */
#define _MODEM_PRSCTRL_ADVANCESEL_SHIFT                      2                                                 /**< Shift value for MODEM_ADVANCESEL            */
#define _MODEM_PRSCTRL_ADVANCESEL_MASK                       0xCUL                                             /**< Bit mask for MODEM_ADVANCESEL               */
#define _MODEM_PRSCTRL_ADVANCESEL_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_ADVANCESEL_ADVANCED                   0x00000000UL                                      /**< Mode ADVANCED for MODEM_PRSCTRL             */
#define _MODEM_PRSCTRL_ADVANCESEL_LR_or_DSARST               0x00000001UL                                      /**< Mode LR_or_DSARST for MODEM_PRSCTRL         */
#define _MODEM_PRSCTRL_ADVANCESEL_UNUSED1                    0x00000002UL                                      /**< Mode UNUSED1 for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_ADVANCESEL_UNUSED2                    0x00000003UL                                      /**< Mode UNUSED2 for MODEM_PRSCTRL              */
#define MODEM_PRSCTRL_ADVANCESEL_DEFAULT                     (_MODEM_PRSCTRL_ADVANCESEL_DEFAULT << 2)          /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_ADVANCESEL_ADVANCED                    (_MODEM_PRSCTRL_ADVANCESEL_ADVANCED << 2)         /**< Shifted mode ADVANCED for MODEM_PRSCTRL     */
#define MODEM_PRSCTRL_ADVANCESEL_LR_or_DSARST                (_MODEM_PRSCTRL_ADVANCESEL_LR_or_DSARST << 2)     /**< Shifted mode LR_or_DSARST for MODEM_PRSCTRL */
#define MODEM_PRSCTRL_ADVANCESEL_UNUSED1                     (_MODEM_PRSCTRL_ADVANCESEL_UNUSED1 << 2)          /**< Shifted mode UNUSED1 for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_ADVANCESEL_UNUSED2                     (_MODEM_PRSCTRL_ADVANCESEL_UNUSED2 << 2)          /**< Shifted mode UNUSED2 for MODEM_PRSCTRL      */
#define _MODEM_PRSCTRL_NEWWNDSEL_SHIFT                       4                                                 /**< Shift value for MODEM_NEWWNDSEL             */
#define _MODEM_PRSCTRL_NEWWNDSEL_MASK                        0x30UL                                            /**< Bit mask for MODEM_NEWWNDSEL                */
#define _MODEM_PRSCTRL_NEWWNDSEL_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_NEWWNDSEL_NEWWIN                      0x00000000UL                                      /**< Mode NEWWIN for MODEM_PRSCTRL               */
#define _MODEM_PRSCTRL_NEWWNDSEL_LR_or_DSARST                0x00000001UL                                      /**< Mode LR_or_DSARST for MODEM_PRSCTRL         */
#define _MODEM_PRSCTRL_NEWWNDSEL_UNUSED1                     0x00000002UL                                      /**< Mode UNUSED1 for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_NEWWNDSEL_UNUSED2                     0x00000003UL                                      /**< Mode UNUSED2 for MODEM_PRSCTRL              */
#define MODEM_PRSCTRL_NEWWNDSEL_DEFAULT                      (_MODEM_PRSCTRL_NEWWNDSEL_DEFAULT << 4)           /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_NEWWNDSEL_NEWWIN                       (_MODEM_PRSCTRL_NEWWNDSEL_NEWWIN << 4)            /**< Shifted mode NEWWIN for MODEM_PRSCTRL       */
#define MODEM_PRSCTRL_NEWWNDSEL_LR_or_DSARST                 (_MODEM_PRSCTRL_NEWWNDSEL_LR_or_DSARST << 4)      /**< Shifted mode LR_or_DSARST for MODEM_PRSCTRL */
#define MODEM_PRSCTRL_NEWWNDSEL_UNUSED1                      (_MODEM_PRSCTRL_NEWWNDSEL_UNUSED1 << 4)           /**< Shifted mode UNUSED1 for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_NEWWNDSEL_UNUSED2                      (_MODEM_PRSCTRL_NEWWNDSEL_UNUSED2 << 4)           /**< Shifted mode UNUSED2 for MODEM_PRSCTRL      */
#define _MODEM_PRSCTRL_WEAKSEL_SHIFT                         6                                                 /**< Shift value for MODEM_WEAKSEL               */
#define _MODEM_PRSCTRL_WEAKSEL_MASK                          0xC0UL                                            /**< Bit mask for MODEM_WEAKSEL                  */
#define _MODEM_PRSCTRL_WEAKSEL_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_WEAKSEL_SQILOW                        0x00000000UL                                      /**< Mode SQILOW for MODEM_PRSCTRL               */
#define _MODEM_PRSCTRL_WEAKSEL_LR_or_DSA_EYE                 0x00000001UL                                      /**< Mode LR_or_DSA_EYE for MODEM_PRSCTRL        */
#define _MODEM_PRSCTRL_WEAKSEL_UNUSED1                       0x00000002UL                                      /**< Mode UNUSED1 for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_WEAKSEL_UNUSED2                       0x00000003UL                                      /**< Mode UNUSED2 for MODEM_PRSCTRL              */
#define MODEM_PRSCTRL_WEAKSEL_DEFAULT                        (_MODEM_PRSCTRL_WEAKSEL_DEFAULT << 6)             /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_WEAKSEL_SQILOW                         (_MODEM_PRSCTRL_WEAKSEL_SQILOW << 6)              /**< Shifted mode SQILOW for MODEM_PRSCTRL       */
#define MODEM_PRSCTRL_WEAKSEL_LR_or_DSA_EYE                  (_MODEM_PRSCTRL_WEAKSEL_LR_or_DSA_EYE << 6)       /**< Shifted mode LR_or_DSA_EYE for MODEM_PRSCTRL*/
#define MODEM_PRSCTRL_WEAKSEL_UNUSED1                        (_MODEM_PRSCTRL_WEAKSEL_UNUSED1 << 6)             /**< Shifted mode UNUSED1 for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_WEAKSEL_UNUSED2                        (_MODEM_PRSCTRL_WEAKSEL_UNUSED2 << 6)             /**< Shifted mode UNUSED2 for MODEM_PRSCTRL      */
#define _MODEM_PRSCTRL_SYNCSENTSEL_SHIFT                     8                                                 /**< Shift value for MODEM_SYNCSENTSEL           */
#define _MODEM_PRSCTRL_SYNCSENTSEL_MASK                      0x300UL                                           /**< Bit mask for MODEM_SYNCSENTSEL              */
#define _MODEM_PRSCTRL_SYNCSENTSEL_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_SYNCSENTSEL_SYNCSENT                  0x00000000UL                                      /**< Mode SYNCSENT for MODEM_PRSCTRL             */
#define _MODEM_PRSCTRL_SYNCSENTSEL_LR_or_RXD_VALID           0x00000001UL                                      /**< Mode LR_or_RXD_VALID for MODEM_PRSCTRL      */
#define _MODEM_PRSCTRL_SYNCSENTSEL_EARLY_TIMING              0x00000002UL                                      /**< Mode EARLY_TIMING for MODEM_PRSCTRL         */
#define _MODEM_PRSCTRL_SYNCSENTSEL_UNUSED                    0x00000003UL                                      /**< Mode UNUSED for MODEM_PRSCTRL               */
#define MODEM_PRSCTRL_SYNCSENTSEL_DEFAULT                    (_MODEM_PRSCTRL_SYNCSENTSEL_DEFAULT << 8)         /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_SYNCSENTSEL_SYNCSENT                   (_MODEM_PRSCTRL_SYNCSENTSEL_SYNCSENT << 8)        /**< Shifted mode SYNCSENT for MODEM_PRSCTRL     */
#define MODEM_PRSCTRL_SYNCSENTSEL_LR_or_RXD_VALID            (_MODEM_PRSCTRL_SYNCSENTSEL_LR_or_RXD_VALID << 8) /**< Shifted mode LR_or_RXD_VALID for MODEM_PRSCTRL*/
#define MODEM_PRSCTRL_SYNCSENTSEL_EARLY_TIMING               (_MODEM_PRSCTRL_SYNCSENTSEL_EARLY_TIMING << 8)    /**< Shifted mode EARLY_TIMING for MODEM_PRSCTRL */
#define MODEM_PRSCTRL_SYNCSENTSEL_UNUSED                     (_MODEM_PRSCTRL_SYNCSENTSEL_UNUSED << 8)          /**< Shifted mode UNUSED for MODEM_PRSCTRL       */
#define _MODEM_PRSCTRL_PRESENTSEL_SHIFT                      10                                                /**< Shift value for MODEM_PRESENTSEL            */
#define _MODEM_PRSCTRL_PRESENTSEL_MASK                       0xC00UL                                           /**< Bit mask for MODEM_PRESENTSEL               */
#define _MODEM_PRSCTRL_PRESENTSEL_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_PRESENTSEL_PMSENT                     0x00000000UL                                      /**< Mode PMSENT for MODEM_PRSCTRL               */
#define _MODEM_PRSCTRL_PRESENTSEL_LR_or_RXD                  0x00000001UL                                      /**< Mode LR_or_RXD for MODEM_PRSCTRL            */
#define _MODEM_PRSCTRL_PRESENTSEL_Late_timing                0x00000002UL                                      /**< Mode Late_timing for MODEM_PRSCTRL          */
#define _MODEM_PRSCTRL_PRESENTSEL_UNUSED                     0x00000003UL                                      /**< Mode UNUSED for MODEM_PRSCTRL               */
#define MODEM_PRSCTRL_PRESENTSEL_DEFAULT                     (_MODEM_PRSCTRL_PRESENTSEL_DEFAULT << 10)         /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_PRESENTSEL_PMSENT                      (_MODEM_PRSCTRL_PRESENTSEL_PMSENT << 10)          /**< Shifted mode PMSENT for MODEM_PRSCTRL       */
#define MODEM_PRSCTRL_PRESENTSEL_LR_or_RXD                   (_MODEM_PRSCTRL_PRESENTSEL_LR_or_RXD << 10)       /**< Shifted mode LR_or_RXD for MODEM_PRSCTRL    */
#define MODEM_PRSCTRL_PRESENTSEL_Late_timing                 (_MODEM_PRSCTRL_PRESENTSEL_Late_timing << 10)     /**< Shifted mode Late_timing for MODEM_PRSCTRL  */
#define MODEM_PRSCTRL_PRESENTSEL_UNUSED                      (_MODEM_PRSCTRL_PRESENTSEL_UNUSED << 10)          /**< Shifted mode UNUSED for MODEM_PRSCTRL       */
#define _MODEM_PRSCTRL_LOWCORRSEL_SHIFT                      12                                                /**< Shift value for MODEM_LOWCORRSEL            */
#define _MODEM_PRSCTRL_LOWCORRSEL_MASK                       0x3000UL                                          /**< Bit mask for MODEM_LOWCORRSEL               */
#define _MODEM_PRSCTRL_LOWCORRSEL_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_LOWCORRSEL_TIMSHLOW                   0x00000000UL                                      /**< Mode TIMSHLOW for MODEM_PRSCTRL             */
#define _MODEM_PRSCTRL_LOWCORRSEL_OUTBAND                    0x00000001UL                                      /**< Mode OUTBAND for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_LOWCORRSEL_UNUSED1                    0x00000002UL                                      /**< Mode UNUSED1 for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_LOWCORRSEL_UNUSED2                    0x00000003UL                                      /**< Mode UNUSED2 for MODEM_PRSCTRL              */
#define MODEM_PRSCTRL_LOWCORRSEL_DEFAULT                     (_MODEM_PRSCTRL_LOWCORRSEL_DEFAULT << 12)         /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_LOWCORRSEL_TIMSHLOW                    (_MODEM_PRSCTRL_LOWCORRSEL_TIMSHLOW << 12)        /**< Shifted mode TIMSHLOW for MODEM_PRSCTRL     */
#define MODEM_PRSCTRL_LOWCORRSEL_OUTBAND                     (_MODEM_PRSCTRL_LOWCORRSEL_OUTBAND << 12)         /**< Shifted mode OUTBAND for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_LOWCORRSEL_UNUSED1                     (_MODEM_PRSCTRL_LOWCORRSEL_UNUSED1 << 12)         /**< Shifted mode UNUSED1 for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_LOWCORRSEL_UNUSED2                     (_MODEM_PRSCTRL_LOWCORRSEL_UNUSED2 << 12)         /**< Shifted mode UNUSED2 for MODEM_PRSCTRL      */
#define _MODEM_PRSCTRL_ANT0SEL_SHIFT                         14                                                /**< Shift value for MODEM_ANT0SEL               */
#define _MODEM_PRSCTRL_ANT0SEL_MASK                          0xC000UL                                          /**< Bit mask for MODEM_ANT0SEL                  */
#define _MODEM_PRSCTRL_ANT0SEL_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_ANT0SEL_ANT0SEL                       0x00000000UL                                      /**< Mode ANT0SEL for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_ANT0SEL_SYNC_WORD_TIMEOUT             0x00000001UL                                      /**< Mode SYNC_WORD_TIMEOUT for MODEM_PRSCTRL    */
#define _MODEM_PRSCTRL_ANT0SEL_MOD_RAMPUP                    0x00000002UL                                      /**< Mode MOD_RAMPUP for MODEM_PRSCTRL           */
#define _MODEM_PRSCTRL_ANT0SEL_EMPTY                         0x00000003UL                                      /**< Mode EMPTY for MODEM_PRSCTRL                */
#define MODEM_PRSCTRL_ANT0SEL_DEFAULT                        (_MODEM_PRSCTRL_ANT0SEL_DEFAULT << 14)            /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_ANT0SEL_ANT0SEL                        (_MODEM_PRSCTRL_ANT0SEL_ANT0SEL << 14)            /**< Shifted mode ANT0SEL for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_ANT0SEL_SYNC_WORD_TIMEOUT              (_MODEM_PRSCTRL_ANT0SEL_SYNC_WORD_TIMEOUT << 14)  /**< Shifted mode SYNC_WORD_TIMEOUT for MODEM_PRSCTRL*/
#define MODEM_PRSCTRL_ANT0SEL_MOD_RAMPUP                     (_MODEM_PRSCTRL_ANT0SEL_MOD_RAMPUP << 14)         /**< Shifted mode MOD_RAMPUP for MODEM_PRSCTRL   */
#define MODEM_PRSCTRL_ANT0SEL_EMPTY                          (_MODEM_PRSCTRL_ANT0SEL_EMPTY << 14)              /**< Shifted mode EMPTY for MODEM_PRSCTRL        */
#define _MODEM_PRSCTRL_ANT1SEL_SHIFT                         16                                                /**< Shift value for MODEM_ANT1SEL               */
#define _MODEM_PRSCTRL_ANT1SEL_MASK                          0x30000UL                                         /**< Bit mask for MODEM_ANT1SEL                  */
#define _MODEM_PRSCTRL_ANT1SEL_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_ANT1SEL_ANT1SEL                       0x00000000UL                                      /**< Mode ANT1SEL for MODEM_PRSCTRL              */
#define _MODEM_PRSCTRL_ANT1SEL_FRC_TIMEOUT                   0x00000001UL                                      /**< Mode FRC_TIMEOUT for MODEM_PRSCTRL          */
#define _MODEM_PRSCTRL_ANT1SEL_MOD_RAMPDONE                  0x00000002UL                                      /**< Mode MOD_RAMPDONE for MODEM_PRSCTRL         */
#define _MODEM_PRSCTRL_ANT1SEL_FULL                          0x00000003UL                                      /**< Mode FULL for MODEM_PRSCTRL                 */
#define MODEM_PRSCTRL_ANT1SEL_DEFAULT                        (_MODEM_PRSCTRL_ANT1SEL_DEFAULT << 16)            /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_ANT1SEL_ANT1SEL                        (_MODEM_PRSCTRL_ANT1SEL_ANT1SEL << 16)            /**< Shifted mode ANT1SEL for MODEM_PRSCTRL      */
#define MODEM_PRSCTRL_ANT1SEL_FRC_TIMEOUT                    (_MODEM_PRSCTRL_ANT1SEL_FRC_TIMEOUT << 16)        /**< Shifted mode FRC_TIMEOUT for MODEM_PRSCTRL  */
#define MODEM_PRSCTRL_ANT1SEL_MOD_RAMPDONE                   (_MODEM_PRSCTRL_ANT1SEL_MOD_RAMPDONE << 16)       /**< Shifted mode MOD_RAMPDONE for MODEM_PRSCTRL */
#define MODEM_PRSCTRL_ANT1SEL_FULL                           (_MODEM_PRSCTRL_ANT1SEL_FULL << 16)               /**< Shifted mode FULL for MODEM_PRSCTRL         */
#define _MODEM_PRSCTRL_IFADCCLKSEL_SHIFT                     18                                                /**< Shift value for MODEM_IFADCCLKSEL           */
#define _MODEM_PRSCTRL_IFADCCLKSEL_MASK                      0xC0000UL                                         /**< Bit mask for MODEM_IFADCCLKSEL              */
#define _MODEM_PRSCTRL_IFADCCLKSEL_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_PRSCTRL              */
#define MODEM_PRSCTRL_IFADCCLKSEL_DEFAULT                    (_MODEM_PRSCTRL_IFADCCLKSEL_DEFAULT << 18)        /**< Shifted mode DEFAULT for MODEM_PRSCTRL      */

