SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM TRECSCFG */
#define _MODEM_TRECSCFG_RESETVALUE                           0x00020004UL                               /**< Default value for MODEM_TRECSCFG            */
#define _MODEM_TRECSCFG_MASK                                 0x01FF5FFFUL                               /**< Mask for MODEM_TRECSCFG                     */
#define _MODEM_TRECSCFG_TRECSOSR_SHIFT                       0                                          /**< Shift value for MODEM_TRECSOSR              */
#define _MODEM_TRECSCFG_TRECSOSR_MASK                        0x7UL                                      /**< Bit mask for MODEM_TRECSOSR                 */
#define _MODEM_TRECSCFG_TRECSOSR_DEFAULT                     0x00000004UL                               /**< Mode DEFAULT for MODEM_TRECSCFG             */
#define MODEM_TRECSCFG_TRECSOSR_DEFAULT                      (_MODEM_TRECSCFG_TRECSOSR_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_TRECSCFG     */
#define _MODEM_TRECSCFG_DTIMLOSSTHD_SHIFT                    3                                          /**< Shift value for MODEM_DTIMLOSSTHD           */
#define _MODEM_TRECSCFG_DTIMLOSSTHD_MASK                     0x1FF8UL                                   /**< Bit mask for MODEM_DTIMLOSSTHD              */
#define _MODEM_TRECSCFG_DTIMLOSSTHD_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for MODEM_TRECSCFG             */
#define MODEM_TRECSCFG_DTIMLOSSTHD_DEFAULT                   (_MODEM_TRECSCFG_DTIMLOSSTHD_DEFAULT << 3) /**< Shifted mode DEFAULT for MODEM_TRECSCFG     */
#define MODEM_TRECSCFG_DTIMLOSSEN                            (0x1UL << 14)                              /**< ENABLE TIMING LOSS DETECTION                */
#define _MODEM_TRECSCFG_DTIMLOSSEN_SHIFT                     14                                         /**< Shift value for MODEM_DTIMLOSSEN            */
#define _MODEM_TRECSCFG_DTIMLOSSEN_MASK                      0x4000UL                                   /**< Bit mask for MODEM_DTIMLOSSEN               */
#define _MODEM_TRECSCFG_DTIMLOSSEN_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for MODEM_TRECSCFG             */
#define MODEM_TRECSCFG_DTIMLOSSEN_DEFAULT                    (_MODEM_TRECSCFG_DTIMLOSSEN_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_TRECSCFG     */
#define _MODEM_TRECSCFG_PMOFFSET_SHIFT                       16                                         /**< Shift value for MODEM_PMOFFSET              */
#define _MODEM_TRECSCFG_PMOFFSET_MASK                        0x1FF0000UL                                /**< Bit mask for MODEM_PMOFFSET                 */
#define _MODEM_TRECSCFG_PMOFFSET_DEFAULT                     0x00000002UL                               /**< Mode DEFAULT for MODEM_TRECSCFG             */
#define MODEM_TRECSCFG_PMOFFSET_DEFAULT                      (_MODEM_TRECSCFG_PMOFFSET_DEFAULT << 16)   /**< Shifted mode DEFAULT for MODEM_TRECSCFG     */

/* Bit fields for MODEM CFGANTPATT */
#define _MODEM_CFGANTPATT_RESETVALUE                         0x00000000UL                                   /**< Default value for MODEM_CFGANTPATT          */
#define _MODEM_CFGANTPATT_MASK                               0x3FFFFFFFUL                                   /**< Mask for MODEM_CFGANTPATT                   */
#define _MODEM_CFGANTPATT_CFGANTPATTVAL_SHIFT                0                                              /**< Shift value for MODEM_CFGANTPATTVAL         */
#define _MODEM_CFGANTPATT_CFGANTPATTVAL_MASK                 0x3FFFFFFFUL                                   /**< Bit mask for MODEM_CFGANTPATTVAL            */
#define _MODEM_CFGANTPATT_CFGANTPATTVAL_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for MODEM_CFGANTPATT           */
#define MODEM_CFGANTPATT_CFGANTPATTVAL_DEFAULT               (_MODEM_CFGANTPATT_CFGANTPATTVAL_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_CFGANTPATT   */

/* Bit fields for MODEM FRMSCHTIME */
#define _MODEM_FRMSCHTIME_RESETVALUE                         0x00000040UL                                   /**< Default value for MODEM_FRMSCHTIME          */
#define _MODEM_FRMSCHTIME_MASK                               0xE000FFFFUL                                   /**< Mask for MODEM_FRMSCHTIME                   */
#define _MODEM_FRMSCHTIME_FRMSCHTIME_SHIFT                   0                                              /**< Shift value for MODEM_FRMSCHTIME            */
#define _MODEM_FRMSCHTIME_FRMSCHTIME_MASK                    0xFFFFUL                                       /**< Bit mask for MODEM_FRMSCHTIME               */
#define _MODEM_FRMSCHTIME_FRMSCHTIME_DEFAULT                 0x00000040UL                                   /**< Mode DEFAULT for MODEM_FRMSCHTIME           */
#define MODEM_FRMSCHTIME_FRMSCHTIME_DEFAULT                  (_MODEM_FRMSCHTIME_FRMSCHTIME_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_FRMSCHTIME   */
#define MODEM_FRMSCHTIME_PMRSTSYCNEN                         (0x1UL << 29)                                  /**< ENABLE CLEAN SYNC                           */
#define _MODEM_FRMSCHTIME_PMRSTSYCNEN_SHIFT                  29                                             /**< Shift value for MODEM_PMRSTSYCNEN           */
#define _MODEM_FRMSCHTIME_PMRSTSYCNEN_MASK                   0x20000000UL                                   /**< Bit mask for MODEM_PMRSTSYCNEN              */
#define _MODEM_FRMSCHTIME_PMRSTSYCNEN_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for MODEM_FRMSCHTIME           */
#define MODEM_FRMSCHTIME_PMRSTSYCNEN_DEFAULT                 (_MODEM_FRMSCHTIME_PMRSTSYCNEN_DEFAULT << 29)  /**< Shifted mode DEFAULT for MODEM_FRMSCHTIME   */
#define MODEM_FRMSCHTIME_DSARSTSYCNEN                        (0x1UL << 30)                                  /**< ENABLE CLEAN SYNC                           */
#define _MODEM_FRMSCHTIME_DSARSTSYCNEN_SHIFT                 30                                             /**< Shift value for MODEM_DSARSTSYCNEN          */
#define _MODEM_FRMSCHTIME_DSARSTSYCNEN_MASK                  0x40000000UL                                   /**< Bit mask for MODEM_DSARSTSYCNEN             */
#define _MODEM_FRMSCHTIME_DSARSTSYCNEN_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for MODEM_FRMSCHTIME           */
#define MODEM_FRMSCHTIME_DSARSTSYCNEN_DEFAULT                (_MODEM_FRMSCHTIME_DSARSTSYCNEN_DEFAULT << 30) /**< Shifted mode DEFAULT for MODEM_FRMSCHTIME   */
#define MODEM_FRMSCHTIME_PMENDSCHEN                          (0x1UL << 31)                                  /**< EnABLE SCH PM END                           */
#define _MODEM_FRMSCHTIME_PMENDSCHEN_SHIFT                   31                                             /**< Shift value for MODEM_PMENDSCHEN            */
#define _MODEM_FRMSCHTIME_PMENDSCHEN_MASK                    0x80000000UL                                   /**< Bit mask for MODEM_PMENDSCHEN               */
#define _MODEM_FRMSCHTIME_PMENDSCHEN_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for MODEM_FRMSCHTIME           */
#define MODEM_FRMSCHTIME_PMENDSCHEN_DEFAULT                  (_MODEM_FRMSCHTIME_PMENDSCHEN_DEFAULT << 31)   /**< Shifted mode DEFAULT for MODEM_FRMSCHTIME   */

/* Bit fields for MODEM PREFILTCOEFF */
#define _MODEM_PREFILTCOEFF_RESETVALUE                       0x3B3B3B3BUL                                    /**< Default value for MODEM_PREFILTCOEFF        */
#define _MODEM_PREFILTCOEFF_MASK                             0xFFFFFFFFUL                                    /**< Mask for MODEM_PREFILTCOEFF                 */
#define _MODEM_PREFILTCOEFF_PREFILTCOEFF_SHIFT               0                                               /**< Shift value for MODEM_PREFILTCOEFF          */
#define _MODEM_PREFILTCOEFF_PREFILTCOEFF_MASK                0xFFFFFFFFUL                                    /**< Bit mask for MODEM_PREFILTCOEFF             */
#define _MODEM_PREFILTCOEFF_PREFILTCOEFF_DEFAULT             0x3B3B3B3BUL                                    /**< Mode DEFAULT for MODEM_PREFILTCOEFF         */
#define MODEM_PREFILTCOEFF_PREFILTCOEFF_DEFAULT              (_MODEM_PREFILTCOEFF_PREFILTCOEFF_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_PREFILTCOEFF */

/* Bit fields for MODEM RXRESTART */
#define _MODEM_RXRESTART_RESETVALUE                          0x00000000UL                                        /**< Default value for MODEM_RXRESTART           */
#define _MODEM_RXRESTART_MASK                                0xC0010001UL                                        /**< Mask for MODEM_RXRESTART                    */
#define MODEM_RXRESTART_RXRESTARTUPONMARSSI                  (0x1UL << 0)                                        /**< Restart RX upon RSSI MA above threshold     */
#define _MODEM_RXRESTART_RXRESTARTUPONMARSSI_SHIFT           0                                                   /**< Shift value for MODEM_RXRESTARTUPONMARSSI   */
#define _MODEM_RXRESTART_RXRESTARTUPONMARSSI_MASK            0x1UL                                               /**< Bit mask for MODEM_RXRESTARTUPONMARSSI      */
#define _MODEM_RXRESTART_RXRESTARTUPONMARSSI_DEFAULT         0x00000000UL                                        /**< Mode DEFAULT for MODEM_RXRESTART            */
#define MODEM_RXRESTART_RXRESTARTUPONMARSSI_DEFAULT          (_MODEM_RXRESTART_RXRESTARTUPONMARSSI_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_RXRESTARTB4PREDET                    (0x1UL << 16)                                       /**< whether to restart RX before pre det        */
#define _MODEM_RXRESTART_RXRESTARTB4PREDET_SHIFT             16                                                  /**< Shift value for MODEM_RXRESTARTB4PREDET     */
#define _MODEM_RXRESTART_RXRESTARTB4PREDET_MASK              0x10000UL                                           /**< Bit mask for MODEM_RXRESTARTB4PREDET        */
#define _MODEM_RXRESTART_RXRESTARTB4PREDET_DEFAULT           0x00000000UL                                        /**< Mode DEFAULT for MODEM_RXRESTART            */
#define MODEM_RXRESTART_RXRESTARTB4PREDET_DEFAULT            (_MODEM_RXRESTART_RXRESTARTB4PREDET_DEFAULT << 16)  /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_ANTSWRSTFLTTDIS                      (0x1UL << 30)                                       /**< ANT SW RESET Filter Disable                 */
#define _MODEM_RXRESTART_ANTSWRSTFLTTDIS_SHIFT               30                                                  /**< Shift value for MODEM_ANTSWRSTFLTTDIS       */
#define _MODEM_RXRESTART_ANTSWRSTFLTTDIS_MASK                0x40000000UL                                        /**< Bit mask for MODEM_ANTSWRSTFLTTDIS          */
#define _MODEM_RXRESTART_ANTSWRSTFLTTDIS_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for MODEM_RXRESTART            */
#define MODEM_RXRESTART_ANTSWRSTFLTTDIS_DEFAULT              (_MODEM_RXRESTART_ANTSWRSTFLTTDIS_DEFAULT << 30)    /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_FLTRSTEN                             (0x1UL << 31)                                       /**< RX Chain Filter reset enable                */
#define _MODEM_RXRESTART_FLTRSTEN_SHIFT                      31                                                  /**< Shift value for MODEM_FLTRSTEN              */
#define _MODEM_RXRESTART_FLTRSTEN_MASK                       0x80000000UL                                        /**< Bit mask for MODEM_FLTRSTEN                 */
#define _MODEM_RXRESTART_FLTRSTEN_DEFAULT                    0x00000000UL                                        /**< Mode DEFAULT for MODEM_RXRESTART            */
#define MODEM_RXRESTART_FLTRSTEN_DEFAULT                     (_MODEM_RXRESTART_FLTRSTEN_DEFAULT << 31)           /**< Shifted mode DEFAULT for MODEM_RXRESTART    */

/* Bit fields for MODEM SQ */
#define _MODEM_SQ_RESETVALUE                                 0x00000000UL                       /**< Default value for MODEM_SQ                  */
#define _MODEM_SQ_MASK                                       0xFFFF0003UL                       /**< Mask for MODEM_SQ                           */
#define MODEM_SQ_SQEN                                        (0x1UL << 0)                       /**< SQ enable                                   */
#define _MODEM_SQ_SQEN_SHIFT                                 0                                  /**< Shift value for MODEM_SQEN                  */
#define _MODEM_SQ_SQEN_MASK                                  0x1UL                              /**< Bit mask for MODEM_SQEN                     */
#define _MODEM_SQ_SQEN_DEFAULT                               0x00000000UL                       /**< Mode DEFAULT for MODEM_SQ                   */
#define MODEM_SQ_SQEN_DEFAULT                                (_MODEM_SQ_SQEN_DEFAULT << 0)      /**< Shifted mode DEFAULT for MODEM_SQ           */
#define MODEM_SQ_SQSWRST                                     (0x1UL << 1)                       /**< SQ hold demod                               */
#define _MODEM_SQ_SQSWRST_SHIFT                              1                                  /**< Shift value for MODEM_SQSWRST               */
#define _MODEM_SQ_SQSWRST_MASK                               0x2UL                              /**< Bit mask for MODEM_SQSWRST                  */
#define _MODEM_SQ_SQSWRST_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MODEM_SQ                   */
#define MODEM_SQ_SQSWRST_DEFAULT                             (_MODEM_SQ_SQSWRST_DEFAULT << 1)   /**< Shifted mode DEFAULT for MODEM_SQ           */
#define _MODEM_SQ_SQTIMOUT_SHIFT                             16                                 /**< Shift value for MODEM_SQTIMOUT              */
#define _MODEM_SQ_SQTIMOUT_MASK                              0xFFFF0000UL                       /**< Bit mask for MODEM_SQTIMOUT                 */
#define _MODEM_SQ_SQTIMOUT_DEFAULT                           0x00000000UL                       /**< Mode DEFAULT for MODEM_SQ                   */
#define MODEM_SQ_SQTIMOUT_DEFAULT                            (_MODEM_SQ_SQTIMOUT_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SQ           */

/* Bit fields for MODEM SQEXT */
#define _MODEM_SQEXT_RESETVALUE                              0x00000000UL                              /**< Default value for MODEM_SQEXT               */
#define _MODEM_SQEXT_MASK                                    0xFFFFFFFFUL                              /**< Mask for MODEM_SQEXT                        */
#define _MODEM_SQEXT_SQSTG2TIMOUT_SHIFT                      0                                         /**< Shift value for MODEM_SQSTG2TIMOUT          */
#define _MODEM_SQEXT_SQSTG2TIMOUT_MASK                       0xFFFFUL                                  /**< Bit mask for MODEM_SQSTG2TIMOUT             */
#define _MODEM_SQEXT_SQSTG2TIMOUT_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for MODEM_SQEXT                */
#define MODEM_SQEXT_SQSTG2TIMOUT_DEFAULT                     (_MODEM_SQEXT_SQSTG2TIMOUT_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SQEXT        */
#define _MODEM_SQEXT_SQSTG3TIMOUT_SHIFT                      16                                        /**< Shift value for MODEM_SQSTG3TIMOUT          */
#define _MODEM_SQEXT_SQSTG3TIMOUT_MASK                       0xFFFF0000UL                              /**< Bit mask for MODEM_SQSTG3TIMOUT             */
#define _MODEM_SQEXT_SQSTG3TIMOUT_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for MODEM_SQEXT                */
#define MODEM_SQEXT_SQSTG3TIMOUT_DEFAULT                     (_MODEM_SQEXT_SQSTG3TIMOUT_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SQEXT        */

/* Bit fields for MODEM SQI */
#define _MODEM_SQI_RESETVALUE                                0x00000000UL                         /**< Default value for MODEM_SQI                 */
#define _MODEM_SQI_MASK                                      0x00FF0001UL                         /**< Mask for MODEM_SQI                          */
#define MODEM_SQI_SQISELECT                                  (0x1UL << 0)                         /**< SQI selection bit                           */
#define _MODEM_SQI_SQISELECT_SHIFT                           0                                    /**< Shift value for MODEM_SQISELECT             */
#define _MODEM_SQI_SQISELECT_MASK                            0x1UL                                /**< Bit mask for MODEM_SQISELECT                */
#define _MODEM_SQI_SQISELECT_DEFAULT                         0x00000000UL                         /**< Mode DEFAULT for MODEM_SQI                  */
#define _MODEM_SQI_SQISELECT_CORR                            0x00000000UL                         /**< Mode CORR for MODEM_SQI                     */
#define _MODEM_SQI_SQISELECT_ERROR                           0x00000001UL                         /**< Mode ERROR for MODEM_SQI                    */
#define MODEM_SQI_SQISELECT_DEFAULT                          (_MODEM_SQI_SQISELECT_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SQI          */
#define MODEM_SQI_SQISELECT_CORR                             (_MODEM_SQI_SQISELECT_CORR << 0)     /**< Shifted mode CORR for MODEM_SQI             */
#define MODEM_SQI_SQISELECT_ERROR                            (_MODEM_SQI_SQISELECT_ERROR << 0)    /**< Shifted mode ERROR for MODEM_SQI            */
#define _MODEM_SQI_CHIPERROR_SHIFT                           16                                   /**< Shift value for MODEM_CHIPERROR             */
#define _MODEM_SQI_CHIPERROR_MASK                            0xFF0000UL                           /**< Bit mask for MODEM_CHIPERROR                */
#define _MODEM_SQI_CHIPERROR_DEFAULT                         0x00000000UL                         /**< Mode DEFAULT for MODEM_SQI                  */
#define MODEM_SQI_CHIPERROR_DEFAULT                          (_MODEM_SQI_CHIPERROR_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SQI          */

/* Bit fields for MODEM ANTDIVCTRL */
#define _MODEM_ANTDIVCTRL_RESETVALUE                         0x00000000UL                                   /**< Default value for MODEM_ANTDIVCTRL          */
#define _MODEM_ANTDIVCTRL_MASK                               0x000007FFUL                                   /**< Mask for MODEM_ANTDIVCTRL                   */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_SHIFT                  0                                              /**< Shift value for MODEM_ADPRETHRESH           */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_MASK                   0xFFUL                                         /**< Bit mask for MODEM_ADPRETHRESH              */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT                 (_MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH                       (0x1UL << 8)                                   /**< Enable Preamble threshold                   */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_SHIFT                8                                              /**< Shift value for MODEM_ENADPRETHRESH         */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_MASK                 0x100UL                                        /**< Bit mask for MODEM_ENADPRETHRESH            */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE              0x00000000UL                                   /**< Mode DISABLE for MODEM_ANTDIVCTRL           */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE               0x00000001UL                                   /**< Mode ENABLE for MODEM_ANTDIVCTRL            */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT               (_MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT << 8) /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE               (_MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE << 8) /**< Shifted mode DISABLE for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE                (_MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE << 8)  /**< Shifted mode ENABLE for MODEM_ANTDIVCTRL    */
#define MODEM_ANTDIVCTRL_ANTDIVDISCCA                        (0x1UL << 9)                                   /**< Antenna switch disable for CSMA             */
#define _MODEM_ANTDIVCTRL_ANTDIVDISCCA_SHIFT                 9                                              /**< Shift value for MODEM_ANTDIVDISCCA          */
#define _MODEM_ANTDIVCTRL_ANTDIVDISCCA_MASK                  0x200UL                                        /**< Bit mask for MODEM_ANTDIVDISCCA             */
#define _MODEM_ANTDIVCTRL_ANTDIVDISCCA_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define MODEM_ANTDIVCTRL_ANTDIVDISCCA_DEFAULT                (_MODEM_ANTDIVCTRL_ANTDIVDISCCA_DEFAULT << 9)  /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ANTDIVSELCCA                        (0x1UL << 10)                                  /**< Antenna switch selection for CSMA           */
#define _MODEM_ANTDIVCTRL_ANTDIVSELCCA_SHIFT                 10                                             /**< Shift value for MODEM_ANTDIVSELCCA          */
#define _MODEM_ANTDIVCTRL_ANTDIVSELCCA_MASK                  0x400UL                                        /**< Bit mask for MODEM_ANTDIVSELCCA             */
#define _MODEM_ANTDIVCTRL_ANTDIVSELCCA_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define MODEM_ANTDIVCTRL_ANTDIVSELCCA_DEFAULT                (_MODEM_ANTDIVCTRL_ANTDIVSELCCA_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */

