SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM ANTDIVFW */
#define _MODEM_ANTDIVFW_RESETVALUE                           0x00000000UL                               /**< Default value for MODEM_ANTDIVFW            */
#define _MODEM_ANTDIVFW_MASK                                 0x80000003UL                               /**< Mask for MODEM_ANTDIVFW                     */
#define MODEM_ANTDIVFW_FWSELANT                              (0x1UL << 0)                               /**< FW antenna selection                        */
#define _MODEM_ANTDIVFW_FWSELANT_SHIFT                       0                                          /**< Shift value for MODEM_FWSELANT              */
#define _MODEM_ANTDIVFW_FWSELANT_MASK                        0x1UL                                      /**< Bit mask for MODEM_FWSELANT                 */
#define _MODEM_ANTDIVFW_FWSELANT_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for MODEM_ANTDIVFW             */
#define MODEM_ANTDIVFW_FWSELANT_DEFAULT                      (_MODEM_ANTDIVFW_FWSELANT_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_ANTDIVFW     */
#define MODEM_ANTDIVFW_FWANTSWCMD                            (0x1UL << 1)                               /**< FW Antenna SW cmd                           */
#define _MODEM_ANTDIVFW_FWANTSWCMD_SHIFT                     1                                          /**< Shift value for MODEM_FWANTSWCMD            */
#define _MODEM_ANTDIVFW_FWANTSWCMD_MASK                      0x2UL                                      /**< Bit mask for MODEM_FWANTSWCMD               */
#define _MODEM_ANTDIVFW_FWANTSWCMD_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for MODEM_ANTDIVFW             */
#define MODEM_ANTDIVFW_FWANTSWCMD_DEFAULT                    (_MODEM_ANTDIVFW_FWANTSWCMD_DEFAULT << 1)  /**< Shifted mode DEFAULT for MODEM_ANTDIVFW     */
#define MODEM_ANTDIVFW_FWANTDIVEN                            (0x1UL << 31)                              /**< Enable FW ANT-DIV mode                      */
#define _MODEM_ANTDIVFW_FWANTDIVEN_SHIFT                     31                                         /**< Shift value for MODEM_FWANTDIVEN            */
#define _MODEM_ANTDIVFW_FWANTDIVEN_MASK                      0x80000000UL                               /**< Bit mask for MODEM_FWANTDIVEN               */
#define _MODEM_ANTDIVFW_FWANTDIVEN_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for MODEM_ANTDIVFW             */
#define MODEM_ANTDIVFW_FWANTDIVEN_DEFAULT                    (_MODEM_ANTDIVFW_FWANTDIVEN_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_ANTDIVFW     */

/* Bit fields for MODEM PHDMODANTDIV */
#define _MODEM_PHDMODANTDIV_RESETVALUE                       0x0000000FUL                                     /**< Default value for MODEM_PHDMODANTDIV        */
#define _MODEM_PHDMODANTDIV_MASK                             0xF3FF3FFFUL                                     /**< Mask for MODEM_PHDMODANTDIV                 */
#define _MODEM_PHDMODANTDIV_ANTWAIT_SHIFT                    0                                                /**< Shift value for MODEM_ANTWAIT               */
#define _MODEM_PHDMODANTDIV_ANTWAIT_MASK                     0x1FUL                                           /**< Bit mask for MODEM_ANTWAIT                  */
#define _MODEM_PHDMODANTDIV_ANTWAIT_DEFAULT                  0x0000000FUL                                     /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_ANTWAIT_DEFAULT                   (_MODEM_PHDMODANTDIV_ANTWAIT_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define _MODEM_PHDMODANTDIV_SKIPRSSITHD_SHIFT                5                                                /**< Shift value for MODEM_SKIPRSSITHD           */
#define _MODEM_PHDMODANTDIV_SKIPRSSITHD_MASK                 0x3FE0UL                                         /**< Bit mask for MODEM_SKIPRSSITHD              */
#define _MODEM_PHDMODANTDIV_SKIPRSSITHD_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_SKIPRSSITHD_DEFAULT               (_MODEM_PHDMODANTDIV_SKIPRSSITHD_DEFAULT << 5)   /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define _MODEM_PHDMODANTDIV_SKIPCORRTHD_SHIFT                16                                               /**< Shift value for MODEM_SKIPCORRTHD           */
#define _MODEM_PHDMODANTDIV_SKIPCORRTHD_MASK                 0x3FF0000UL                                      /**< Bit mask for MODEM_SKIPCORRTHD              */
#define _MODEM_PHDMODANTDIV_SKIPCORRTHD_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_SKIPCORRTHD_DEFAULT               (_MODEM_PHDMODANTDIV_SKIPCORRTHD_DEFAULT << 16)  /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define MODEM_PHDMODANTDIV_SKIPTHDSEL                        (0x1UL << 28)                                    /**< SKIP THD Setection                          */
#define _MODEM_PHDMODANTDIV_SKIPTHDSEL_SHIFT                 28                                               /**< Shift value for MODEM_SKIPTHDSEL            */
#define _MODEM_PHDMODANTDIV_SKIPTHDSEL_MASK                  0x10000000UL                                     /**< Bit mask for MODEM_SKIPTHDSEL               */
#define _MODEM_PHDMODANTDIV_SKIPTHDSEL_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_SKIPTHDSEL_DEFAULT                (_MODEM_PHDMODANTDIV_SKIPTHDSEL_DEFAULT << 28)   /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define MODEM_PHDMODANTDIV_RECHKCORREN                       (0x1UL << 29)                                    /**< Recheck Correlation                         */
#define _MODEM_PHDMODANTDIV_RECHKCORREN_SHIFT                29                                               /**< Shift value for MODEM_RECHKCORREN           */
#define _MODEM_PHDMODANTDIV_RECHKCORREN_MASK                 0x20000000UL                                     /**< Bit mask for MODEM_RECHKCORREN              */
#define _MODEM_PHDMODANTDIV_RECHKCORREN_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_RECHKCORREN_DEFAULT               (_MODEM_PHDMODANTDIV_RECHKCORREN_DEFAULT << 29)  /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define MODEM_PHDMODANTDIV_SKIP2ANT                          (0x1UL << 30)                                    /**< SKIP 2th  ANTENNA Evaluate                  */
#define _MODEM_PHDMODANTDIV_SKIP2ANT_SHIFT                   30                                               /**< Shift value for MODEM_SKIP2ANT              */
#define _MODEM_PHDMODANTDIV_SKIP2ANT_MASK                    0x40000000UL                                     /**< Bit mask for MODEM_SKIP2ANT                 */
#define _MODEM_PHDMODANTDIV_SKIP2ANT_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_SKIP2ANT_DEFAULT                  (_MODEM_PHDMODANTDIV_SKIP2ANT_DEFAULT << 30)     /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */
#define MODEM_PHDMODANTDIV_ANTDECRSTBYP                      (0x1UL << 31)                                    /**< Decision Pulse Reset                        */
#define _MODEM_PHDMODANTDIV_ANTDECRSTBYP_SHIFT               31                                               /**< Shift value for MODEM_ANTDECRSTBYP          */
#define _MODEM_PHDMODANTDIV_ANTDECRSTBYP_MASK                0x80000000UL                                     /**< Bit mask for MODEM_ANTDECRSTBYP             */
#define _MODEM_PHDMODANTDIV_ANTDECRSTBYP_DEFAULT             0x00000000UL                                     /**< Mode DEFAULT for MODEM_PHDMODANTDIV         */
#define MODEM_PHDMODANTDIV_ANTDECRSTBYP_DEFAULT              (_MODEM_PHDMODANTDIV_ANTDECRSTBYP_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_PHDMODANTDIV */

/* Bit fields for MODEM PHANTDECSION */
#define _MODEM_PHANTDECSION_RESETVALUE                       0x00000000UL                                      /**< Default value for MODEM_PHANTDECSION        */
#define _MODEM_PHANTDECSION_MASK                             0xF007FFFFUL                                      /**< Mask for MODEM_PHANTDECSION                 */
#define _MODEM_PHANTDECSION_CORRANDDIVTHD_SHIFT              0                                                 /**< Shift value for MODEM_CORRANDDIVTHD         */
#define _MODEM_PHANTDECSION_CORRANDDIVTHD_MASK               0x3FFUL                                           /**< Bit mask for MODEM_CORRANDDIVTHD            */
#define _MODEM_PHANTDECSION_CORRANDDIVTHD_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_CORRANDDIVTHD_DEFAULT             (_MODEM_PHANTDECSION_CORRANDDIVTHD_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define _MODEM_PHANTDECSION_RSSIANDDIVTHD_SHIFT              10                                                /**< Shift value for MODEM_RSSIANDDIVTHD         */
#define _MODEM_PHANTDECSION_RSSIANDDIVTHD_MASK               0x7FC00UL                                         /**< Bit mask for MODEM_RSSIANDDIVTHD            */
#define _MODEM_PHANTDECSION_RSSIANDDIVTHD_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSIANDDIVTHD_DEFAULT             (_MODEM_PHANTDECSION_RSSIANDDIVTHD_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define MODEM_PHANTDECSION_RSSICORR0                         (0x1UL << 28)                                     /**< RSSI-CORR  Selection in Region0             */
#define _MODEM_PHANTDECSION_RSSICORR0_SHIFT                  28                                                /**< Shift value for MODEM_RSSICORR0             */
#define _MODEM_PHANTDECSION_RSSICORR0_MASK                   0x10000000UL                                      /**< Bit mask for MODEM_RSSICORR0                */
#define _MODEM_PHANTDECSION_RSSICORR0_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSICORR0_DEFAULT                 (_MODEM_PHANTDECSION_RSSICORR0_DEFAULT << 28)     /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define MODEM_PHANTDECSION_RSSICORR1                         (0x1UL << 29)                                     /**< RSSI-CORR  Selection in Region1             */
#define _MODEM_PHANTDECSION_RSSICORR1_SHIFT                  29                                                /**< Shift value for MODEM_RSSICORR1             */
#define _MODEM_PHANTDECSION_RSSICORR1_MASK                   0x20000000UL                                      /**< Bit mask for MODEM_RSSICORR1                */
#define _MODEM_PHANTDECSION_RSSICORR1_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSICORR1_DEFAULT                 (_MODEM_PHANTDECSION_RSSICORR1_DEFAULT << 29)     /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define MODEM_PHANTDECSION_RSSICORR2                         (0x1UL << 30)                                     /**< RSSI-CORR  Selection in Region2             */
#define _MODEM_PHANTDECSION_RSSICORR2_SHIFT                  30                                                /**< Shift value for MODEM_RSSICORR2             */
#define _MODEM_PHANTDECSION_RSSICORR2_MASK                   0x40000000UL                                      /**< Bit mask for MODEM_RSSICORR2                */
#define _MODEM_PHANTDECSION_RSSICORR2_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSICORR2_DEFAULT                 (_MODEM_PHANTDECSION_RSSICORR2_DEFAULT << 30)     /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */
#define MODEM_PHANTDECSION_RSSICORR3                         (0x1UL << 31)                                     /**< RSSI-CORR  Selection in Region3             */
#define _MODEM_PHANTDECSION_RSSICORR3_SHIFT                  31                                                /**< Shift value for MODEM_RSSICORR3             */
#define _MODEM_PHANTDECSION_RSSICORR3_MASK                   0x80000000UL                                      /**< Bit mask for MODEM_RSSICORR3                */
#define _MODEM_PHANTDECSION_RSSICORR3_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_PHANTDECSION         */
#define MODEM_PHANTDECSION_RSSICORR3_DEFAULT                 (_MODEM_PHANTDECSION_RSSICORR3_DEFAULT << 31)     /**< Shifted mode DEFAULT for MODEM_PHANTDECSION */

/* Bit fields for MODEM PHDMODCTRL */
#define _MODEM_PHDMODCTRL_RESETVALUE                         0x01DF0004UL                                    /**< Default value for MODEM_PHDMODCTRL          */
#define _MODEM_PHDMODCTRL_MASK                               0xFFFFFFFFUL                                    /**< Mask for MODEM_PHDMODCTRL                   */
#define _MODEM_PHDMODCTRL_PMDETTHD_SHIFT                     0                                               /**< Shift value for MODEM_PMDETTHD              */
#define _MODEM_PHDMODCTRL_PMDETTHD_MASK                      0x1FUL                                          /**< Bit mask for MODEM_PMDETTHD                 */
#define _MODEM_PHDMODCTRL_PMDETTHD_DEFAULT                   0x00000004UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_PMDETTHD_DEFAULT                    (_MODEM_PHDMODCTRL_PMDETTHD_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define _MODEM_PHDMODCTRL_PMTIMLOSTHD_SHIFT                  5                                               /**< Shift value for MODEM_PMTIMLOSTHD           */
#define _MODEM_PHDMODCTRL_PMTIMLOSTHD_MASK                   0x1FE0UL                                        /**< Bit mask for MODEM_PMTIMLOSTHD              */
#define _MODEM_PHDMODCTRL_PMTIMLOSTHD_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_PMTIMLOSTHD_DEFAULT                 (_MODEM_PHDMODCTRL_PMTIMLOSTHD_DEFAULT << 5)    /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_PMTIMLOSEN                          (0x1UL << 13)                                   /**< Preamble timing loss detection              */
#define _MODEM_PHDMODCTRL_PMTIMLOSEN_SHIFT                   13                                              /**< Shift value for MODEM_PMTIMLOSEN            */
#define _MODEM_PHDMODCTRL_PMTIMLOSEN_MASK                    0x2000UL                                        /**< Bit mask for MODEM_PMTIMLOSEN               */
#define _MODEM_PHDMODCTRL_PMTIMLOSEN_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_PMTIMLOSEN_DEFAULT                  (_MODEM_PHDMODCTRL_PMTIMLOSEN_DEFAULT << 13)    /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_RSSIFLTBYP                          (0x1UL << 14)                                   /**< Bypass RSSI Filering                        */
#define _MODEM_PHDMODCTRL_RSSIFLTBYP_SHIFT                   14                                              /**< Shift value for MODEM_RSSIFLTBYP            */
#define _MODEM_PHDMODCTRL_RSSIFLTBYP_MASK                    0x4000UL                                        /**< Bit mask for MODEM_RSSIFLTBYP               */
#define _MODEM_PHDMODCTRL_RSSIFLTBYP_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_RSSIFLTBYP_DEFAULT                  (_MODEM_PHDMODCTRL_RSSIFLTBYP_DEFAULT << 14)    /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_PMDETEN                             (0x1UL << 15)                                   /**< PREAMBLE DET                                */
#define _MODEM_PHDMODCTRL_PMDETEN_SHIFT                      15                                              /**< Shift value for MODEM_PMDETEN               */
#define _MODEM_PHDMODCTRL_PMDETEN_MASK                       0x8000UL                                        /**< Bit mask for MODEM_PMDETEN                  */
#define _MODEM_PHDMODCTRL_PMDETEN_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_PMDETEN_DEFAULT                     (_MODEM_PHDMODCTRL_PMDETEN_DEFAULT << 15)       /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define _MODEM_PHDMODCTRL_REMODOSR_SHIFT                     16                                              /**< Shift value for MODEM_REMODOSR              */
#define _MODEM_PHDMODCTRL_REMODOSR_MASK                      0x3F0000UL                                      /**< Bit mask for MODEM_REMODOSR                 */
#define _MODEM_PHDMODCTRL_REMODOSR_DEFAULT                   0x0000001FUL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_REMODOSR_DEFAULT                    (_MODEM_PHDMODCTRL_REMODOSR_DEFAULT << 16)      /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define _MODEM_PHDMODCTRL_REMODDWN_SHIFT                     22                                              /**< Shift value for MODEM_REMODDWN              */
#define _MODEM_PHDMODCTRL_REMODDWN_MASK                      0x3C00000UL                                     /**< Bit mask for MODEM_REMODDWN                 */
#define _MODEM_PHDMODCTRL_REMODDWN_DEFAULT                   0x00000007UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_REMODDWN_DEFAULT                    (_MODEM_PHDMODCTRL_REMODDWN_DEFAULT << 22)      /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define _MODEM_PHDMODCTRL_REMODOUTSEL_SHIFT                  26                                              /**< Shift value for MODEM_REMODOUTSEL           */
#define _MODEM_PHDMODCTRL_REMODOUTSEL_MASK                   0xC000000UL                                     /**< Bit mask for MODEM_REMODOUTSEL              */
#define _MODEM_PHDMODCTRL_REMODOUTSEL_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_REMODOUTSEL_DEFAULT                 (_MODEM_PHDMODCTRL_REMODOUTSEL_DEFAULT << 26)   /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_REMODEN                             (0x1UL << 28)                                   /**< REMOD ENABLE                                */
#define _MODEM_PHDMODCTRL_REMODEN_SHIFT                      28                                              /**< Shift value for MODEM_REMODEN               */
#define _MODEM_PHDMODCTRL_REMODEN_MASK                       0x10000000UL                                    /**< Bit mask for MODEM_REMODEN                  */
#define _MODEM_PHDMODCTRL_REMODEN_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_REMODEN_DEFAULT                     (_MODEM_PHDMODCTRL_REMODEN_DEFAULT << 28)       /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_BCRDETECTOR                         (0x1UL << 29)                                   /**< Enbale BCRDMOD Dtetector ONLY               */
#define _MODEM_PHDMODCTRL_BCRDETECTOR_SHIFT                  29                                              /**< Shift value for MODEM_BCRDETECTOR           */
#define _MODEM_PHDMODCTRL_BCRDETECTOR_MASK                   0x20000000UL                                    /**< Bit mask for MODEM_BCRDETECTOR              */
#define _MODEM_PHDMODCTRL_BCRDETECTOR_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_BCRDETECTOR_DEFAULT                 (_MODEM_PHDMODCTRL_BCRDETECTOR_DEFAULT << 29)   /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_BCRTRECSCONC                        (0x1UL << 30)                                   /**< BCR/LEGACY CONCURRENT MODE                  */
#define _MODEM_PHDMODCTRL_BCRTRECSCONC_SHIFT                 30                                              /**< Shift value for MODEM_BCRTRECSCONC          */
#define _MODEM_PHDMODCTRL_BCRTRECSCONC_MASK                  0x40000000UL                                    /**< Bit mask for MODEM_BCRTRECSCONC             */
#define _MODEM_PHDMODCTRL_BCRTRECSCONC_DEFAULT               0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_BCRTRECSCONC_DEFAULT                (_MODEM_PHDMODCTRL_BCRTRECSCONC_DEFAULT << 30)  /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_BCRLEGACYCONC                       (0x1UL << 31)                                   /**< BCR/TRECS CONCURRENT MODE                   */
#define _MODEM_PHDMODCTRL_BCRLEGACYCONC_SHIFT                31                                              /**< Shift value for MODEM_BCRLEGACYCONC         */
#define _MODEM_PHDMODCTRL_BCRLEGACYCONC_MASK                 0x80000000UL                                    /**< Bit mask for MODEM_BCRLEGACYCONC            */
#define _MODEM_PHDMODCTRL_BCRLEGACYCONC_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_BCRLEGACYCONC_DEFAULT               (_MODEM_PHDMODCTRL_BCRLEGACYCONC_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */

/* Bit fields for MODEM ADCTRL1 */
#define _MODEM_ADCTRL1_RESETVALUE                            0x00000000UL                          /**< Default value for MODEM_ADCTRL1             */
#define _MODEM_ADCTRL1_MASK                                  0xFFFFFFFFUL                          /**< Mask for MODEM_ADCTRL1                      */
#define _MODEM_ADCTRL1_ADCTRL1_SHIFT                         0                                     /**< Shift value for MODEM_ADCTRL1               */
#define _MODEM_ADCTRL1_ADCTRL1_MASK                          0xFFFFFFFFUL                          /**< Bit mask for MODEM_ADCTRL1                  */
#define _MODEM_ADCTRL1_ADCTRL1_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for MODEM_ADCTRL1              */
#define MODEM_ADCTRL1_ADCTRL1_DEFAULT                        (_MODEM_ADCTRL1_ADCTRL1_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADCTRL1      */

