SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM ADQUAL0 */
#define _MODEM_ADQUAL0_RESETVALUE                            0x00000000UL                           /**< Default value for MODEM_ADQUAL0             */
#define _MODEM_ADQUAL0_MASK                                  0x03FF03FFUL                           /**< Mask for MODEM_ADQUAL0                      */
#define _MODEM_ADQUAL0_ADRSSI0_SHIFT                         0                                      /**< Shift value for MODEM_ADRSSI0               */
#define _MODEM_ADQUAL0_ADRSSI0_MASK                          0x3FFUL                                /**< Bit mask for MODEM_ADRSSI0                  */
#define _MODEM_ADQUAL0_ADRSSI0_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for MODEM_ADQUAL0              */
#define MODEM_ADQUAL0_ADRSSI0_DEFAULT                        (_MODEM_ADQUAL0_ADRSSI0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADQUAL0      */
#define _MODEM_ADQUAL0_ADRSSI1_SHIFT                         16                                     /**< Shift value for MODEM_ADRSSI1               */
#define _MODEM_ADQUAL0_ADRSSI1_MASK                          0x3FF0000UL                            /**< Bit mask for MODEM_ADRSSI1                  */
#define _MODEM_ADQUAL0_ADRSSI1_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for MODEM_ADQUAL0              */
#define MODEM_ADQUAL0_ADRSSI1_DEFAULT                        (_MODEM_ADQUAL0_ADRSSI1_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADQUAL0      */

/* Bit fields for MODEM ADQUAL1 */
#define _MODEM_ADQUAL1_RESETVALUE                            0x00000000UL                           /**< Default value for MODEM_ADQUAL1             */
#define _MODEM_ADQUAL1_MASK                                  0xFFFFFFFFUL                           /**< Mask for MODEM_ADQUAL1                      */
#define _MODEM_ADQUAL1_ADCORR0_SHIFT                         0                                      /**< Shift value for MODEM_ADCORR0               */
#define _MODEM_ADQUAL1_ADCORR0_MASK                          0x1FFFFUL                              /**< Bit mask for MODEM_ADCORR0                  */
#define _MODEM_ADQUAL1_ADCORR0_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for MODEM_ADQUAL1              */
#define MODEM_ADQUAL1_ADCORR0_DEFAULT                        (_MODEM_ADQUAL1_ADCORR0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADQUAL1      */
#define _MODEM_ADQUAL1_ADSTAT1_SHIFT                         17                                     /**< Shift value for MODEM_ADSTAT1               */
#define _MODEM_ADQUAL1_ADSTAT1_MASK                          0xFFFE0000UL                           /**< Bit mask for MODEM_ADSTAT1                  */
#define _MODEM_ADQUAL1_ADSTAT1_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for MODEM_ADQUAL1              */
#define MODEM_ADQUAL1_ADSTAT1_DEFAULT                        (_MODEM_ADQUAL1_ADSTAT1_DEFAULT << 17) /**< Shifted mode DEFAULT for MODEM_ADQUAL1      */

/* Bit fields for MODEM ADQUAL2 */
#define _MODEM_ADQUAL2_RESETVALUE                            0x00000000UL                            /**< Default value for MODEM_ADQUAL2             */
#define _MODEM_ADQUAL2_MASK                                  0x03FF03FFUL                            /**< Mask for MODEM_ADQUAL2                      */
#define _MODEM_ADQUAL2_ADRSSI0P_SHIFT                        0                                       /**< Shift value for MODEM_ADRSSI0P              */
#define _MODEM_ADQUAL2_ADRSSI0P_MASK                         0x3FFUL                                 /**< Bit mask for MODEM_ADRSSI0P                 */
#define _MODEM_ADQUAL2_ADRSSI0P_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for MODEM_ADQUAL2              */
#define MODEM_ADQUAL2_ADRSSI0P_DEFAULT                       (_MODEM_ADQUAL2_ADRSSI0P_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADQUAL2      */
#define _MODEM_ADQUAL2_ADRSSI1P_SHIFT                        16                                      /**< Shift value for MODEM_ADRSSI1P              */
#define _MODEM_ADQUAL2_ADRSSI1P_MASK                         0x3FF0000UL                             /**< Bit mask for MODEM_ADRSSI1P                 */
#define _MODEM_ADQUAL2_ADRSSI1P_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for MODEM_ADQUAL2              */
#define MODEM_ADQUAL2_ADRSSI1P_DEFAULT                       (_MODEM_ADQUAL2_ADRSSI1P_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADQUAL2      */

/* Bit fields for MODEM ADQUAL3 */
#define _MODEM_ADQUAL3_RESETVALUE                            0x00000000UL                           /**< Default value for MODEM_ADQUAL3             */
#define _MODEM_ADQUAL3_MASK                                  0xFFFFFFFFUL                           /**< Mask for MODEM_ADQUAL3                      */
#define _MODEM_ADQUAL3_ADCORR0P_SHIFT                        0                                      /**< Shift value for MODEM_ADCORR0P              */
#define _MODEM_ADQUAL3_ADCORR0P_MASK                         0x1FFFFUL                              /**< Bit mask for MODEM_ADCORR0P                 */
#define _MODEM_ADQUAL3_ADCORR0P_DEFAULT                      0x00000000UL                           /**< Mode DEFAULT for MODEM_ADQUAL3              */
#define MODEM_ADQUAL3_ADCORR0P_DEFAULT                       (_MODEM_ADQUAL3_ADCORR0P_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADQUAL3      */
#define _MODEM_ADQUAL3_ADSTAT2_SHIFT                         17                                     /**< Shift value for MODEM_ADSTAT2               */
#define _MODEM_ADQUAL3_ADSTAT2_MASK                          0xFFFE0000UL                           /**< Bit mask for MODEM_ADSTAT2                  */
#define _MODEM_ADQUAL3_ADSTAT2_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for MODEM_ADQUAL3              */
#define MODEM_ADQUAL3_ADSTAT2_DEFAULT                        (_MODEM_ADQUAL3_ADSTAT2_DEFAULT << 17) /**< Shifted mode DEFAULT for MODEM_ADQUAL3      */

/* Bit fields for MODEM ADQUAL4 */
#define _MODEM_ADQUAL4_RESETVALUE                            0x0200003FUL                               /**< Default value for MODEM_ADQUAL4             */
#define _MODEM_ADQUAL4_MASK                                  0x03FF003FUL                               /**< Mask for MODEM_ADQUAL4                      */
#define _MODEM_ADQUAL4_ADAGCGRTHR_SHIFT                      0                                          /**< Shift value for MODEM_ADAGCGRTHR            */
#define _MODEM_ADQUAL4_ADAGCGRTHR_MASK                       0x3FUL                                     /**< Bit mask for MODEM_ADAGCGRTHR               */
#define _MODEM_ADQUAL4_ADAGCGRTHR_DEFAULT                    0x0000003FUL                               /**< Mode DEFAULT for MODEM_ADQUAL4              */
#define MODEM_ADQUAL4_ADAGCGRTHR_DEFAULT                     (_MODEM_ADQUAL4_ADAGCGRTHR_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ADQUAL4      */
#define _MODEM_ADQUAL4_ADRSSIGRTHR_SHIFT                     16                                         /**< Shift value for MODEM_ADRSSIGRTHR           */
#define _MODEM_ADQUAL4_ADRSSIGRTHR_MASK                      0x3FF0000UL                                /**< Bit mask for MODEM_ADRSSIGRTHR              */
#define _MODEM_ADQUAL4_ADRSSIGRTHR_DEFAULT                   0x00000200UL                               /**< Mode DEFAULT for MODEM_ADQUAL4              */
#define MODEM_ADQUAL4_ADRSSIGRTHR_DEFAULT                    (_MODEM_ADQUAL4_ADRSSIGRTHR_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADQUAL4      */

/* Bit fields for MODEM ADQUAL5 */
#define _MODEM_ADQUAL5_RESETVALUE                            0x0000FFFFUL                               /**< Default value for MODEM_ADQUAL5             */
#define _MODEM_ADQUAL5_MASK                                  0x0001FFFFUL                               /**< Mask for MODEM_ADQUAL5                      */
#define _MODEM_ADQUAL5_ADDIRECTCORR_SHIFT                    0                                          /**< Shift value for MODEM_ADDIRECTCORR          */
#define _MODEM_ADQUAL5_ADDIRECTCORR_MASK                     0x1FFFFUL                                  /**< Bit mask for MODEM_ADDIRECTCORR             */
#define _MODEM_ADQUAL5_ADDIRECTCORR_DEFAULT                  0x0000FFFFUL                               /**< Mode DEFAULT for MODEM_ADQUAL5              */
#define MODEM_ADQUAL5_ADDIRECTCORR_DEFAULT                   (_MODEM_ADQUAL5_ADDIRECTCORR_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADQUAL5      */

/* Bit fields for MODEM ADQUAL6 */
#define _MODEM_ADQUAL6_RESETVALUE                            0x0000FFFFUL                                /**< Default value for MODEM_ADQUAL6             */
#define _MODEM_ADQUAL6_MASK                                  0xFFFFFFFFUL                                /**< Mask for MODEM_ADQUAL6                      */
#define _MODEM_ADQUAL6_ADBACORRTHR_SHIFT                     0                                           /**< Shift value for MODEM_ADBACORRTHR           */
#define _MODEM_ADQUAL6_ADBACORRTHR_MASK                      0x1FFFFUL                                   /**< Bit mask for MODEM_ADBACORRTHR              */
#define _MODEM_ADQUAL6_ADBACORRTHR_DEFAULT                   0x0000FFFFUL                                /**< Mode DEFAULT for MODEM_ADQUAL6              */
#define MODEM_ADQUAL6_ADBACORRTHR_DEFAULT                    (_MODEM_ADQUAL6_ADBACORRTHR_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ADQUAL6      */
#define _MODEM_ADQUAL6_ADBACORRDIFF_SHIFT                    17                                          /**< Shift value for MODEM_ADBACORRDIFF          */
#define _MODEM_ADQUAL6_ADBACORRDIFF_MASK                     0xFFFE0000UL                                /**< Bit mask for MODEM_ADBACORRDIFF             */
#define _MODEM_ADQUAL6_ADBACORRDIFF_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for MODEM_ADQUAL6              */
#define MODEM_ADQUAL6_ADBACORRDIFF_DEFAULT                   (_MODEM_ADQUAL6_ADBACORRDIFF_DEFAULT << 17) /**< Shifted mode DEFAULT for MODEM_ADQUAL6      */

