SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM ADQUAL7 */
#define _MODEM_ADQUAL7_RESETVALUE                            0x000003FFUL                                /**< Default value for MODEM_ADQUAL7             */
#define _MODEM_ADQUAL7_MASK                                  0x03FF03FFUL                                /**< Mask for MODEM_ADQUAL7                      */
#define _MODEM_ADQUAL7_ADBARSSITHR_SHIFT                     0                                           /**< Shift value for MODEM_ADBARSSITHR           */
#define _MODEM_ADQUAL7_ADBARSSITHR_MASK                      0x3FFUL                                     /**< Bit mask for MODEM_ADBARSSITHR              */
#define _MODEM_ADQUAL7_ADBARSSITHR_DEFAULT                   0x000003FFUL                                /**< Mode DEFAULT for MODEM_ADQUAL7              */
#define MODEM_ADQUAL7_ADBARSSITHR_DEFAULT                    (_MODEM_ADQUAL7_ADBARSSITHR_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ADQUAL7      */
#define _MODEM_ADQUAL7_ADBARSSIDIFF_SHIFT                    16                                          /**< Shift value for MODEM_ADBARSSIDIFF          */
#define _MODEM_ADQUAL7_ADBARSSIDIFF_MASK                     0x3FF0000UL                                 /**< Bit mask for MODEM_ADBARSSIDIFF             */
#define _MODEM_ADQUAL7_ADBARSSIDIFF_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for MODEM_ADQUAL7              */
#define MODEM_ADQUAL7_ADBARSSIDIFF_DEFAULT                   (_MODEM_ADQUAL7_ADBARSSIDIFF_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADQUAL7      */

/* Bit fields for MODEM ADQUAL8 */
#define _MODEM_ADQUAL8_RESETVALUE                            0x00000000UL                             /**< Default value for MODEM_ADQUAL8             */
#define _MODEM_ADQUAL8_MASK                                  0x0000033FUL                             /**< Mask for MODEM_ADQUAL8                      */
#define _MODEM_ADQUAL8_ADBAAGCTHR_SHIFT                      0                                        /**< Shift value for MODEM_ADBAAGCTHR            */
#define _MODEM_ADQUAL8_ADBAAGCTHR_MASK                       0x3FUL                                   /**< Bit mask for MODEM_ADBAAGCTHR               */
#define _MODEM_ADQUAL8_ADBAAGCTHR_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for MODEM_ADQUAL8              */
#define MODEM_ADQUAL8_ADBAAGCTHR_DEFAULT                     (_MODEM_ADQUAL8_ADBAAGCTHR_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADQUAL8      */
#define _MODEM_ADQUAL8_ADBAMODE_SHIFT                        8                                        /**< Shift value for MODEM_ADBAMODE              */
#define _MODEM_ADQUAL8_ADBAMODE_MASK                         0x300UL                                  /**< Bit mask for MODEM_ADBAMODE                 */
#define _MODEM_ADQUAL8_ADBAMODE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MODEM_ADQUAL8              */
#define MODEM_ADQUAL8_ADBAMODE_DEFAULT                       (_MODEM_ADQUAL8_ADBAMODE_DEFAULT << 8)   /**< Shifted mode DEFAULT for MODEM_ADQUAL8      */

/* Bit fields for MODEM ADQUAL9 */
#define _MODEM_ADQUAL9_RESETVALUE                            0x00000000UL                          /**< Default value for MODEM_ADQUAL9             */
#define _MODEM_ADQUAL9_MASK                                  0x0001FFFFUL                          /**< Mask for MODEM_ADQUAL9                      */
#define _MODEM_ADQUAL9_ADCORR1_SHIFT                         0                                     /**< Shift value for MODEM_ADCORR1               */
#define _MODEM_ADQUAL9_ADCORR1_MASK                          0x1FFFFUL                             /**< Bit mask for MODEM_ADCORR1                  */
#define _MODEM_ADQUAL9_ADCORR1_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for MODEM_ADQUAL9              */
#define MODEM_ADQUAL9_ADCORR1_DEFAULT                        (_MODEM_ADQUAL9_ADCORR1_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADQUAL9      */

/* Bit fields for MODEM ADQUAL10 */
#define _MODEM_ADQUAL10_RESETVALUE                           0x00000000UL                            /**< Default value for MODEM_ADQUAL10            */
#define _MODEM_ADQUAL10_MASK                                 0x0001FFFFUL                            /**< Mask for MODEM_ADQUAL10                     */
#define _MODEM_ADQUAL10_ADCORR1P_SHIFT                       0                                       /**< Shift value for MODEM_ADCORR1P              */
#define _MODEM_ADQUAL10_ADCORR1P_MASK                        0x1FFFFUL                               /**< Bit mask for MODEM_ADCORR1P                 */
#define _MODEM_ADQUAL10_ADCORR1P_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for MODEM_ADQUAL10             */
#define MODEM_ADQUAL10_ADCORR1P_DEFAULT                      (_MODEM_ADQUAL10_ADCORR1P_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADQUAL10     */

/* Bit fields for MODEM ADFSM0 */
#define _MODEM_ADFSM0_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_ADFSM0              */
#define _MODEM_ADFSM0_MASK                                   0x7FFFFFFFUL                             /**< Mask for MODEM_ADFSM0                       */
#define _MODEM_ADFSM0_ADSTATEC_SHIFT                         0                                        /**< Shift value for MODEM_ADSTATEC              */
#define _MODEM_ADFSM0_ADSTATEC_MASK                          0xFUL                                    /**< Bit mask for MODEM_ADSTATEC                 */
#define _MODEM_ADFSM0_ADSTATEC_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADSTATEC_DEFAULT                        (_MODEM_ADFSM0_ADSTATEC_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define _MODEM_ADFSM0_ADSTATEP_SHIFT                         4                                        /**< Shift value for MODEM_ADSTATEP              */
#define _MODEM_ADFSM0_ADSTATEP_MASK                          0xF0UL                                   /**< Bit mask for MODEM_ADSTATEP                 */
#define _MODEM_ADFSM0_ADSTATEP_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADSTATEP_DEFAULT                        (_MODEM_ADFSM0_ADSTATEP_DEFAULT << 4)    /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define _MODEM_ADFSM0_ADSTATEP2_SHIFT                        8                                        /**< Shift value for MODEM_ADSTATEP2             */
#define _MODEM_ADFSM0_ADSTATEP2_MASK                         0xF00UL                                  /**< Bit mask for MODEM_ADSTATEP2                */
#define _MODEM_ADFSM0_ADSTATEP2_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADSTATEP2_DEFAULT                       (_MODEM_ADFSM0_ADSTATEP2_DEFAULT << 8)   /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define _MODEM_ADFSM0_ADSTATEN_SHIFT                         12                                       /**< Shift value for MODEM_ADSTATEN              */
#define _MODEM_ADFSM0_ADSTATEN_MASK                          0xF000UL                                 /**< Bit mask for MODEM_ADSTATEN                 */
#define _MODEM_ADFSM0_ADSTATEN_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADSTATEN_DEFAULT                        (_MODEM_ADFSM0_ADSTATEN_DEFAULT << 12)   /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define MODEM_ADFSM0_ADTD0                                   (0x1UL << 16)                            /**< timdet0                                     */
#define _MODEM_ADFSM0_ADTD0_SHIFT                            16                                       /**< Shift value for MODEM_ADTD0                 */
#define _MODEM_ADFSM0_ADTD0_MASK                             0x10000UL                                /**< Bit mask for MODEM_ADTD0                    */
#define _MODEM_ADFSM0_ADTD0_DEFAULT                          0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADTD0_DEFAULT                           (_MODEM_ADFSM0_ADTD0_DEFAULT << 16)      /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define MODEM_ADFSM0_ADTD0P                                  (0x1UL << 17)                            /**< timdet0p                                    */
#define _MODEM_ADFSM0_ADTD0P_SHIFT                           17                                       /**< Shift value for MODEM_ADTD0P                */
#define _MODEM_ADFSM0_ADTD0P_MASK                            0x20000UL                                /**< Bit mask for MODEM_ADTD0P                   */
#define _MODEM_ADFSM0_ADTD0P_DEFAULT                         0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADTD0P_DEFAULT                          (_MODEM_ADFSM0_ADTD0P_DEFAULT << 17)     /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define MODEM_ADFSM0_ADTD1                                   (0x1UL << 18)                            /**< timdet1                                     */
#define _MODEM_ADFSM0_ADTD1_SHIFT                            18                                       /**< Shift value for MODEM_ADTD1                 */
#define _MODEM_ADFSM0_ADTD1_MASK                             0x40000UL                                /**< Bit mask for MODEM_ADTD1                    */
#define _MODEM_ADFSM0_ADTD1_DEFAULT                          0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADTD1_DEFAULT                           (_MODEM_ADFSM0_ADTD1_DEFAULT << 18)      /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define MODEM_ADFSM0_ADTD1P                                  (0x1UL << 19)                            /**< timdet1p                                    */
#define _MODEM_ADFSM0_ADTD1P_SHIFT                           19                                       /**< Shift value for MODEM_ADTD1P                */
#define _MODEM_ADFSM0_ADTD1P_MASK                            0x80000UL                                /**< Bit mask for MODEM_ADTD1P                   */
#define _MODEM_ADFSM0_ADTD1P_DEFAULT                         0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADTD1P_DEFAULT                          (_MODEM_ADFSM0_ADTD1P_DEFAULT << 19)     /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define MODEM_ADFSM0_ADAS                                    (0x1UL << 20)                            /**< antsel                                      */
#define _MODEM_ADFSM0_ADAS_SHIFT                             20                                       /**< Shift value for MODEM_ADAS                  */
#define _MODEM_ADFSM0_ADAS_MASK                              0x100000UL                               /**< Bit mask for MODEM_ADAS                     */
#define _MODEM_ADFSM0_ADAS_DEFAULT                           0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADAS_DEFAULT                            (_MODEM_ADFSM0_ADAS_DEFAULT << 20)       /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define MODEM_ADFSM0_ADBA                                    (0x1UL << 21)                            /**< best_antenna                                */
#define _MODEM_ADFSM0_ADBA_SHIFT                             21                                       /**< Shift value for MODEM_ADBA                  */
#define _MODEM_ADFSM0_ADBA_MASK                              0x200000UL                               /**< Bit mask for MODEM_ADBA                     */
#define _MODEM_ADFSM0_ADBA_DEFAULT                           0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADBA_DEFAULT                            (_MODEM_ADFSM0_ADBA_DEFAULT << 21)       /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define MODEM_ADFSM0_ADSTATREAD                              (0x1UL << 22)                            /**< ADSTATREAD                                  */
#define _MODEM_ADFSM0_ADSTATREAD_SHIFT                       22                                       /**< Shift value for MODEM_ADSTATREAD            */
#define _MODEM_ADFSM0_ADSTATREAD_MASK                        0x400000UL                               /**< Bit mask for MODEM_ADSTATREAD               */
#define _MODEM_ADFSM0_ADSTATREAD_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADSTATREAD_DEFAULT                      (_MODEM_ADFSM0_ADSTATREAD_DEFAULT << 22) /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define _MODEM_ADFSM0_ADSTAT1SEL_SHIFT                       23                                       /**< Shift value for MODEM_ADSTAT1SEL            */
#define _MODEM_ADFSM0_ADSTAT1SEL_MASK                        0x7800000UL                              /**< Bit mask for MODEM_ADSTAT1SEL               */
#define _MODEM_ADFSM0_ADSTAT1SEL_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADSTAT1SEL_DEFAULT                      (_MODEM_ADFSM0_ADSTAT1SEL_DEFAULT << 23) /**< Shifted mode DEFAULT for MODEM_ADFSM0       */
#define _MODEM_ADFSM0_ADSTAT2SEL_SHIFT                       27                                       /**< Shift value for MODEM_ADSTAT2SEL            */
#define _MODEM_ADFSM0_ADSTAT2SEL_MASK                        0x78000000UL                             /**< Bit mask for MODEM_ADSTAT2SEL               */
#define _MODEM_ADFSM0_ADSTAT2SEL_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM0               */
#define MODEM_ADFSM0_ADSTAT2SEL_DEFAULT                      (_MODEM_ADFSM0_ADSTAT2SEL_DEFAULT << 27) /**< Shifted mode DEFAULT for MODEM_ADFSM0       */

/* Bit fields for MODEM ADFSM1 */
#define _MODEM_ADFSM1_RESETVALUE                             0x00000000UL                             /**< Default value for MODEM_ADFSM1              */
#define _MODEM_ADFSM1_MASK                                   0xFFFFFFFFUL                             /**< Mask for MODEM_ADFSM1                       */
#define _MODEM_ADFSM1_ADOSETANT0_SHIFT                       0                                        /**< Shift value for MODEM_ADOSETANT0            */
#define _MODEM_ADFSM1_ADOSETANT0_MASK                        0xFFFFUL                                 /**< Bit mask for MODEM_ADOSETANT0               */
#define _MODEM_ADFSM1_ADOSETANT0_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM1               */
#define MODEM_ADFSM1_ADOSETANT0_DEFAULT                      (_MODEM_ADFSM1_ADOSETANT0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM1       */
#define _MODEM_ADFSM1_ADOSETANT1_SHIFT                       16                                       /**< Shift value for MODEM_ADOSETANT1            */
#define _MODEM_ADFSM1_ADOSETANT1_MASK                        0xFFFF0000UL                             /**< Bit mask for MODEM_ADOSETANT1               */
#define _MODEM_ADFSM1_ADOSETANT1_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MODEM_ADFSM1               */
#define MODEM_ADFSM1_ADOSETANT1_DEFAULT                      (_MODEM_ADFSM1_ADOSETANT1_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM1       */

