SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM ADFSM16 */
#define _MODEM_ADFSM16_RESETVALUE                            0x00000000UL                                 /**< Default value for MODEM_ADFSM16             */
#define _MODEM_ADFSM16_MASK                                  0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM16                      */
#define _MODEM_ADFSM16_ADFSMCOND0ENB_SHIFT                   0                                            /**< Shift value for MODEM_ADFSMCOND0ENB         */
#define _MODEM_ADFSM16_ADFSMCOND0ENB_MASK                    0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMCOND0ENB            */
#define _MODEM_ADFSM16_ADFSMCOND0ENB_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM16              */
#define MODEM_ADFSM16_ADFSMCOND0ENB_DEFAULT                  (_MODEM_ADFSM16_ADFSMCOND0ENB_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM16      */
#define _MODEM_ADFSM16_ADFSMCOND1ENB_SHIFT                   16                                           /**< Shift value for MODEM_ADFSMCOND1ENB         */
#define _MODEM_ADFSM16_ADFSMCOND1ENB_MASK                    0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCOND1ENB            */
#define _MODEM_ADFSM16_ADFSMCOND1ENB_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM16              */
#define MODEM_ADFSM16_ADFSMCOND1ENB_DEFAULT                  (_MODEM_ADFSM16_ADFSMCOND1ENB_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM16      */

/* Bit fields for MODEM ADFSM17 */
#define _MODEM_ADFSM17_RESETVALUE                            0x00000000UL                                 /**< Default value for MODEM_ADFSM17             */
#define _MODEM_ADFSM17_MASK                                  0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM17                      */
#define _MODEM_ADFSM17_ADFSMCOND2ENB_SHIFT                   0                                            /**< Shift value for MODEM_ADFSMCOND2ENB         */
#define _MODEM_ADFSM17_ADFSMCOND2ENB_MASK                    0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMCOND2ENB            */
#define _MODEM_ADFSM17_ADFSMCOND2ENB_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM17              */
#define MODEM_ADFSM17_ADFSMCOND2ENB_DEFAULT                  (_MODEM_ADFSM17_ADFSMCOND2ENB_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM17      */
#define _MODEM_ADFSM17_ADFSMCOND3ENB_SHIFT                   16                                           /**< Shift value for MODEM_ADFSMCOND3ENB         */
#define _MODEM_ADFSM17_ADFSMCOND3ENB_MASK                    0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCOND3ENB            */
#define _MODEM_ADFSM17_ADFSMCOND3ENB_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM17              */
#define MODEM_ADFSM17_ADFSMCOND3ENB_DEFAULT                  (_MODEM_ADFSM17_ADFSMCOND3ENB_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM17      */

/* Bit fields for MODEM ADFSM18 */
#define _MODEM_ADFSM18_RESETVALUE                            0x00000000UL                               /**< Default value for MODEM_ADFSM18             */
#define _MODEM_ADFSM18_MASK                                  0xFFFFFFFFUL                               /**< Mask for MODEM_ADFSM18                      */
#define _MODEM_ADFSM18_ADFSMCONDSEL_SHIFT                    0                                          /**< Shift value for MODEM_ADFSMCONDSEL          */
#define _MODEM_ADFSM18_ADFSMCONDSEL_MASK                     0xFFFFFFFFUL                               /**< Bit mask for MODEM_ADFSMCONDSEL             */
#define _MODEM_ADFSM18_ADFSMCONDSEL_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for MODEM_ADFSM18              */
#define MODEM_ADFSM18_ADFSMCONDSEL_DEFAULT                   (_MODEM_ADFSM18_ADFSMCONDSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADFSM18      */

/* Bit fields for MODEM ADFSM19 */
#define _MODEM_ADFSM19_RESETVALUE                            0x00000000UL                                 /**< Default value for MODEM_ADFSM19             */
#define _MODEM_ADFSM19_MASK                                  0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM19                      */
#define _MODEM_ADFSM19_ADFSMNEXTFORCE_SHIFT                  0                                            /**< Shift value for MODEM_ADFSMNEXTFORCE        */
#define _MODEM_ADFSM19_ADFSMNEXTFORCE_MASK                   0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMNEXTFORCE           */
#define _MODEM_ADFSM19_ADFSMNEXTFORCE_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM19              */
#define MODEM_ADFSM19_ADFSMNEXTFORCE_DEFAULT                 (_MODEM_ADFSM19_ADFSMNEXTFORCE_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADFSM19      */
#define _MODEM_ADFSM19_ADFSMCONDTRUE_SHIFT                   16                                           /**< Shift value for MODEM_ADFSMCONDTRUE         */
#define _MODEM_ADFSM19_ADFSMCONDTRUE_MASK                    0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCONDTRUE            */
#define _MODEM_ADFSM19_ADFSMCONDTRUE_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM19              */
#define MODEM_ADFSM19_ADFSMCONDTRUE_DEFAULT                  (_MODEM_ADFSM19_ADFSMCONDTRUE_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM19      */

/* Bit fields for MODEM ADFSM20 */
#define _MODEM_ADFSM20_RESETVALUE                            0x00000000UL                               /**< Default value for MODEM_ADFSM20             */
#define _MODEM_ADFSM20_MASK                                  0xFFFFFFFFUL                               /**< Mask for MODEM_ADFSM20                      */
#define _MODEM_ADFSM20_ADITENTEREN_SHIFT                     0                                          /**< Shift value for MODEM_ADITENTEREN           */
#define _MODEM_ADFSM20_ADITENTEREN_MASK                      0xFFFFUL                                   /**< Bit mask for MODEM_ADITENTEREN              */
#define _MODEM_ADFSM20_ADITENTEREN_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for MODEM_ADFSM20              */
#define MODEM_ADFSM20_ADITENTEREN_DEFAULT                    (_MODEM_ADFSM20_ADITENTEREN_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM20      */
#define _MODEM_ADFSM20_ADITLEAVEEN_SHIFT                     16                                         /**< Shift value for MODEM_ADITLEAVEEN           */
#define _MODEM_ADFSM20_ADITLEAVEEN_MASK                      0xFFFF0000UL                               /**< Bit mask for MODEM_ADITLEAVEEN              */
#define _MODEM_ADFSM20_ADITLEAVEEN_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for MODEM_ADFSM20              */
#define MODEM_ADFSM20_ADITLEAVEEN_DEFAULT                    (_MODEM_ADFSM20_ADITLEAVEEN_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM20      */

/* Bit fields for MODEM ADFSM21 */
#define _MODEM_ADFSM21_RESETVALUE                            0x00000000UL                                  /**< Default value for MODEM_ADFSM21             */
#define _MODEM_ADFSM21_MASK                                  0x0001007FUL                                  /**< Mask for MODEM_ADFSM21                      */
#define MODEM_ADFSM21_ADENTERFREEZEEN                        (0x1UL << 0)                                  /**< AD FSM enter freeze enable                  */
#define _MODEM_ADFSM21_ADENTERFREEZEEN_SHIFT                 0                                             /**< Shift value for MODEM_ADENTERFREEZEEN       */
#define _MODEM_ADFSM21_ADENTERFREEZEEN_MASK                  0x1UL                                         /**< Bit mask for MODEM_ADENTERFREEZEEN          */
#define _MODEM_ADFSM21_ADENTERFREEZEEN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for MODEM_ADFSM21              */
#define MODEM_ADFSM21_ADENTERFREEZEEN_DEFAULT                (_MODEM_ADFSM21_ADENTERFREEZEEN_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADFSM21      */
#define MODEM_ADFSM21_ADLEAVEFREEZEEN                        (0x1UL << 1)                                  /**< AD FSM leave freeze enable                  */
#define _MODEM_ADFSM21_ADLEAVEFREEZEEN_SHIFT                 1                                             /**< Shift value for MODEM_ADLEAVEFREEZEEN       */
#define _MODEM_ADFSM21_ADLEAVEFREEZEEN_MASK                  0x2UL                                         /**< Bit mask for MODEM_ADLEAVEFREEZEEN          */
#define _MODEM_ADFSM21_ADLEAVEFREEZEEN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for MODEM_ADFSM21              */
#define MODEM_ADFSM21_ADLEAVEFREEZEEN_DEFAULT                (_MODEM_ADFSM21_ADLEAVEFREEZEEN_DEFAULT << 1) /**< Shifted mode DEFAULT for MODEM_ADFSM21      */
#define MODEM_ADFSM21_ADFROZEN                               (0x1UL << 2)                                  /**< AD FSM frozen                               */
#define _MODEM_ADFSM21_ADFROZEN_SHIFT                        2                                             /**< Shift value for MODEM_ADFROZEN              */
#define _MODEM_ADFSM21_ADFROZEN_MASK                         0x4UL                                         /**< Bit mask for MODEM_ADFROZEN                 */
#define _MODEM_ADFSM21_ADFROZEN_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for MODEM_ADFSM21              */
#define MODEM_ADFSM21_ADFROZEN_DEFAULT                       (_MODEM_ADFSM21_ADFROZEN_DEFAULT << 2)        /**< Shifted mode DEFAULT for MODEM_ADFSM21      */
#define _MODEM_ADFSM21_ADUNFREEZENEXT_SHIFT                  3                                             /**< Shift value for MODEM_ADUNFREEZENEXT        */
#define _MODEM_ADFSM21_ADUNFREEZENEXT_MASK                   0x78UL                                        /**< Bit mask for MODEM_ADUNFREEZENEXT           */
#define _MODEM_ADFSM21_ADUNFREEZENEXT_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for MODEM_ADFSM21              */
#define MODEM_ADFSM21_ADUNFREEZENEXT_DEFAULT                 (_MODEM_ADFSM21_ADUNFREEZENEXT_DEFAULT << 3)  /**< Shifted mode DEFAULT for MODEM_ADFSM21      */
#define MODEM_ADFSM21_ADUNFREEZE                             (0x1UL << 16)                                 /**< AD FSM unfreeze                             */
#define _MODEM_ADFSM21_ADUNFREEZE_SHIFT                      16                                            /**< Shift value for MODEM_ADUNFREEZE            */
#define _MODEM_ADFSM21_ADUNFREEZE_MASK                       0x10000UL                                     /**< Bit mask for MODEM_ADUNFREEZE               */
#define _MODEM_ADFSM21_ADUNFREEZE_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for MODEM_ADFSM21              */
#define MODEM_ADFSM21_ADUNFREEZE_DEFAULT                     (_MODEM_ADFSM21_ADUNFREEZE_DEFAULT << 16)     /**< Shifted mode DEFAULT for MODEM_ADFSM21      */

/* Bit fields for MODEM ADFSM22 */
#define _MODEM_ADFSM22_RESETVALUE                            0x00000000UL                                   /**< Default value for MODEM_ADFSM22             */
#define _MODEM_ADFSM22_MASK                                  0xFFFFFFFFUL                                   /**< Mask for MODEM_ADFSM22                      */
#define _MODEM_ADFSM22_ADITENTERSTATUS_SHIFT                 0                                              /**< Shift value for MODEM_ADITENTERSTATUS       */
#define _MODEM_ADFSM22_ADITENTERSTATUS_MASK                  0xFFFFUL                                       /**< Bit mask for MODEM_ADITENTERSTATUS          */
#define _MODEM_ADFSM22_ADITENTERSTATUS_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADFSM22              */
#define MODEM_ADFSM22_ADITENTERSTATUS_DEFAULT                (_MODEM_ADFSM22_ADITENTERSTATUS_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM22      */
#define _MODEM_ADFSM22_ADITLEAVESTATUS_SHIFT                 16                                             /**< Shift value for MODEM_ADITLEAVESTATUS       */
#define _MODEM_ADFSM22_ADITLEAVESTATUS_MASK                  0xFFFF0000UL                                   /**< Bit mask for MODEM_ADITLEAVESTATUS          */
#define _MODEM_ADFSM22_ADITLEAVESTATUS_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADFSM22              */
#define MODEM_ADFSM22_ADITLEAVESTATUS_DEFAULT                (_MODEM_ADFSM22_ADITLEAVESTATUS_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM22      */

/* Bit fields for MODEM ADFSM23 */
#define _MODEM_ADFSM23_RESETVALUE                            0x00000000UL                                 /**< Default value for MODEM_ADFSM23             */
#define _MODEM_ADFSM23_MASK                                  0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM23                      */
#define _MODEM_ADFSM23_ADFSMCOND0ENC_SHIFT                   0                                            /**< Shift value for MODEM_ADFSMCOND0ENC         */
#define _MODEM_ADFSM23_ADFSMCOND0ENC_MASK                    0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMCOND0ENC            */
#define _MODEM_ADFSM23_ADFSMCOND0ENC_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM23              */
#define MODEM_ADFSM23_ADFSMCOND0ENC_DEFAULT                  (_MODEM_ADFSM23_ADFSMCOND0ENC_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM23      */
#define _MODEM_ADFSM23_ADFSMCOND1ENC_SHIFT                   16                                           /**< Shift value for MODEM_ADFSMCOND1ENC         */
#define _MODEM_ADFSM23_ADFSMCOND1ENC_MASK                    0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCOND1ENC            */
#define _MODEM_ADFSM23_ADFSMCOND1ENC_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM23              */
#define MODEM_ADFSM23_ADFSMCOND1ENC_DEFAULT                  (_MODEM_ADFSM23_ADFSMCOND1ENC_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM23      */

/* Bit fields for MODEM ADFSM24 */
#define _MODEM_ADFSM24_RESETVALUE                            0x00000000UL                                 /**< Default value for MODEM_ADFSM24             */
#define _MODEM_ADFSM24_MASK                                  0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM24                      */
#define _MODEM_ADFSM24_ADFSMCOND2ENC_SHIFT                   0                                            /**< Shift value for MODEM_ADFSMCOND2ENC         */
#define _MODEM_ADFSM24_ADFSMCOND2ENC_MASK                    0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMCOND2ENC            */
#define _MODEM_ADFSM24_ADFSMCOND2ENC_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM24              */
#define MODEM_ADFSM24_ADFSMCOND2ENC_DEFAULT                  (_MODEM_ADFSM24_ADFSMCOND2ENC_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM24      */
#define _MODEM_ADFSM24_ADFSMCOND3ENC_SHIFT                   16                                           /**< Shift value for MODEM_ADFSMCOND3ENC         */
#define _MODEM_ADFSM24_ADFSMCOND3ENC_MASK                    0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCOND3ENC            */
#define _MODEM_ADFSM24_ADFSMCOND3ENC_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM24              */
#define MODEM_ADFSM24_ADFSMCOND3ENC_DEFAULT                  (_MODEM_ADFSM24_ADFSMCOND3ENC_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM24      */

/* Bit fields for MODEM ADFSM25 */
#define _MODEM_ADFSM25_RESETVALUE                            0x00000000UL                                /**< Default value for MODEM_ADFSM25             */
#define _MODEM_ADFSM25_MASK                                  0xFFFFFFFFUL                                /**< Mask for MODEM_ADFSM25                      */
#define _MODEM_ADFSM25_ADFSMCONDOR0_SHIFT                    0                                           /**< Shift value for MODEM_ADFSMCONDOR0          */
#define _MODEM_ADFSM25_ADFSMCONDOR0_MASK                     0xFFFFUL                                    /**< Bit mask for MODEM_ADFSMCONDOR0             */
#define _MODEM_ADFSM25_ADFSMCONDOR0_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for MODEM_ADFSM25              */
#define MODEM_ADFSM25_ADFSMCONDOR0_DEFAULT                   (_MODEM_ADFSM25_ADFSMCONDOR0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM25      */
#define _MODEM_ADFSM25_ADFSMCONDOR1_SHIFT                    16                                          /**< Shift value for MODEM_ADFSMCONDOR1          */
#define _MODEM_ADFSM25_ADFSMCONDOR1_MASK                     0xFFFF0000UL                                /**< Bit mask for MODEM_ADFSMCONDOR1             */
#define _MODEM_ADFSM25_ADFSMCONDOR1_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for MODEM_ADFSM25              */
#define MODEM_ADFSM25_ADFSMCONDOR1_DEFAULT                   (_MODEM_ADFSM25_ADFSMCONDOR1_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM25      */

