SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM ADFSM26 */
#define _MODEM_ADFSM26_RESETVALUE                            0x00000000UL                                 /**< Default value for MODEM_ADFSM26             */
#define _MODEM_ADFSM26_MASK                                  0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM26                      */
#define _MODEM_ADFSM26_ADFSMCOND0END_SHIFT                   0                                            /**< Shift value for MODEM_ADFSMCOND0END         */
#define _MODEM_ADFSM26_ADFSMCOND0END_MASK                    0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMCOND0END            */
#define _MODEM_ADFSM26_ADFSMCOND0END_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM26              */
#define MODEM_ADFSM26_ADFSMCOND0END_DEFAULT                  (_MODEM_ADFSM26_ADFSMCOND0END_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM26      */
#define _MODEM_ADFSM26_ADFSMCOND1END_SHIFT                   16                                           /**< Shift value for MODEM_ADFSMCOND1END         */
#define _MODEM_ADFSM26_ADFSMCOND1END_MASK                    0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCOND1END            */
#define _MODEM_ADFSM26_ADFSMCOND1END_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM26              */
#define MODEM_ADFSM26_ADFSMCOND1END_DEFAULT                  (_MODEM_ADFSM26_ADFSMCOND1END_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM26      */

/* Bit fields for MODEM ADFSM27 */
#define _MODEM_ADFSM27_RESETVALUE                            0x00000000UL                                 /**< Default value for MODEM_ADFSM27             */
#define _MODEM_ADFSM27_MASK                                  0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM27                      */
#define _MODEM_ADFSM27_ADFSMCOND2END_SHIFT                   0                                            /**< Shift value for MODEM_ADFSMCOND2END         */
#define _MODEM_ADFSM27_ADFSMCOND2END_MASK                    0xFFFFUL                                     /**< Bit mask for MODEM_ADFSMCOND2END            */
#define _MODEM_ADFSM27_ADFSMCOND2END_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM27              */
#define MODEM_ADFSM27_ADFSMCOND2END_DEFAULT                  (_MODEM_ADFSM27_ADFSMCOND2END_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM27      */
#define _MODEM_ADFSM27_ADFSMCOND3END_SHIFT                   16                                           /**< Shift value for MODEM_ADFSMCOND3END         */
#define _MODEM_ADFSM27_ADFSMCOND3END_MASK                    0xFFFF0000UL                                 /**< Bit mask for MODEM_ADFSMCOND3END            */
#define _MODEM_ADFSM27_ADFSMCOND3END_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM27              */
#define MODEM_ADFSM27_ADFSMCOND3END_DEFAULT                  (_MODEM_ADFSM27_ADFSMCOND3END_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM27      */

/* Bit fields for MODEM ADFSM28 */
#define _MODEM_ADFSM28_RESETVALUE                            0x00000000UL                                     /**< Default value for MODEM_ADFSM28             */
#define _MODEM_ADFSM28_MASK                                  0xFFFFFFFFUL                                     /**< Mask for MODEM_ADFSM28                      */
#define _MODEM_ADFSM28_ADOSETANTFORCE_SHIFT                  0                                                /**< Shift value for MODEM_ADOSETANTFORCE        */
#define _MODEM_ADFSM28_ADOSETANTFORCE_MASK                   0xFFFFUL                                         /**< Bit mask for MODEM_ADOSETANTFORCE           */
#define _MODEM_ADFSM28_ADOSETANTFORCE_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for MODEM_ADFSM28              */
#define MODEM_ADFSM28_ADOSETANTFORCE_DEFAULT                 (_MODEM_ADFSM28_ADOSETANTFORCE_DEFAULT << 0)     /**< Shifted mode DEFAULT for MODEM_ADFSM28      */
#define _MODEM_ADFSM28_ADORESTARTRXFORCE_SHIFT               16                                               /**< Shift value for MODEM_ADORESTARTRXFORCE     */
#define _MODEM_ADFSM28_ADORESTARTRXFORCE_MASK                0xFFFF0000UL                                     /**< Bit mask for MODEM_ADORESTARTRXFORCE        */
#define _MODEM_ADFSM28_ADORESTARTRXFORCE_DEFAULT             0x00000000UL                                     /**< Mode DEFAULT for MODEM_ADFSM28              */
#define MODEM_ADFSM28_ADORESTARTRXFORCE_DEFAULT              (_MODEM_ADFSM28_ADORESTARTRXFORCE_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM28      */

/* Bit fields for MODEM ADFSM29 */
#define _MODEM_ADFSM29_RESETVALUE                            0x00000000UL                                     /**< Default value for MODEM_ADFSM29             */
#define _MODEM_ADFSM29_MASK                                  0xFFFFFFFFUL                                     /**< Mask for MODEM_ADFSM29                      */
#define _MODEM_ADFSM29_ADOQUALUPDATEFORCE_SHIFT              0                                                /**< Shift value for MODEM_ADOQUALUPDATEFORCE    */
#define _MODEM_ADFSM29_ADOQUALUPDATEFORCE_MASK               0xFFFFUL                                         /**< Bit mask for MODEM_ADOQUALUPDATEFORCE       */
#define _MODEM_ADFSM29_ADOQUALUPDATEFORCE_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for MODEM_ADFSM29              */
#define MODEM_ADFSM29_ADOQUALUPDATEFORCE_DEFAULT             (_MODEM_ADFSM29_ADOQUALUPDATEFORCE_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADFSM29      */
#define _MODEM_ADFSM29_ADOQUALCLEARFORCE_SHIFT               16                                               /**< Shift value for MODEM_ADOQUALCLEARFORCE     */
#define _MODEM_ADFSM29_ADOQUALCLEARFORCE_MASK                0xFFFF0000UL                                     /**< Bit mask for MODEM_ADOQUALCLEARFORCE        */
#define _MODEM_ADFSM29_ADOQUALCLEARFORCE_DEFAULT             0x00000000UL                                     /**< Mode DEFAULT for MODEM_ADFSM29              */
#define MODEM_ADFSM29_ADOQUALCLEARFORCE_DEFAULT              (_MODEM_ADFSM29_ADOQUALCLEARFORCE_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM29      */

