SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM BCRDEMODCTRL */
#define _MODEM_BCRDEMODCTRL_RESETVALUE                       0x06890100UL                                           /**< Default value for MODEM_BCRDEMODCTRL        */
#define _MODEM_BCRDEMODCTRL_MASK                             0xFFFFDFFFUL                                           /**< Mask for MODEM_BCRDEMODCTRL                 */
#define MODEM_BCRDEMODCTRL_BCRDEMODEN                        (0x1UL << 0)                                           /**< BCR DEMOD ENABLE                            */
#define _MODEM_BCRDEMODCTRL_BCRDEMODEN_SHIFT                 0                                                      /**< Shift value for MODEM_BCRDEMODEN            */
#define _MODEM_BCRDEMODCTRL_BCRDEMODEN_MASK                  0x1UL                                                  /**< Bit mask for MODEM_BCRDEMODEN               */
#define _MODEM_BCRDEMODCTRL_BCRDEMODEN_DEFAULT               0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_BCRDEMODEN_DEFAULT                (_MODEM_BCRDEMODCTRL_BCRDEMODEN_DEFAULT << 0)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_PULCORRBYP                        (0x1UL << 1)                                           /**< BYPASS PULSE CORR                           */
#define _MODEM_BCRDEMODCTRL_PULCORRBYP_SHIFT                 1                                                      /**< Shift value for MODEM_PULCORRBYP            */
#define _MODEM_BCRDEMODCTRL_PULCORRBYP_MASK                  0x2UL                                                  /**< Bit mask for MODEM_PULCORRBYP               */
#define _MODEM_BCRDEMODCTRL_PULCORRBYP_DEFAULT               0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_PULCORRBYP_OFF                   0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_PULCORRBYP_ON                    0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_PULCORRBYP_DEFAULT                (_MODEM_BCRDEMODCTRL_PULCORRBYP_DEFAULT << 1)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_PULCORRBYP_OFF                    (_MODEM_BCRDEMODCTRL_PULCORRBYP_OFF << 1)              /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_PULCORRBYP_ON                     (_MODEM_BCRDEMODCTRL_PULCORRBYP_ON << 1)               /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_RAWSYN                            (0x1UL << 2)                                           /**< RAWSYN                                      */
#define _MODEM_BCRDEMODCTRL_RAWSYN_SHIFT                     2                                                      /**< Shift value for MODEM_RAWSYN                */
#define _MODEM_BCRDEMODCTRL_RAWSYN_MASK                      0x4UL                                                  /**< Bit mask for MODEM_RAWSYN                   */
#define _MODEM_BCRDEMODCTRL_RAWSYN_DEFAULT                   0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_RAWSYN_OFF                       0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_RAWSYN_ON                        0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_RAWSYN_DEFAULT                    (_MODEM_BCRDEMODCTRL_RAWSYN_DEFAULT << 2)              /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_RAWSYN_OFF                        (_MODEM_BCRDEMODCTRL_RAWSYN_OFF << 2)                  /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_RAWSYN_ON                         (_MODEM_BCRDEMODCTRL_RAWSYN_ON << 2)                   /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_CONSCHKBYP                        (0x1UL << 3)                                           /**< CONSCHKBYP                                  */
#define _MODEM_BCRDEMODCTRL_CONSCHKBYP_SHIFT                 3                                                      /**< Shift value for MODEM_CONSCHKBYP            */
#define _MODEM_BCRDEMODCTRL_CONSCHKBYP_MASK                  0x8UL                                                  /**< Bit mask for MODEM_CONSCHKBYP               */
#define _MODEM_BCRDEMODCTRL_CONSCHKBYP_DEFAULT               0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_CONSCHKBYP_ON                    0x00000000UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define _MODEM_BCRDEMODCTRL_CONSCHKBYP_OFF                   0x00000001UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define MODEM_BCRDEMODCTRL_CONSCHKBYP_DEFAULT                (_MODEM_BCRDEMODCTRL_CONSCHKBYP_DEFAULT << 3)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_CONSCHKBYP_ON                     (_MODEM_BCRDEMODCTRL_CONSCHKBYP_ON << 3)               /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_CONSCHKBYP_OFF                    (_MODEM_BCRDEMODCTRL_CONSCHKBYP_OFF << 3)              /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_PH0SIZE                           (0x1UL << 4)                                           /**< PH0SIZE                                     */
#define _MODEM_BCRDEMODCTRL_PH0SIZE_SHIFT                    4                                                      /**< Shift value for MODEM_PH0SIZE               */
#define _MODEM_BCRDEMODCTRL_PH0SIZE_MASK                     0x10UL                                                 /**< Bit mask for MODEM_PH0SIZE                  */
#define _MODEM_BCRDEMODCTRL_PH0SIZE_DEFAULT                  0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_PH0SIZE_OFF                      0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_PH0SIZE_ON                       0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_PH0SIZE_DEFAULT                   (_MODEM_BCRDEMODCTRL_PH0SIZE_DEFAULT << 4)             /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_PH0SIZE_OFF                       (_MODEM_BCRDEMODCTRL_PH0SIZE_OFF << 4)                 /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_PH0SIZE_ON                        (_MODEM_BCRDEMODCTRL_PH0SIZE_ON << 4)                  /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_LOCKUPBYP                         (0x1UL << 5)                                           /**< LOCKUPBYP                                   */
#define _MODEM_BCRDEMODCTRL_LOCKUPBYP_SHIFT                  5                                                      /**< Shift value for MODEM_LOCKUPBYP             */
#define _MODEM_BCRDEMODCTRL_LOCKUPBYP_MASK                   0x20UL                                                 /**< Bit mask for MODEM_LOCKUPBYP                */
#define _MODEM_BCRDEMODCTRL_LOCKUPBYP_DEFAULT                0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_LOCKUPBYP_OFF                    0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_LOCKUPBYP_ON                     0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_LOCKUPBYP_DEFAULT                 (_MODEM_BCRDEMODCTRL_LOCKUPBYP_DEFAULT << 5)           /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_LOCKUPBYP_OFF                     (_MODEM_BCRDEMODCTRL_LOCKUPBYP_OFF << 5)               /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_LOCKUPBYP_ON                      (_MODEM_BCRDEMODCTRL_LOCKUPBYP_ON << 5)                /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_RAWFASTMA                         (0x1UL << 6)                                           /**< RAWFASTMA                                   */
#define _MODEM_BCRDEMODCTRL_RAWFASTMA_SHIFT                  6                                                      /**< Shift value for MODEM_RAWFASTMA             */
#define _MODEM_BCRDEMODCTRL_RAWFASTMA_MASK                   0x40UL                                                 /**< Bit mask for MODEM_RAWFASTMA                */
#define _MODEM_BCRDEMODCTRL_RAWFASTMA_DEFAULT                0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_RAWFASTMA_OFF                    0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_RAWFASTMA_ON                     0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_RAWFASTMA_DEFAULT                 (_MODEM_BCRDEMODCTRL_RAWFASTMA_DEFAULT << 6)           /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_RAWFASTMA_OFF                     (_MODEM_BCRDEMODCTRL_RAWFASTMA_OFF << 6)               /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_RAWFASTMA_ON                      (_MODEM_BCRDEMODCTRL_RAWFASTMA_ON << 6)                /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_SPIKEREMOV                        (0x1UL << 7)                                           /**< SPIKEREMOV                                  */
#define _MODEM_BCRDEMODCTRL_SPIKEREMOV_SHIFT                 7                                                      /**< Shift value for MODEM_SPIKEREMOV            */
#define _MODEM_BCRDEMODCTRL_SPIKEREMOV_MASK                  0x80UL                                                 /**< Bit mask for MODEM_SPIKEREMOV               */
#define _MODEM_BCRDEMODCTRL_SPIKEREMOV_DEFAULT               0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_SPIKEREMOV_OFF                   0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_SPIKEREMOV_ON                    0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_SPIKEREMOV_DEFAULT                (_MODEM_BCRDEMODCTRL_SPIKEREMOV_DEFAULT << 7)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_SPIKEREMOV_OFF                    (_MODEM_BCRDEMODCTRL_SPIKEREMOV_OFF << 7)              /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_SPIKEREMOV_ON                     (_MODEM_BCRDEMODCTRL_SPIKEREMOV_ON << 7)               /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define _MODEM_BCRDEMODCTRL_RAWFLTSEL_SHIFT                  8                                                      /**< Shift value for MODEM_RAWFLTSEL             */
#define _MODEM_BCRDEMODCTRL_RAWFLTSEL_MASK                   0x300UL                                                /**< Bit mask for MODEM_RAWFLTSEL                */
#define _MODEM_BCRDEMODCTRL_RAWFLTSEL_DEFAULT                0x00000001UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_RAWFLTSEL_OFF                    0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_RAWFLTSEL_ON                     0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_RAWFLTSEL_DEFAULT                 (_MODEM_BCRDEMODCTRL_RAWFLTSEL_DEFAULT << 8)           /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_RAWFLTSEL_OFF                     (_MODEM_BCRDEMODCTRL_RAWFLTSEL_OFF << 8)               /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_RAWFLTSEL_ON                      (_MODEM_BCRDEMODCTRL_RAWFLTSEL_ON << 8)                /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_MANCHDLY                          (0x1UL << 10)                                          /**< Manchester decoder delay                    */
#define _MODEM_BCRDEMODCTRL_MANCHDLY_SHIFT                   10                                                     /**< Shift value for MODEM_MANCHDLY              */
#define _MODEM_BCRDEMODCTRL_MANCHDLY_MASK                    0x400UL                                                /**< Bit mask for MODEM_MANCHDLY                 */
#define _MODEM_BCRDEMODCTRL_MANCHDLY_DEFAULT                 0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_MANCHDLY_DEFAULT                  (_MODEM_BCRDEMODCTRL_MANCHDLY_DEFAULT << 10)           /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_CICDINSCALE                       (0x1UL << 11)                                          /**< CIC INPUT SCALE                             */
#define _MODEM_BCRDEMODCTRL_CICDINSCALE_SHIFT                11                                                     /**< Shift value for MODEM_CICDINSCALE           */
#define _MODEM_BCRDEMODCTRL_CICDINSCALE_MASK                 0x800UL                                                /**< Bit mask for MODEM_CICDINSCALE              */
#define _MODEM_BCRDEMODCTRL_CICDINSCALE_DEFAULT              0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_CICDINSCALE_DEFAULT               (_MODEM_BCRDEMODCTRL_CICDINSCALE_DEFAULT << 11)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_DATAFLTBY                         (0x1UL << 12)                                          /**< DATA filter Bypass                          */
#define _MODEM_BCRDEMODCTRL_DATAFLTBY_SHIFT                  12                                                     /**< Shift value for MODEM_DATAFLTBY             */
#define _MODEM_BCRDEMODCTRL_DATAFLTBY_MASK                   0x1000UL                                               /**< Bit mask for MODEM_DATAFLTBY                */
#define _MODEM_BCRDEMODCTRL_DATAFLTBY_DEFAULT                0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_DATAFLTBY_DEFAULT                 (_MODEM_BCRDEMODCTRL_DATAFLTBY_DEFAULT << 12)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define _MODEM_BCRDEMODCTRL_PREATH_SHIFT                     14                                                     /**< Shift value for MODEM_PREATH                */
#define _MODEM_BCRDEMODCTRL_PREATH_MASK                      0x7C000UL                                              /**< Bit mask for MODEM_PREATH                   */
#define _MODEM_BCRDEMODCTRL_PREATH_DEFAULT                   0x00000004UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_PREATH_DEFAULT                    (_MODEM_BCRDEMODCTRL_PREATH_DEFAULT << 14)             /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_SKIPSYN                           (0x1UL << 19)                                          /**< SKIPSYN                                     */
#define _MODEM_BCRDEMODCTRL_SKIPSYN_SHIFT                    19                                                     /**< Shift value for MODEM_SKIPSYN               */
#define _MODEM_BCRDEMODCTRL_SKIPSYN_MASK                     0x80000UL                                              /**< Bit mask for MODEM_SKIPSYN                  */
#define _MODEM_BCRDEMODCTRL_SKIPSYN_DEFAULT                  0x00000001UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_SKIPSYN_OFF                      0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_SKIPSYN_ON                       0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_SKIPSYN_DEFAULT                   (_MODEM_BCRDEMODCTRL_SKIPSYN_DEFAULT << 19)            /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_SKIPSYN_OFF                       (_MODEM_BCRDEMODCTRL_SKIPSYN_OFF << 19)                /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_SKIPSYN_ON                        (_MODEM_BCRDEMODCTRL_SKIPSYN_ON << 19)                 /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define _MODEM_BCRDEMODCTRL_PMPATTERN_SHIFT                  20                                                     /**< Shift value for MODEM_PMPATTERN             */
#define _MODEM_BCRDEMODCTRL_PMPATTERN_MASK                   0x300000UL                                             /**< Bit mask for MODEM_PMPATTERN                */
#define _MODEM_BCRDEMODCTRL_PMPATTERN_DEFAULT                0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_PMPATTERN_Pattern1010            0x00000000UL                                           /**< Mode Pattern1010 for MODEM_BCRDEMODCTRL     */
#define _MODEM_BCRDEMODCTRL_PMPATTERN_Consecutive_one        0x00000001UL                                           /**< Mode Consecutive_one for MODEM_BCRDEMODCTRL */
#define _MODEM_BCRDEMODCTRL_PMPATTERN_Consecutive_zero       0x00000002UL                                           /**< Mode Consecutive_zero for MODEM_BCRDEMODCTRL*/
#define _MODEM_BCRDEMODCTRL_PMPATTERN_random                 0x00000003UL                                           /**< Mode random for MODEM_BCRDEMODCTRL          */
#define MODEM_BCRDEMODCTRL_PMPATTERN_DEFAULT                 (_MODEM_BCRDEMODCTRL_PMPATTERN_DEFAULT << 20)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_PMPATTERN_Pattern1010             (_MODEM_BCRDEMODCTRL_PMPATTERN_Pattern1010 << 20)      /**< Shifted mode Pattern1010 for MODEM_BCRDEMODCTRL*/
#define MODEM_BCRDEMODCTRL_PMPATTERN_Consecutive_one         (_MODEM_BCRDEMODCTRL_PMPATTERN_Consecutive_one << 20)  /**< Shifted mode Consecutive_one for MODEM_BCRDEMODCTRL*/
#define MODEM_BCRDEMODCTRL_PMPATTERN_Consecutive_zero        (_MODEM_BCRDEMODCTRL_PMPATTERN_Consecutive_zero << 20) /**< Shifted mode Consecutive_zero for MODEM_BCRDEMODCTRL*/
#define MODEM_BCRDEMODCTRL_PMPATTERN_random                  (_MODEM_BCRDEMODCTRL_PMPATTERN_random << 20)           /**< Shifted mode random for MODEM_BCRDEMODCTRL  */
#define MODEM_BCRDEMODCTRL_NONSTDPK                          (0x1UL << 22)                                          /**< NONSTDPK                                    */
#define _MODEM_BCRDEMODCTRL_NONSTDPK_SHIFT                   22                                                     /**< Shift value for MODEM_NONSTDPK              */
#define _MODEM_BCRDEMODCTRL_NONSTDPK_MASK                    0x400000UL                                             /**< Bit mask for MODEM_NONSTDPK                 */
#define _MODEM_BCRDEMODCTRL_NONSTDPK_DEFAULT                 0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_NONSTDPK_OFF                     0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_NONSTDPK_ON                      0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_NONSTDPK_DEFAULT                  (_MODEM_BCRDEMODCTRL_NONSTDPK_DEFAULT << 22)           /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_NONSTDPK_OFF                      (_MODEM_BCRDEMODCTRL_NONSTDPK_OFF << 22)               /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_NONSTDPK_ON                       (_MODEM_BCRDEMODCTRL_NONSTDPK_ON << 22)                /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_SLICERFAST                        (0x1UL << 23)                                          /**< SLICERFAST                                  */
#define _MODEM_BCRDEMODCTRL_SLICERFAST_SHIFT                 23                                                     /**< Shift value for MODEM_SLICERFAST            */
#define _MODEM_BCRDEMODCTRL_SLICERFAST_MASK                  0x800000UL                                             /**< Bit mask for MODEM_SLICERFAST               */
#define _MODEM_BCRDEMODCTRL_SLICERFAST_DEFAULT               0x00000001UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_SLICERFAST_OFF                   0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_SLICERFAST_ON                    0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_SLICERFAST_DEFAULT                (_MODEM_BCRDEMODCTRL_SLICERFAST_DEFAULT << 23)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_SLICERFAST_OFF                    (_MODEM_BCRDEMODCTRL_SLICERFAST_OFF << 23)             /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_SLICERFAST_ON                     (_MODEM_BCRDEMODCTRL_SLICERFAST_ON << 23)              /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_DIRECTMODE                        (0x1UL << 24)                                          /**< Direct mode                                 */
#define _MODEM_BCRDEMODCTRL_DIRECTMODE_SHIFT                 24                                                     /**< Shift value for MODEM_DIRECTMODE            */
#define _MODEM_BCRDEMODCTRL_DIRECTMODE_MASK                  0x1000000UL                                            /**< Bit mask for MODEM_DIRECTMODE               */
#define _MODEM_BCRDEMODCTRL_DIRECTMODE_DEFAULT               0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_DIRECTMODE_DEFAULT                (_MODEM_BCRDEMODCTRL_DIRECTMODE_DEFAULT << 24)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define _MODEM_BCRDEMODCTRL_DETECTORSEL_SHIFT                25                                                     /**< Shift value for MODEM_DETECTORSEL           */
