SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
#define _MODEM_BCRDEMODCTRL_DETECTORSEL_MASK                 0xE000000UL                                            /**< Bit mask for MODEM_DETECTORSEL              */
#define _MODEM_BCRDEMODCTRL_DETECTORSEL_DEFAULT              0x00000003UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_DETECTORSEL_ma_pk                0x00000000UL                                           /**< Mode ma_pk for MODEM_BCRDEMODCTRL           */
#define _MODEM_BCRDEMODCTRL_DETECTORSEL_pk                   0x00000001UL                                           /**< Mode pk for MODEM_BCRDEMODCTRL              */
#define _MODEM_BCRDEMODCTRL_DETECTORSEL_ma                   0x00000002UL                                           /**< Mode ma for MODEM_BCRDEMODCTRL              */
#define _MODEM_BCRDEMODCTRL_DETECTORSEL_mean                 0x00000003UL                                           /**< Mode mean for MODEM_BCRDEMODCTRL            */
#define MODEM_BCRDEMODCTRL_DETECTORSEL_DEFAULT               (_MODEM_BCRDEMODCTRL_DETECTORSEL_DEFAULT << 25)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_DETECTORSEL_ma_pk                 (_MODEM_BCRDEMODCTRL_DETECTORSEL_ma_pk << 25)          /**< Shifted mode ma_pk for MODEM_BCRDEMODCTRL   */
#define MODEM_BCRDEMODCTRL_DETECTORSEL_pk                    (_MODEM_BCRDEMODCTRL_DETECTORSEL_pk << 25)             /**< Shifted mode pk for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_DETECTORSEL_ma                    (_MODEM_BCRDEMODCTRL_DETECTORSEL_ma << 25)             /**< Shifted mode ma for MODEM_BCRDEMODCTRL      */
#define MODEM_BCRDEMODCTRL_DETECTORSEL_mean                  (_MODEM_BCRDEMODCTRL_DETECTORSEL_mean << 25)           /**< Shifted mode mean for MODEM_BCRDEMODCTRL    */
#define MODEM_BCRDEMODCTRL_BBPMDETEN                         (0x1UL << 28)                                          /**< BINARY BIT PREAMBLE DET                     */
#define _MODEM_BCRDEMODCTRL_BBPMDETEN_SHIFT                  28                                                     /**< Shift value for MODEM_BBPMDETEN             */
#define _MODEM_BCRDEMODCTRL_BBPMDETEN_MASK                   0x10000000UL                                           /**< Bit mask for MODEM_BBPMDETEN                */
#define _MODEM_BCRDEMODCTRL_BBPMDETEN_DEFAULT                0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_BBPMDETEN_DEFAULT                 (_MODEM_BCRDEMODCTRL_BBPMDETEN_DEFAULT << 28)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_MANCHPH                           (0x1UL << 29)                                          /**< Manchester decoder phase                    */
#define _MODEM_BCRDEMODCTRL_MANCHPH_SHIFT                    29                                                     /**< Shift value for MODEM_MANCHPH               */
#define _MODEM_BCRDEMODCTRL_MANCHPH_MASK                     0x20000000UL                                           /**< Bit mask for MODEM_MANCHPH                  */
#define _MODEM_BCRDEMODCTRL_MANCHPH_DEFAULT                  0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_MANCHPH_DEFAULT                   (_MODEM_BCRDEMODCTRL_MANCHPH_DEFAULT << 29)            /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_INVRXBIT                          (0x1UL << 30)                                          /**< INVRXBIT                                    */
#define _MODEM_BCRDEMODCTRL_INVRXBIT_SHIFT                   30                                                     /**< Shift value for MODEM_INVRXBIT              */
#define _MODEM_BCRDEMODCTRL_INVRXBIT_MASK                    0x40000000UL                                           /**< Bit mask for MODEM_INVRXBIT                 */
#define _MODEM_BCRDEMODCTRL_INVRXBIT_DEFAULT                 0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define MODEM_BCRDEMODCTRL_INVRXBIT_DEFAULT                  (_MODEM_BCRDEMODCTRL_INVRXBIT_DEFAULT << 30)           /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_PHSRCSEL                          (0x1UL << 31)                                          /**< PHSRCSEL                                    */
#define _MODEM_BCRDEMODCTRL_PHSRCSEL_SHIFT                   31                                                     /**< Shift value for MODEM_PHSRCSEL              */
#define _MODEM_BCRDEMODCTRL_PHSRCSEL_MASK                    0x80000000UL                                           /**< Bit mask for MODEM_PHSRCSEL                 */
#define _MODEM_BCRDEMODCTRL_PHSRCSEL_DEFAULT                 0x00000000UL                                           /**< Mode DEFAULT for MODEM_BCRDEMODCTRL         */
#define _MODEM_BCRDEMODCTRL_PHSRCSEL_OFF                     0x00000000UL                                           /**< Mode OFF for MODEM_BCRDEMODCTRL             */
#define _MODEM_BCRDEMODCTRL_PHSRCSEL_ON                      0x00000001UL                                           /**< Mode ON for MODEM_BCRDEMODCTRL              */
#define MODEM_BCRDEMODCTRL_PHSRCSEL_DEFAULT                  (_MODEM_BCRDEMODCTRL_PHSRCSEL_DEFAULT << 31)           /**< Shifted mode DEFAULT for MODEM_BCRDEMODCTRL */
#define MODEM_BCRDEMODCTRL_PHSRCSEL_OFF                      (_MODEM_BCRDEMODCTRL_PHSRCSEL_OFF << 31)               /**< Shifted mode OFF for MODEM_BCRDEMODCTRL     */
#define MODEM_BCRDEMODCTRL_PHSRCSEL_ON                       (_MODEM_BCRDEMODCTRL_PHSRCSEL_ON << 31)                /**< Shifted mode ON for MODEM_BCRDEMODCTRL      */

/* Bit fields for MODEM BCRDEMODOOK */
#define _MODEM_BCRDEMODOOK_RESETVALUE                        0x00A00C03UL                                       /**< Default value for MODEM_BCRDEMODOOK         */
#define _MODEM_BCRDEMODOOK_MASK                              0xFFFFFFEFUL                                       /**< Mask for MODEM_BCRDEMODOOK                  */
#define MODEM_BCRDEMODOOK_OOKFRZEN                           (0x1UL << 0)                                       /**< OOKFRZEN                                    */
#define _MODEM_BCRDEMODOOK_OOKFRZEN_SHIFT                    0                                                  /**< Shift value for MODEM_OOKFRZEN              */
#define _MODEM_BCRDEMODOOK_OOKFRZEN_MASK                     0x1UL                                              /**< Bit mask for MODEM_OOKFRZEN                 */
#define _MODEM_BCRDEMODOOK_OOKFRZEN_DEFAULT                  0x00000001UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define _MODEM_BCRDEMODOOK_OOKFRZEN_OFF                      0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODOOK              */
#define _MODEM_BCRDEMODOOK_OOKFRZEN_ON                       0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODOOK               */
#define MODEM_BCRDEMODOOK_OOKFRZEN_DEFAULT                   (_MODEM_BCRDEMODOOK_OOKFRZEN_DEFAULT << 0)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_OOKFRZEN_OFF                       (_MODEM_BCRDEMODOOK_OOKFRZEN_OFF << 0)             /**< Shifted mode OFF for MODEM_BCRDEMODOOK      */
#define MODEM_BCRDEMODOOK_OOKFRZEN_ON                        (_MODEM_BCRDEMODOOK_OOKFRZEN_ON << 0)              /**< Shifted mode ON for MODEM_BCRDEMODOOK       */
#define _MODEM_BCRDEMODOOK_RAWGAIN_SHIFT                     1                                                  /**< Shift value for MODEM_RAWGAIN               */
#define _MODEM_BCRDEMODOOK_RAWGAIN_MASK                      0x6UL                                              /**< Bit mask for MODEM_RAWGAIN                  */
#define _MODEM_BCRDEMODOOK_RAWGAIN_DEFAULT                   0x00000001UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define _MODEM_BCRDEMODOOK_RAWGAIN_rawgain_8                 0x00000000UL                                       /**< Mode rawgain_8 for MODEM_BCRDEMODOOK        */
#define _MODEM_BCRDEMODOOK_RAWGAIN_rawgain_4                 0x00000001UL                                       /**< Mode rawgain_4 for MODEM_BCRDEMODOOK        */
#define _MODEM_BCRDEMODOOK_RAWGAIN_rawgain_2                 0x00000002UL                                       /**< Mode rawgain_2 for MODEM_BCRDEMODOOK        */
#define _MODEM_BCRDEMODOOK_RAWGAIN_rawgain_1                 0x00000003UL                                       /**< Mode rawgain_1 for MODEM_BCRDEMODOOK        */
#define MODEM_BCRDEMODOOK_RAWGAIN_DEFAULT                    (_MODEM_BCRDEMODOOK_RAWGAIN_DEFAULT << 1)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_RAWGAIN_rawgain_8                  (_MODEM_BCRDEMODOOK_RAWGAIN_rawgain_8 << 1)        /**< Shifted mode rawgain_8 for MODEM_BCRDEMODOOK*/
#define MODEM_BCRDEMODOOK_RAWGAIN_rawgain_4                  (_MODEM_BCRDEMODOOK_RAWGAIN_rawgain_4 << 1)        /**< Shifted mode rawgain_4 for MODEM_BCRDEMODOOK*/
#define MODEM_BCRDEMODOOK_RAWGAIN_rawgain_2                  (_MODEM_BCRDEMODOOK_RAWGAIN_rawgain_2 << 1)        /**< Shifted mode rawgain_2 for MODEM_BCRDEMODOOK*/
#define MODEM_BCRDEMODOOK_RAWGAIN_rawgain_1                  (_MODEM_BCRDEMODOOK_RAWGAIN_rawgain_1 << 1)        /**< Shifted mode rawgain_1 for MODEM_BCRDEMODOOK*/
#define MODEM_BCRDEMODOOK_NOISEFLEST                         (0x1UL << 3)                                       /**< Noise Floore Estimation Enable              */
#define _MODEM_BCRDEMODOOK_NOISEFLEST_SHIFT                  3                                                  /**< Shift value for MODEM_NOISEFLEST            */
#define _MODEM_BCRDEMODOOK_NOISEFLEST_MASK                   0x8UL                                              /**< Bit mask for MODEM_NOISEFLEST               */
#define _MODEM_BCRDEMODOOK_NOISEFLEST_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_NOISEFLEST_DEFAULT                 (_MODEM_BCRDEMODOOK_NOISEFLEST_DEFAULT << 3)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_PKTRUNK                            (0x1UL << 5)                                       /**< New BitField                                */
#define _MODEM_BCRDEMODOOK_PKTRUNK_SHIFT                     5                                                  /**< Shift value for MODEM_PKTRUNK               */
#define _MODEM_BCRDEMODOOK_PKTRUNK_MASK                      0x20UL                                             /**< Bit mask for MODEM_PKTRUNK                  */
#define _MODEM_BCRDEMODOOK_PKTRUNK_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_PKTRUNK_DEFAULT                    (_MODEM_BCRDEMODOOK_PKTRUNK_DEFAULT << 5)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_MAFREQDWN                          (0x1UL << 6)                                       /**< MAFREQDWN                                   */
#define _MODEM_BCRDEMODOOK_MAFREQDWN_SHIFT                   6                                                  /**< Shift value for MODEM_MAFREQDWN             */
#define _MODEM_BCRDEMODOOK_MAFREQDWN_MASK                    0x40UL                                             /**< Bit mask for MODEM_MAFREQDWN                */
#define _MODEM_BCRDEMODOOK_MAFREQDWN_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define _MODEM_BCRDEMODOOK_MAFREQDWN_OFF                     0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODOOK              */
#define _MODEM_BCRDEMODOOK_MAFREQDWN_ON                      0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODOOK               */
#define MODEM_BCRDEMODOOK_MAFREQDWN_DEFAULT                  (_MODEM_BCRDEMODOOK_MAFREQDWN_DEFAULT << 6)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_MAFREQDWN_OFF                      (_MODEM_BCRDEMODOOK_MAFREQDWN_OFF << 6)            /**< Shifted mode OFF for MODEM_BCRDEMODOOK      */
#define MODEM_BCRDEMODOOK_MAFREQDWN_ON                       (_MODEM_BCRDEMODOOK_MAFREQDWN_ON << 6)             /**< Shifted mode ON for MODEM_BCRDEMODOOK       */
#define MODEM_BCRDEMODOOK_SQUELCLKEN                         (0x1UL << 7)                                       /**< Squelch bit clock enable                    */
#define _MODEM_BCRDEMODOOK_SQUELCLKEN_SHIFT                  7                                                  /**< Shift value for MODEM_SQUELCLKEN            */
#define _MODEM_BCRDEMODOOK_SQUELCLKEN_MASK                   0x80UL                                             /**< Bit mask for MODEM_SQUELCLKEN               */
#define _MODEM_BCRDEMODOOK_SQUELCLKEN_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_SQUELCLKEN_DEFAULT                 (_MODEM_BCRDEMODOOK_SQUELCLKEN_DEFAULT << 7)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_BWPK_SHIFT                        8                                                  /**< Shift value for MODEM_BWPK                  */
#define _MODEM_BCRDEMODOOK_BWPK_MASK                         0x1F00UL                                           /**< Bit mask for MODEM_BWPK                     */
#define _MODEM_BCRDEMODOOK_BWPK_DEFAULT                      0x0000000CUL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_BWPK_DEFAULT                       (_MODEM_BCRDEMODOOK_BWPK_DEFAULT << 8)             /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_ABPK_SHIFT                        13                                                 /**< Shift value for MODEM_ABPK                  */
#define _MODEM_BCRDEMODOOK_ABPK_MASK                         0xE000UL                                           /**< Bit mask for MODEM_ABPK                     */
#define _MODEM_BCRDEMODOOK_ABPK_DEFAULT                      0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_ABPK_DEFAULT                       (_MODEM_BCRDEMODOOK_ABPK_DEFAULT << 13)            /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_SHIFT                   16                                                 /**< Shift value for MODEM_DECAYSWAL             */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_MASK                    0x30000UL                                          /**< Bit mask for MODEM_DECAYSWAL                */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_swal0                   0x00000000UL                                       /**< Mode swal0 for MODEM_BCRDEMODOOK            */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_swal1                   0x00000001UL                                       /**< Mode swal1 for MODEM_BCRDEMODOOK            */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_swal2                   0x00000002UL                                       /**< Mode swal2 for MODEM_BCRDEMODOOK            */
#define _MODEM_BCRDEMODOOK_DECAYSWAL_swal3                   0x00000003UL                                       /**< Mode swal3 for MODEM_BCRDEMODOOK            */
#define MODEM_BCRDEMODOOK_DECAYSWAL_DEFAULT                  (_MODEM_BCRDEMODOOK_DECAYSWAL_DEFAULT << 16)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_DECAYSWAL_swal0                    (_MODEM_BCRDEMODOOK_DECAYSWAL_swal0 << 16)         /**< Shifted mode swal0 for MODEM_BCRDEMODOOK    */
#define MODEM_BCRDEMODOOK_DECAYSWAL_swal1                    (_MODEM_BCRDEMODOOK_DECAYSWAL_swal1 << 16)         /**< Shifted mode swal1 for MODEM_BCRDEMODOOK    */
#define MODEM_BCRDEMODOOK_DECAYSWAL_swal2                    (_MODEM_BCRDEMODOOK_DECAYSWAL_swal2 << 16)         /**< Shifted mode swal2 for MODEM_BCRDEMODOOK    */
#define MODEM_BCRDEMODOOK_DECAYSWAL_swal3                    (_MODEM_BCRDEMODOOK_DECAYSWAL_swal3 << 16)         /**< Shifted mode swal3 for MODEM_BCRDEMODOOK    */
#define _MODEM_BCRDEMODOOK_DECAY_SHIFT                       18                                                 /**< Shift value for MODEM_DECAY                 */
#define _MODEM_BCRDEMODOOK_DECAY_MASK                        0x3C0000UL                                         /**< Bit mask for MODEM_DECAY                    */
#define _MODEM_BCRDEMODOOK_DECAY_DEFAULT                     0x00000008UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_DECAY_DEFAULT                      (_MODEM_BCRDEMODOOK_DECAY_DEFAULT << 18)           /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_ATTACK_SHIFT                      22                                                 /**< Shift value for MODEM_ATTACK                */
#define _MODEM_BCRDEMODOOK_ATTACK_MASK                       0x1C00000UL                                        /**< Bit mask for MODEM_ATTACK                   */
#define _MODEM_BCRDEMODOOK_ATTACK_DEFAULT                    0x00000002UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_ATTACK_DEFAULT                     (_MODEM_BCRDEMODOOK_ATTACK_DEFAULT << 22)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define _MODEM_BCRDEMODOOK_SQUELCH_SHIFT                     25                                                 /**< Shift value for MODEM_SQUELCH               */
#define _MODEM_BCRDEMODOOK_SQUELCH_MASK                      0xE000000UL                                        /**< Bit mask for MODEM_SQUELCH                  */
#define _MODEM_BCRDEMODOOK_SQUELCH_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define _MODEM_BCRDEMODOOK_SQUELCH_squelch_off               0x00000000UL                                       /**< Mode squelch_off for MODEM_BCRDEMODOOK      */
#define _MODEM_BCRDEMODOOK_SQUELCH_squelch_rssi              0x00000001UL                                       /**< Mode squelch_rssi for MODEM_BCRDEMODOOK     */
#define _MODEM_BCRDEMODOOK_SQUELCH_squelch_pm                0x00000002UL                                       /**< Mode squelch_pm for MODEM_BCRDEMODOOK       */
#define _MODEM_BCRDEMODOOK_SQUELCH_squelch_pm_rssi           0x00000003UL                                       /**< Mode squelch_pm_rssi for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_SQUELCH_DEFAULT                    (_MODEM_BCRDEMODOOK_SQUELCH_DEFAULT << 25)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_SQUELCH_squelch_off                (_MODEM_BCRDEMODOOK_SQUELCH_squelch_off << 25)     /**< Shifted mode squelch_off for MODEM_BCRDEMODOOK*/
#define MODEM_BCRDEMODOOK_SQUELCH_squelch_rssi               (_MODEM_BCRDEMODOOK_SQUELCH_squelch_rssi << 25)    /**< Shifted mode squelch_rssi for MODEM_BCRDEMODOOK*/
#define MODEM_BCRDEMODOOK_SQUELCH_squelch_pm                 (_MODEM_BCRDEMODOOK_SQUELCH_squelch_pm << 25)      /**< Shifted mode squelch_pm for MODEM_BCRDEMODOOK*/
#define MODEM_BCRDEMODOOK_SQUELCH_squelch_pm_rssi            (_MODEM_BCRDEMODOOK_SQUELCH_squelch_pm_rssi << 25) /**< Shifted mode squelch_pm_rssi for MODEM_BCRDEMODOOK*/
#define _MODEM_BCRDEMODOOK_RAWNDEC_SHIFT                     28                                                 /**< Shift value for MODEM_RAWNDEC               */
#define _MODEM_BCRDEMODOOK_RAWNDEC_MASK                      0x70000000UL                                       /**< Bit mask for MODEM_RAWNDEC                  */
#define _MODEM_BCRDEMODOOK_RAWNDEC_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_RAWNDEC_DEFAULT                    (_MODEM_BCRDEMODOOK_RAWNDEC_DEFAULT << 28)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */
#define MODEM_BCRDEMODOOK_BCRDEMODOOK                        (0x1UL << 31)                                      /**< BCR Demod OOK enable                        */
#define _MODEM_BCRDEMODOOK_BCRDEMODOOK_SHIFT                 31                                                 /**< Shift value for MODEM_BCRDEMODOOK           */
#define _MODEM_BCRDEMODOOK_BCRDEMODOOK_MASK                  0x80000000UL                                       /**< Bit mask for MODEM_BCRDEMODOOK              */
#define _MODEM_BCRDEMODOOK_BCRDEMODOOK_DEFAULT               0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODOOK          */
#define MODEM_BCRDEMODOOK_BCRDEMODOOK_DEFAULT                (_MODEM_BCRDEMODOOK_BCRDEMODOOK_DEFAULT << 31)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODOOK  */

