SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM BCRDEMODAFC0 */
#define _MODEM_BCRDEMODAFC0_RESETVALUE                       0x40000000UL                                      /**< Default value for MODEM_BCRDEMODAFC0        */
#define _MODEM_BCRDEMODAFC0_MASK                             0xE000807FUL                                      /**< Mask for MODEM_BCRDEMODAFC0                 */
#define _MODEM_BCRDEMODAFC0_ZEROOFF_SHIFT                    0                                                 /**< Shift value for MODEM_ZEROOFF               */
#define _MODEM_BCRDEMODAFC0_ZEROOFF_MASK                     0x7FUL                                            /**< Bit mask for MODEM_ZEROOFF                  */
#define _MODEM_BCRDEMODAFC0_ZEROOFF_DEFAULT                  0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define MODEM_BCRDEMODAFC0_ZEROOFF_DEFAULT                   (_MODEM_BCRDEMODAFC0_ZEROOFF_DEFAULT << 0)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_LARGEFREQERR                      (0x1UL << 15)                                     /**< LARGEFREQERR                                */
#define _MODEM_BCRDEMODAFC0_LARGEFREQERR_SHIFT               15                                                /**< Shift value for MODEM_LARGEFREQERR          */
#define _MODEM_BCRDEMODAFC0_LARGEFREQERR_MASK                0x8000UL                                          /**< Bit mask for MODEM_LARGEFREQERR             */
#define _MODEM_BCRDEMODAFC0_LARGEFREQERR_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define MODEM_BCRDEMODAFC0_LARGEFREQERR_DEFAULT              (_MODEM_BCRDEMODAFC0_LARGEFREQERR_DEFAULT << 15)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_AFCGAINOVRFLW                     (0x1UL << 29)                                     /**< AFCGAINOVRFLW                               */
#define _MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_SHIFT              29                                                /**< Shift value for MODEM_AFCGAINOVRFLW         */
#define _MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_MASK               0x20000000UL                                      /**< Bit mask for MODEM_AFCGAINOVRFLW            */
#define _MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_DEFAULT             (_MODEM_BCRDEMODAFC0_AFCGAINOVRFLW_DEFAULT << 29) /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_EN2TBEST                          (0x1UL << 30)                                     /**< EN2TBEST                                    */
#define _MODEM_BCRDEMODAFC0_EN2TBEST_SHIFT                   30                                                /**< Shift value for MODEM_EN2TBEST              */
#define _MODEM_BCRDEMODAFC0_EN2TBEST_MASK                    0x40000000UL                                      /**< Bit mask for MODEM_EN2TBEST                 */
#define _MODEM_BCRDEMODAFC0_EN2TBEST_DEFAULT                 0x00000001UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define _MODEM_BCRDEMODAFC0_EN2TBEST_OFF                     0x00000000UL                                      /**< Mode OFF for MODEM_BCRDEMODAFC0             */
#define _MODEM_BCRDEMODAFC0_EN2TBEST_ON                      0x00000001UL                                      /**< Mode ON for MODEM_BCRDEMODAFC0              */
#define MODEM_BCRDEMODAFC0_EN2TBEST_DEFAULT                  (_MODEM_BCRDEMODAFC0_EN2TBEST_DEFAULT << 30)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_EN2TBEST_OFF                      (_MODEM_BCRDEMODAFC0_EN2TBEST_OFF << 30)          /**< Shifted mode OFF for MODEM_BCRDEMODAFC0     */
#define MODEM_BCRDEMODAFC0_EN2TBEST_ON                       (_MODEM_BCRDEMODAFC0_EN2TBEST_ON << 30)           /**< Shifted mode ON for MODEM_BCRDEMODAFC0      */
#define MODEM_BCRDEMODAFC0_ENAFCCLKSW                        (0x1UL << 31)                                     /**< ENAFCCLKSW                                  */
#define _MODEM_BCRDEMODAFC0_ENAFCCLKSW_SHIFT                 31                                                /**< Shift value for MODEM_ENAFCCLKSW            */
#define _MODEM_BCRDEMODAFC0_ENAFCCLKSW_MASK                  0x80000000UL                                      /**< Bit mask for MODEM_ENAFCCLKSW               */
#define _MODEM_BCRDEMODAFC0_ENAFCCLKSW_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODAFC0         */
#define _MODEM_BCRDEMODAFC0_ENAFCCLKSW_OFF                   0x00000000UL                                      /**< Mode OFF for MODEM_BCRDEMODAFC0             */
#define _MODEM_BCRDEMODAFC0_ENAFCCLKSW_ON                    0x00000001UL                                      /**< Mode ON for MODEM_BCRDEMODAFC0              */
#define MODEM_BCRDEMODAFC0_ENAFCCLKSW_DEFAULT                (_MODEM_BCRDEMODAFC0_ENAFCCLKSW_DEFAULT << 31)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC0 */
#define MODEM_BCRDEMODAFC0_ENAFCCLKSW_OFF                    (_MODEM_BCRDEMODAFC0_ENAFCCLKSW_OFF << 31)        /**< Shifted mode OFF for MODEM_BCRDEMODAFC0     */
#define MODEM_BCRDEMODAFC0_ENAFCCLKSW_ON                     (_MODEM_BCRDEMODAFC0_ENAFCCLKSW_ON << 31)         /**< Shifted mode ON for MODEM_BCRDEMODAFC0      */

/* Bit fields for MODEM BCRDEMODAFC1 */
#define _MODEM_BCRDEMODAFC1_RESETVALUE                       0x10100012UL                                       /**< Default value for MODEM_BCRDEMODAFC1        */
#define _MODEM_BCRDEMODAFC1_MASK                             0xFFFCC0FFUL                                       /**< Mask for MODEM_BCRDEMODAFC1                 */
#define _MODEM_BCRDEMODAFC1_LGWAIT_SHIFT                     0                                                  /**< Shift value for MODEM_LGWAIT                */
#define _MODEM_BCRDEMODAFC1_LGWAIT_MASK                      0xFUL                                              /**< Bit mask for MODEM_LGWAIT                   */
#define _MODEM_BCRDEMODAFC1_LGWAIT_DEFAULT                   0x00000002UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define MODEM_BCRDEMODAFC1_LGWAIT_DEFAULT                    (_MODEM_BCRDEMODAFC1_LGWAIT_DEFAULT << 0)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define _MODEM_BCRDEMODAFC1_SHWAIT_SHIFT                     4                                                  /**< Shift value for MODEM_SHWAIT                */
#define _MODEM_BCRDEMODAFC1_SHWAIT_MASK                      0xF0UL                                             /**< Bit mask for MODEM_SHWAIT                   */
#define _MODEM_BCRDEMODAFC1_SHWAIT_DEFAULT                   0x00000001UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define MODEM_BCRDEMODAFC1_SHWAIT_DEFAULT                    (_MODEM_BCRDEMODAFC1_SHWAIT_DEFAULT << 4)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define _MODEM_BCRDEMODAFC1_GEARSW_SHIFT                     14                                                 /**< Shift value for MODEM_GEARSW                */
#define _MODEM_BCRDEMODAFC1_GEARSW_MASK                      0xC000UL                                           /**< Bit mask for MODEM_GEARSW                   */
#define _MODEM_BCRDEMODAFC1_GEARSW_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_pm                0x00000000UL                                       /**< Mode Gear_sw_pm for MODEM_BCRDEMODAFC1      */
#define _MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_sync              0x00000001UL                                       /**< Mode Gear_sw_sync for MODEM_BCRDEMODAFC1    */
#define _MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_arr               0x00000002UL                                       /**< Mode Gear_sw_arr for MODEM_BCRDEMODAFC1     */
#define _MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_pm1               0x00000003UL                                       /**< Mode Gear_sw_pm1 for MODEM_BCRDEMODAFC1     */
#define MODEM_BCRDEMODAFC1_GEARSW_DEFAULT                    (_MODEM_BCRDEMODAFC1_GEARSW_DEFAULT << 14)         /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_pm                 (_MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_pm << 14)      /**< Shifted mode Gear_sw_pm for MODEM_BCRDEMODAFC1*/
#define MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_sync               (_MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_sync << 14)    /**< Shifted mode Gear_sw_sync for MODEM_BCRDEMODAFC1*/
#define MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_arr                (_MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_arr << 14)     /**< Shifted mode Gear_sw_arr for MODEM_BCRDEMODAFC1*/
#define MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_pm1                (_MODEM_BCRDEMODAFC1_GEARSW_Gear_sw_pm1 << 14)     /**< Shifted mode Gear_sw_pm1 for MODEM_BCRDEMODAFC1*/
#define MODEM_BCRDEMODAFC1_AFCMAEN                           (0x1UL << 18)                                      /**< AFCMAEN                                     */
#define _MODEM_BCRDEMODAFC1_AFCMAEN_SHIFT                    18                                                 /**< Shift value for MODEM_AFCMAEN               */
#define _MODEM_BCRDEMODAFC1_AFCMAEN_MASK                     0x40000UL                                          /**< Bit mask for MODEM_AFCMAEN                  */
#define _MODEM_BCRDEMODAFC1_AFCMAEN_DEFAULT                  0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_AFCMAEN_OFF                      0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODAFC1             */
#define _MODEM_BCRDEMODAFC1_AFCMAEN_ON                       0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODAFC1              */
#define MODEM_BCRDEMODAFC1_AFCMAEN_DEFAULT                   (_MODEM_BCRDEMODAFC1_AFCMAEN_DEFAULT << 18)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_AFCMAEN_OFF                       (_MODEM_BCRDEMODAFC1_AFCMAEN_OFF << 18)            /**< Shifted mode OFF for MODEM_BCRDEMODAFC1     */
#define MODEM_BCRDEMODAFC1_AFCMAEN_ON                        (_MODEM_BCRDEMODAFC1_AFCMAEN_ON << 18)             /**< Shifted mode ON for MODEM_BCRDEMODAFC1      */
#define MODEM_BCRDEMODAFC1_ENFZPMEND                         (0x1UL << 19)                                      /**< ENFZPMEND                                   */
#define _MODEM_BCRDEMODAFC1_ENFZPMEND_SHIFT                  19                                                 /**< Shift value for MODEM_ENFZPMEND             */
#define _MODEM_BCRDEMODAFC1_ENFZPMEND_MASK                   0x80000UL                                          /**< Bit mask for MODEM_ENFZPMEND                */
#define _MODEM_BCRDEMODAFC1_ENFZPMEND_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_ENFZPMEND_OFF                    0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODAFC1             */
#define _MODEM_BCRDEMODAFC1_ENFZPMEND_ON                     0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODAFC1              */
#define MODEM_BCRDEMODAFC1_ENFZPMEND_DEFAULT                 (_MODEM_BCRDEMODAFC1_ENFZPMEND_DEFAULT << 19)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_ENFZPMEND_OFF                     (_MODEM_BCRDEMODAFC1_ENFZPMEND_OFF << 19)          /**< Shifted mode OFF for MODEM_BCRDEMODAFC1     */
#define MODEM_BCRDEMODAFC1_ENFZPMEND_ON                      (_MODEM_BCRDEMODAFC1_ENFZPMEND_ON << 19)           /**< Shifted mode ON for MODEM_BCRDEMODAFC1      */
#define MODEM_BCRDEMODAFC1_NONFRZEN                          (0x1UL << 20)                                      /**< NONFRZEN                                    */
#define _MODEM_BCRDEMODAFC1_NONFRZEN_SHIFT                   20                                                 /**< Shift value for MODEM_NONFRZEN              */
#define _MODEM_BCRDEMODAFC1_NONFRZEN_MASK                    0x100000UL                                         /**< Bit mask for MODEM_NONFRZEN                 */
#define _MODEM_BCRDEMODAFC1_NONFRZEN_DEFAULT                 0x00000001UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_NONFRZEN_ON                      0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODAFC1              */
#define MODEM_BCRDEMODAFC1_NONFRZEN_DEFAULT                  (_MODEM_BCRDEMODAFC1_NONFRZEN_DEFAULT << 20)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_NONFRZEN_ON                       (_MODEM_BCRDEMODAFC1_NONFRZEN_ON << 20)            /**< Shifted mode ON for MODEM_BCRDEMODAFC1      */
#define _MODEM_BCRDEMODAFC1_ONESHOTWAITCNT_SHIFT             21                                                 /**< Shift value for MODEM_ONESHOTWAITCNT        */
#define _MODEM_BCRDEMODAFC1_ONESHOTWAITCNT_MASK              0x1E00000UL                                        /**< Bit mask for MODEM_ONESHOTWAITCNT           */
#define _MODEM_BCRDEMODAFC1_ONESHOTWAITCNT_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define MODEM_BCRDEMODAFC1_ONESHOTWAITCNT_DEFAULT            (_MODEM_BCRDEMODAFC1_ONESHOTWAITCNT_DEFAULT << 21) /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_ONESHOTAFCEN                      (0x1UL << 25)                                      /**< ONESHOTAFCEN                                */
#define _MODEM_BCRDEMODAFC1_ONESHOTAFCEN_SHIFT               25                                                 /**< Shift value for MODEM_ONESHOTAFCEN          */
#define _MODEM_BCRDEMODAFC1_ONESHOTAFCEN_MASK                0x2000000UL                                        /**< Bit mask for MODEM_ONESHOTAFCEN             */
#define _MODEM_BCRDEMODAFC1_ONESHOTAFCEN_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_ONESHOTAFCEN_OFF                 0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODAFC1             */
#define _MODEM_BCRDEMODAFC1_ONESHOTAFCEN_ON                  0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODAFC1              */
#define MODEM_BCRDEMODAFC1_ONESHOTAFCEN_DEFAULT              (_MODEM_BCRDEMODAFC1_ONESHOTAFCEN_DEFAULT << 25)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_ONESHOTAFCEN_OFF                  (_MODEM_BCRDEMODAFC1_ONESHOTAFCEN_OFF << 25)       /**< Shifted mode OFF for MODEM_BCRDEMODAFC1     */
#define MODEM_BCRDEMODAFC1_ONESHOTAFCEN_ON                   (_MODEM_BCRDEMODAFC1_ONESHOTAFCEN_ON << 25)        /**< Shifted mode ON for MODEM_BCRDEMODAFC1      */
#define MODEM_BCRDEMODAFC1_SKIPPMDET                         (0x1UL << 26)                                      /**< SKIPPMDET                                   */
#define _MODEM_BCRDEMODAFC1_SKIPPMDET_SHIFT                  26                                                 /**< Shift value for MODEM_SKIPPMDET             */
#define _MODEM_BCRDEMODAFC1_SKIPPMDET_MASK                   0x4000000UL                                        /**< Bit mask for MODEM_SKIPPMDET                */
#define _MODEM_BCRDEMODAFC1_SKIPPMDET_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define MODEM_BCRDEMODAFC1_SKIPPMDET_DEFAULT                 (_MODEM_BCRDEMODAFC1_SKIPPMDET_DEFAULT << 26)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_PMRSTEN                           (0x1UL << 27)                                      /**< PM RST Enable                               */
#define _MODEM_BCRDEMODAFC1_PMRSTEN_SHIFT                    27                                                 /**< Shift value for MODEM_PMRSTEN               */
#define _MODEM_BCRDEMODAFC1_PMRSTEN_MASK                     0x8000000UL                                        /**< Bit mask for MODEM_PMRSTEN                  */
#define _MODEM_BCRDEMODAFC1_PMRSTEN_DEFAULT                  0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define MODEM_BCRDEMODAFC1_PMRSTEN_DEFAULT                   (_MODEM_BCRDEMODAFC1_PMRSTEN_DEFAULT << 27)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_ENAFCFRZ                          (0x1UL << 28)                                      /**< ENAFCFRZ                                    */
#define _MODEM_BCRDEMODAFC1_ENAFCFRZ_SHIFT                   28                                                 /**< Shift value for MODEM_ENAFCFRZ              */
#define _MODEM_BCRDEMODAFC1_ENAFCFRZ_MASK                    0x10000000UL                                       /**< Bit mask for MODEM_ENAFCFRZ                 */
#define _MODEM_BCRDEMODAFC1_ENAFCFRZ_DEFAULT                 0x00000001UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_ENAFCFRZ_OFF                     0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODAFC1             */
#define _MODEM_BCRDEMODAFC1_ENAFCFRZ_ON                      0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODAFC1              */
#define MODEM_BCRDEMODAFC1_ENAFCFRZ_DEFAULT                  (_MODEM_BCRDEMODAFC1_ENAFCFRZ_DEFAULT << 28)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_ENAFCFRZ_OFF                      (_MODEM_BCRDEMODAFC1_ENAFCFRZ_OFF << 28)           /**< Shifted mode OFF for MODEM_BCRDEMODAFC1     */
#define MODEM_BCRDEMODAFC1_ENAFCFRZ_ON                       (_MODEM_BCRDEMODAFC1_ENAFCFRZ_ON << 28)            /**< Shifted mode ON for MODEM_BCRDEMODAFC1      */
#define MODEM_BCRDEMODAFC1_HALFPHCOMP                        (0x1UL << 29)                                      /**< HALFPHCOMP                                  */
#define _MODEM_BCRDEMODAFC1_HALFPHCOMP_SHIFT                 29                                                 /**< Shift value for MODEM_HALFPHCOMP            */
#define _MODEM_BCRDEMODAFC1_HALFPHCOMP_MASK                  0x20000000UL                                       /**< Bit mask for MODEM_HALFPHCOMP               */
#define _MODEM_BCRDEMODAFC1_HALFPHCOMP_DEFAULT               0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_HALFPHCOMP_OFF                   0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODAFC1             */
#define _MODEM_BCRDEMODAFC1_HALFPHCOMP_ON                    0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODAFC1              */
#define MODEM_BCRDEMODAFC1_HALFPHCOMP_DEFAULT                (_MODEM_BCRDEMODAFC1_HALFPHCOMP_DEFAULT << 29)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_HALFPHCOMP_OFF                    (_MODEM_BCRDEMODAFC1_HALFPHCOMP_OFF << 29)         /**< Shifted mode OFF for MODEM_BCRDEMODAFC1     */
#define MODEM_BCRDEMODAFC1_HALFPHCOMP_ON                     (_MODEM_BCRDEMODAFC1_HALFPHCOMP_ON << 29)          /**< Shifted mode ON for MODEM_BCRDEMODAFC1      */
#define MODEM_BCRDEMODAFC1_ENAFC                             (0x1UL << 30)                                      /**< ENAFC                                       */
#define _MODEM_BCRDEMODAFC1_ENAFC_SHIFT                      30                                                 /**< Shift value for MODEM_ENAFC                 */
#define _MODEM_BCRDEMODAFC1_ENAFC_MASK                       0x40000000UL                                       /**< Bit mask for MODEM_ENAFC                    */
#define _MODEM_BCRDEMODAFC1_ENAFC_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_ENAFC_OFF                        0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODAFC1             */
#define _MODEM_BCRDEMODAFC1_ENAFC_ON                         0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODAFC1              */
#define MODEM_BCRDEMODAFC1_ENAFC_DEFAULT                     (_MODEM_BCRDEMODAFC1_ENAFC_DEFAULT << 30)          /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_ENAFC_OFF                         (_MODEM_BCRDEMODAFC1_ENAFC_OFF << 30)              /**< Shifted mode OFF for MODEM_BCRDEMODAFC1     */
#define MODEM_BCRDEMODAFC1_ENAFC_ON                          (_MODEM_BCRDEMODAFC1_ENAFC_ON << 30)               /**< Shifted mode ON for MODEM_BCRDEMODAFC1      */
#define MODEM_BCRDEMODAFC1_ENFBPLL                           (0x1UL << 31)                                      /**< ENFBPLL                                     */
#define _MODEM_BCRDEMODAFC1_ENFBPLL_SHIFT                    31                                                 /**< Shift value for MODEM_ENFBPLL               */
#define _MODEM_BCRDEMODAFC1_ENFBPLL_MASK                     0x80000000UL                                       /**< Bit mask for MODEM_ENFBPLL                  */
#define _MODEM_BCRDEMODAFC1_ENFBPLL_DEFAULT                  0x00000000UL                                       /**< Mode DEFAULT for MODEM_BCRDEMODAFC1         */
#define _MODEM_BCRDEMODAFC1_ENFBPLL_OFF                      0x00000000UL                                       /**< Mode OFF for MODEM_BCRDEMODAFC1             */
#define _MODEM_BCRDEMODAFC1_ENFBPLL_ON                       0x00000001UL                                       /**< Mode ON for MODEM_BCRDEMODAFC1              */
#define MODEM_BCRDEMODAFC1_ENFBPLL_DEFAULT                   (_MODEM_BCRDEMODAFC1_ENFBPLL_DEFAULT << 31)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODAFC1 */
#define MODEM_BCRDEMODAFC1_ENFBPLL_OFF                       (_MODEM_BCRDEMODAFC1_ENFBPLL_OFF << 31)            /**< Shifted mode OFF for MODEM_BCRDEMODAFC1     */
#define MODEM_BCRDEMODAFC1_ENFBPLL_ON                        (_MODEM_BCRDEMODAFC1_ENFBPLL_ON << 31)             /**< Shifted mode ON for MODEM_BCRDEMODAFC1      */

