SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM BCRDEMODRSSI */
#define _MODEM_BCRDEMODRSSI_RESETVALUE                       0x60000020UL                                    /**< Default value for MODEM_BCRDEMODRSSI        */
#define _MODEM_BCRDEMODRSSI_MASK                             0xFE001DFFUL                                    /**< Mask for MODEM_BCRDEMODRSSI                 */
#define _MODEM_BCRDEMODRSSI_RSSIARRTHD_SHIFT                 0                                               /**< Shift value for MODEM_RSSIARRTHD            */
#define _MODEM_BCRDEMODRSSI_RSSIARRTHD_MASK                  0xFFUL                                          /**< Bit mask for MODEM_RSSIARRTHD               */
#define _MODEM_BCRDEMODRSSI_RSSIARRTHD_DEFAULT               0x00000020UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODRSSI         */
#define MODEM_BCRDEMODRSSI_RSSIARRTHD_DEFAULT                (_MODEM_BCRDEMODRSSI_RSSIARRTHD_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODRSSI */
#define MODEM_BCRDEMODRSSI_RSSIMATAP                         (0x1UL << 8)                                    /**< RSSIMATAP                                   */
#define _MODEM_BCRDEMODRSSI_RSSIMATAP_SHIFT                  8                                               /**< Shift value for MODEM_RSSIMATAP             */
#define _MODEM_BCRDEMODRSSI_RSSIMATAP_MASK                   0x100UL                                         /**< Bit mask for MODEM_RSSIMATAP                */
#define _MODEM_BCRDEMODRSSI_RSSIMATAP_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODRSSI         */
#define _MODEM_BCRDEMODRSSI_RSSIMATAP_OFF                    0x00000000UL                                    /**< Mode OFF for MODEM_BCRDEMODRSSI             */
#define _MODEM_BCRDEMODRSSI_RSSIMATAP_ON                     0x00000001UL                                    /**< Mode ON for MODEM_BCRDEMODRSSI              */
#define MODEM_BCRDEMODRSSI_RSSIMATAP_DEFAULT                 (_MODEM_BCRDEMODRSSI_RSSIMATAP_DEFAULT << 8)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODRSSI */
#define MODEM_BCRDEMODRSSI_RSSIMATAP_OFF                     (_MODEM_BCRDEMODRSSI_RSSIMATAP_OFF << 8)        /**< Shifted mode OFF for MODEM_BCRDEMODRSSI     */
#define MODEM_BCRDEMODRSSI_RSSIMATAP_ON                      (_MODEM_BCRDEMODRSSI_RSSIMATAP_ON << 8)         /**< Shifted mode ON for MODEM_BCRDEMODRSSI      */
#define _MODEM_BCRDEMODRSSI_MUTERSSICNT_SHIFT                10                                              /**< Shift value for MODEM_MUTERSSICNT           */
#define _MODEM_BCRDEMODRSSI_MUTERSSICNT_MASK                 0x1C00UL                                        /**< Bit mask for MODEM_MUTERSSICNT              */
#define _MODEM_BCRDEMODRSSI_MUTERSSICNT_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODRSSI         */
#define MODEM_BCRDEMODRSSI_MUTERSSICNT_DEFAULT               (_MODEM_BCRDEMODRSSI_MUTERSSICNT_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_BCRDEMODRSSI */
#define _MODEM_BCRDEMODRSSI_PRWOFFSET_SHIFT                  25                                              /**< Shift value for MODEM_PRWOFFSET             */
#define _MODEM_BCRDEMODRSSI_PRWOFFSET_MASK                   0xFE000000UL                                    /**< Bit mask for MODEM_PRWOFFSET                */
#define _MODEM_BCRDEMODRSSI_PRWOFFSET_DEFAULT                0x00000030UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODRSSI         */
#define MODEM_BCRDEMODRSSI_PRWOFFSET_DEFAULT                 (_MODEM_BCRDEMODRSSI_PRWOFFSET_DEFAULT << 25)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODRSSI */

/* Bit fields for MODEM BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_RESETVALUE                       0x00600026UL                                      /**< Default value for MODEM_BCRDEMODARR0        */
#define _MODEM_BCRDEMODARR0_MASK                             0xFFFFFFFFUL                                      /**< Mask for MODEM_BCRDEMODARR0                 */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_SHIFT                   0                                                 /**< Shift value for MODEM_SCHPRDLO              */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_MASK                    0x7UL                                             /**< Bit mask for MODEM_SCHPRDLO                 */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_DEFAULT                 0x00000006UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_2Tb            0x00000000UL                                      /**< Mode schprd_l_2Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_3Tb            0x00000001UL                                      /**< Mode schprd_l_3Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_4Tb            0x00000002UL                                      /**< Mode schprd_l_4Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_5Tb            0x00000003UL                                      /**< Mode schprd_l_5Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_8Tb            0x00000004UL                                      /**< Mode schprd_l_8Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_12Tb           0x00000005UL                                      /**< Mode schprd_l_12Tb for MODEM_BCRDEMODARR0   */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_14Tb           0x00000006UL                                      /**< Mode schprd_l_14Tb for MODEM_BCRDEMODARR0   */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_16Tb           0x00000007UL                                      /**< Mode schprd_l_16Tb for MODEM_BCRDEMODARR0   */
#define MODEM_BCRDEMODARR0_SCHPRDLO_DEFAULT                  (_MODEM_BCRDEMODARR0_SCHPRDLO_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_2Tb             (_MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_2Tb << 0)  /**< Shifted mode schprd_l_2Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_3Tb             (_MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_3Tb << 0)  /**< Shifted mode schprd_l_3Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_4Tb             (_MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_4Tb << 0)  /**< Shifted mode schprd_l_4Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_5Tb             (_MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_5Tb << 0)  /**< Shifted mode schprd_l_5Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_8Tb             (_MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_8Tb << 0)  /**< Shifted mode schprd_l_8Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_12Tb            (_MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_12Tb << 0) /**< Shifted mode schprd_l_12Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_14Tb            (_MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_14Tb << 0) /**< Shifted mode schprd_l_14Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_16Tb            (_MODEM_BCRDEMODARR0_SCHPRDLO_schprd_l_16Tb << 0) /**< Shifted mode schprd_l_16Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_EYEQUALEN                         (0x1UL << 3)                                      /**< EYEQUALEN                                   */
#define _MODEM_BCRDEMODARR0_EYEQUALEN_SHIFT                  3                                                 /**< Shift value for MODEM_EYEQUALEN             */
#define _MODEM_BCRDEMODARR0_EYEQUALEN_MASK                   0x8UL                                             /**< Bit mask for MODEM_EYEQUALEN                */
#define _MODEM_BCRDEMODARR0_EYEQUALEN_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define _MODEM_BCRDEMODARR0_EYEQUALEN_OFF                    0x00000000UL                                      /**< Mode OFF for MODEM_BCRDEMODARR0             */
#define _MODEM_BCRDEMODARR0_EYEQUALEN_ON                     0x00000001UL                                      /**< Mode ON for MODEM_BCRDEMODARR0              */
#define MODEM_BCRDEMODARR0_EYEQUALEN_DEFAULT                 (_MODEM_BCRDEMODARR0_EYEQUALEN_DEFAULT << 3)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_EYEQUALEN_OFF                     (_MODEM_BCRDEMODARR0_EYEQUALEN_OFF << 3)          /**< Shifted mode OFF for MODEM_BCRDEMODARR0     */
#define MODEM_BCRDEMODARR0_EYEQUALEN_ON                      (_MODEM_BCRDEMODARR0_EYEQUALEN_ON << 3)           /**< Shifted mode ON for MODEM_BCRDEMODARR0      */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_SHIFT                   4                                                 /**< Shift value for MODEM_SCHPRDHI              */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_MASK                    0x70UL                                            /**< Bit mask for MODEM_SCHPRDHI                 */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_DEFAULT                 0x00000002UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_2Tb            0x00000000UL                                      /**< Mode schprd_h_2Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_3Tb            0x00000001UL                                      /**< Mode schprd_h_3Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_4Tb            0x00000002UL                                      /**< Mode schprd_h_4Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_5Tb            0x00000003UL                                      /**< Mode schprd_h_5Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_8Tb            0x00000004UL                                      /**< Mode schprd_h_8Tb for MODEM_BCRDEMODARR0    */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_12Tb           0x00000005UL                                      /**< Mode schprd_h_12Tb for MODEM_BCRDEMODARR0   */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_14Tb           0x00000006UL                                      /**< Mode schprd_h_14Tb for MODEM_BCRDEMODARR0   */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_16Tb           0x00000007UL                                      /**< Mode schprd_h_16Tb for MODEM_BCRDEMODARR0   */
#define MODEM_BCRDEMODARR0_SCHPRDHI_DEFAULT                  (_MODEM_BCRDEMODARR0_SCHPRDHI_DEFAULT << 4)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_2Tb             (_MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_2Tb << 4)  /**< Shifted mode schprd_h_2Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_3Tb             (_MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_3Tb << 4)  /**< Shifted mode schprd_h_3Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_4Tb             (_MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_4Tb << 4)  /**< Shifted mode schprd_h_4Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_5Tb             (_MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_5Tb << 4)  /**< Shifted mode schprd_h_5Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_8Tb             (_MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_8Tb << 4)  /**< Shifted mode schprd_h_8Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_12Tb            (_MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_12Tb << 4) /**< Shifted mode schprd_h_12Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_14Tb            (_MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_14Tb << 4) /**< Shifted mode schprd_h_14Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_16Tb            (_MODEM_BCRDEMODARR0_SCHPRDHI_schprd_h_16Tb << 4) /**< Shifted mode schprd_h_16Tb for MODEM_BCRDEMODARR0*/
#define MODEM_BCRDEMODARR0_ARRRSTEN                          (0x1UL << 7)                                      /**< ARRRSTEN                                    */
#define _MODEM_BCRDEMODARR0_ARRRSTEN_SHIFT                   7                                                 /**< Shift value for MODEM_ARRRSTEN              */
#define _MODEM_BCRDEMODARR0_ARRRSTEN_MASK                    0x80UL                                            /**< Bit mask for MODEM_ARRRSTEN                 */
#define _MODEM_BCRDEMODARR0_ARRRSTEN_DEFAULT                 0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRRSTEN_DEFAULT                  (_MODEM_BCRDEMODARR0_ARRRSTEN_DEFAULT << 7)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_ARRTOLER_SHIFT                   8                                                 /**< Shift value for MODEM_ARRTOLER              */
#define _MODEM_BCRDEMODARR0_ARRTOLER_MASK                    0x1F00UL                                          /**< Bit mask for MODEM_ARRTOLER                 */
#define _MODEM_BCRDEMODARR0_ARRTOLER_DEFAULT                 0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRTOLER_DEFAULT                  (_MODEM_BCRDEMODARR0_ARRTOLER_DEFAULT << 8)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_DIFF0RSTEN                        (0x1UL << 13)                                     /**< DIFF0RSTEN                                  */
#define _MODEM_BCRDEMODARR0_DIFF0RSTEN_SHIFT                 13                                                /**< Shift value for MODEM_DIFF0RSTEN            */
#define _MODEM_BCRDEMODARR0_DIFF0RSTEN_MASK                  0x2000UL                                          /**< Bit mask for MODEM_DIFF0RSTEN               */
#define _MODEM_BCRDEMODARR0_DIFF0RSTEN_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_DIFF0RSTEN_DEFAULT                (_MODEM_BCRDEMODARR0_DIFF0RSTEN_DEFAULT << 13)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_PHSPIKETHD_SHIFT                 14                                                /**< Shift value for MODEM_PHSPIKETHD            */
#define _MODEM_BCRDEMODARR0_PHSPIKETHD_MASK                  0x1FC000UL                                        /**< Bit mask for MODEM_PHSPIKETHD               */
#define _MODEM_BCRDEMODARR0_PHSPIKETHD_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_PHSPIKETHD_DEFAULT                (_MODEM_BCRDEMODARR0_PHSPIKETHD_DEFAULT << 14)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_ARRDETTHD_SHIFT                  21                                                /**< Shift value for MODEM_ARRDETTHD             */
#define _MODEM_BCRDEMODARR0_ARRDETTHD_MASK                   0x1E00000UL                                       /**< Bit mask for MODEM_ARRDETTHD                */
#define _MODEM_BCRDEMODARR0_ARRDETTHD_DEFAULT                0x00000003UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRDETTHD_DEFAULT                 (_MODEM_BCRDEMODARR0_ARRDETTHD_DEFAULT << 21)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_SCHFRZEN                          (0x1UL << 25)                                     /**< SCHFRZEN                                    */
#define _MODEM_BCRDEMODARR0_SCHFRZEN_SHIFT                   25                                                /**< Shift value for MODEM_SCHFRZEN              */
#define _MODEM_BCRDEMODARR0_SCHFRZEN_MASK                    0x2000000UL                                       /**< Bit mask for MODEM_SCHFRZEN                 */
#define _MODEM_BCRDEMODARR0_SCHFRZEN_DEFAULT                 0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define _MODEM_BCRDEMODARR0_SCHFRZEN_OFF                     0x00000000UL                                      /**< Mode OFF for MODEM_BCRDEMODARR0             */
#define _MODEM_BCRDEMODARR0_SCHFRZEN_ON                      0x00000001UL                                      /**< Mode ON for MODEM_BCRDEMODARR0              */
#define MODEM_BCRDEMODARR0_SCHFRZEN_DEFAULT                  (_MODEM_BCRDEMODARR0_SCHFRZEN_DEFAULT << 25)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_SCHFRZEN_OFF                      (_MODEM_BCRDEMODARR0_SCHFRZEN_OFF << 25)          /**< Shifted mode OFF for MODEM_BCRDEMODARR0     */
#define MODEM_BCRDEMODARR0_SCHFRZEN_ON                       (_MODEM_BCRDEMODARR0_SCHFRZEN_ON << 25)           /**< Shifted mode ON for MODEM_BCRDEMODARR0      */
#define MODEM_BCRDEMODARR0_EYEXESTEN                         (0x1UL << 26)                                     /**< EYEXESTEN                                   */
#define _MODEM_BCRDEMODARR0_EYEXESTEN_SHIFT                  26                                                /**< Shift value for MODEM_EYEXESTEN             */
#define _MODEM_BCRDEMODARR0_EYEXESTEN_MASK                   0x4000000UL                                       /**< Bit mask for MODEM_EYEXESTEN                */
#define _MODEM_BCRDEMODARR0_EYEXESTEN_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_EYEXESTEN_DEFAULT                 (_MODEM_BCRDEMODARR0_EYEXESTEN_DEFAULT << 26)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_EYEXESTFAST                       (0x1UL << 27)                                     /**< EYEXESTFAST                                 */
#define _MODEM_BCRDEMODARR0_EYEXESTFAST_SHIFT                27                                                /**< Shift value for MODEM_EYEXESTFAST           */
#define _MODEM_BCRDEMODARR0_EYEXESTFAST_MASK                 0x8000000UL                                       /**< Bit mask for MODEM_EYEXESTFAST              */
#define _MODEM_BCRDEMODARR0_EYEXESTFAST_DEFAULT              0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_EYEXESTFAST_DEFAULT               (_MODEM_BCRDEMODARR0_EYEXESTFAST_DEFAULT << 27)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_ARRDETSRC_SHIFT                  28                                                /**< Shift value for MODEM_ARRDETSRC             */
#define _MODEM_BCRDEMODARR0_ARRDETSRC_MASK                   0x30000000UL                                      /**< Bit mask for MODEM_ARRDETSRC                */
#define _MODEM_BCRDEMODARR0_ARRDETSRC_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRDETSRC_DEFAULT                 (_MODEM_BCRDEMODARR0_ARRDETSRC_DEFAULT << 28)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_ARRQPM                            (0x1UL << 30)                                     /**< ARRIVAL QUALIFY PM DET                      */
#define _MODEM_BCRDEMODARR0_ARRQPM_SHIFT                     30                                                /**< Shift value for MODEM_ARRQPM                */
#define _MODEM_BCRDEMODARR0_ARRQPM_MASK                      0x40000000UL                                      /**< Bit mask for MODEM_ARRQPM                   */
#define _MODEM_BCRDEMODARR0_ARRQPM_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRQPM_DEFAULT                    (_MODEM_BCRDEMODARR0_ARRQPM_DEFAULT << 30)        /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_ARRDETEN                          (0x1UL << 31)                                     /**< ARRDETEN                                    */
#define _MODEM_BCRDEMODARR0_ARRDETEN_SHIFT                   31                                                /**< Shift value for MODEM_ARRDETEN              */
#define _MODEM_BCRDEMODARR0_ARRDETEN_MASK                    0x80000000UL                                      /**< Bit mask for MODEM_ARRDETEN                 */
#define _MODEM_BCRDEMODARR0_ARRDETEN_DEFAULT                 0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define _MODEM_BCRDEMODARR0_ARRDETEN_OFF                     0x00000000UL                                      /**< Mode OFF for MODEM_BCRDEMODARR0             */
#define _MODEM_BCRDEMODARR0_ARRDETEN_ON                      0x00000001UL                                      /**< Mode ON for MODEM_BCRDEMODARR0              */
#define MODEM_BCRDEMODARR0_ARRDETEN_DEFAULT                  (_MODEM_BCRDEMODARR0_ARRDETEN_DEFAULT << 31)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_ARRDETEN_OFF                      (_MODEM_BCRDEMODARR0_ARRDETEN_OFF << 31)          /**< Shifted mode OFF for MODEM_BCRDEMODARR0     */
#define MODEM_BCRDEMODARR0_ARRDETEN_ON                       (_MODEM_BCRDEMODARR0_ARRDETEN_ON << 31)           /**< Shifted mode ON for MODEM_BCRDEMODARR0      */

