SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_modem.h
/* Bit fields for MODEM BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_RESETVALUE                       0x80000000UL                                   /**< Default value for MODEM_BCRDEMODARR1        */
#define _MODEM_BCRDEMODARR1_MASK                             0xFFFFFFFFUL                                   /**< Mask for MODEM_BCRDEMODARR1                 */
#define _MODEM_BCRDEMODARR1_ARREYEQUAL_SHIFT                 0                                              /**< Shift value for MODEM_ARREYEQUAL            */
#define _MODEM_BCRDEMODARR1_ARREYEQUAL_MASK                  0x7FUL                                         /**< Bit mask for MODEM_ARREYEQUAL               */
#define _MODEM_BCRDEMODARR1_ARREYEQUAL_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_ARREYEQUAL_DEFAULT                (_MODEM_BCRDEMODARR1_ARREYEQUAL_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_EYEOPENTHD_SHIFT                 7                                              /**< Shift value for MODEM_EYEOPENTHD            */
#define _MODEM_BCRDEMODARR1_EYEOPENTHD_MASK                  0x3FF80UL                                      /**< Bit mask for MODEM_EYEOPENTHD               */
#define _MODEM_BCRDEMODARR1_EYEOPENTHD_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_EYEOPENTHD_DEFAULT                (_MODEM_BCRDEMODARR1_EYEOPENTHD_DEFAULT << 7)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_SYMBWMAX_SHIFT                   18                                             /**< Shift value for MODEM_SYMBWMAX              */
#define _MODEM_BCRDEMODARR1_SYMBWMAX_MASK                    0x7C0000UL                                     /**< Bit mask for MODEM_SYMBWMAX                 */
#define _MODEM_BCRDEMODARR1_SYMBWMAX_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_SYMBWMAX_DEFAULT                  (_MODEM_BCRDEMODARR1_SYMBWMAX_DEFAULT << 18)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_SYMBWMIN_SHIFT                   23                                             /**< Shift value for MODEM_SYMBWMIN              */
#define _MODEM_BCRDEMODARR1_SYMBWMIN_MASK                    0x3800000UL                                    /**< Bit mask for MODEM_SYMBWMIN                 */
#define _MODEM_BCRDEMODARR1_SYMBWMIN_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_SYMBWMIN_DEFAULT                  (_MODEM_BCRDEMODARR1_SYMBWMIN_DEFAULT << 23)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define MODEM_BCRDEMODARR1_BCRCFESRC                         (0x1UL << 26)                                  /**< BCR CFE INPUT SOURCE                        */
#define _MODEM_BCRDEMODARR1_BCRCFESRC_SHIFT                  26                                             /**< Shift value for MODEM_BCRCFESRC             */
#define _MODEM_BCRDEMODARR1_BCRCFESRC_MASK                   0x4000000UL                                    /**< Bit mask for MODEM_BCRCFESRC                */
#define _MODEM_BCRDEMODARR1_BCRCFESRC_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_BCRCFESRC_DEFAULT                 (_MODEM_BCRDEMODARR1_BCRCFESRC_DEFAULT << 26)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_CFEQUALTHD_SHIFT                 27                                             /**< Shift value for MODEM_CFEQUALTHD            */
#define _MODEM_BCRDEMODARR1_CFEQUALTHD_MASK                  0x38000000UL                                   /**< Bit mask for MODEM_CFEQUALTHD               */
#define _MODEM_BCRDEMODARR1_CFEQUALTHD_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_CFEQUALTHD_DEFAULT                (_MODEM_BCRDEMODARR1_CFEQUALTHD_DEFAULT << 27) /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define MODEM_BCRDEMODARR1_KSICOMPEN                         (0x1UL << 30)                                  /**< BCR KSI COMP. ENABLE                        */
#define _MODEM_BCRDEMODARR1_KSICOMPEN_SHIFT                  30                                             /**< Shift value for MODEM_KSICOMPEN             */
#define _MODEM_BCRDEMODARR1_KSICOMPEN_MASK                   0x40000000UL                                   /**< Bit mask for MODEM_KSICOMPEN                */
#define _MODEM_BCRDEMODARR1_KSICOMPEN_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_KSICOMPEN_DEFAULT                 (_MODEM_BCRDEMODARR1_KSICOMPEN_DEFAULT << 30)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define MODEM_BCRDEMODARR1_ENCFEQUAL                         (0x1UL << 31)                                  /**< Enable BCE CFE Qualifer                     */
#define _MODEM_BCRDEMODARR1_ENCFEQUAL_SHIFT                  31                                             /**< Shift value for MODEM_ENCFEQUAL             */
#define _MODEM_BCRDEMODARR1_ENCFEQUAL_MASK                   0x80000000UL                                   /**< Bit mask for MODEM_ENCFEQUAL                */
#define _MODEM_BCRDEMODARR1_ENCFEQUAL_DEFAULT                0x00000001UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_ENCFEQUAL_DEFAULT                 (_MODEM_BCRDEMODARR1_ENCFEQUAL_DEFAULT << 31)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */

/* Bit fields for MODEM BCRDEMODARR2 */
#define _MODEM_BCRDEMODARR2_RESETVALUE                       0x00000000UL                                      /**< Default value for MODEM_BCRDEMODARR2        */
#define _MODEM_BCRDEMODARR2_MASK                             0x8000003FUL                                      /**< Mask for MODEM_BCRDEMODARR2                 */
#define _MODEM_BCRDEMODARR2_CONSYMOL_SHIFT                   0                                                 /**< Shift value for MODEM_CONSYMOL              */
#define _MODEM_BCRDEMODARR2_CONSYMOL_MASK                    0x1FUL                                            /**< Bit mask for MODEM_CONSYMOL                 */
#define _MODEM_BCRDEMODARR2_CONSYMOL_DEFAULT                 0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR2         */
#define MODEM_BCRDEMODARR2_CONSYMOL_DEFAULT                  (_MODEM_BCRDEMODARR2_CONSYMOL_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR2 */
#define MODEM_BCRDEMODARR2_RAWDCHKALWAYON                    (0x1UL << 5)                                      /**< RAW DATA Quality Check Always on            */
#define _MODEM_BCRDEMODARR2_RAWDCHKALWAYON_SHIFT             5                                                 /**< Shift value for MODEM_RAWDCHKALWAYON        */
#define _MODEM_BCRDEMODARR2_RAWDCHKALWAYON_MASK              0x20UL                                            /**< Bit mask for MODEM_RAWDCHKALWAYON           */
#define _MODEM_BCRDEMODARR2_RAWDCHKALWAYON_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR2         */
#define MODEM_BCRDEMODARR2_RAWDCHKALWAYON_DEFAULT            (_MODEM_BCRDEMODARR2_RAWDCHKALWAYON_DEFAULT << 5) /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR2 */
#define MODEM_BCRDEMODARR2_OUTRNGCHK                         (0x1UL << 31)                                     /**< OUT RANGE CHECK                             */
#define _MODEM_BCRDEMODARR2_OUTRNGCHK_SHIFT                  31                                                /**< Shift value for MODEM_OUTRNGCHK             */
#define _MODEM_BCRDEMODARR2_OUTRNGCHK_MASK                   0x80000000UL                                      /**< Bit mask for MODEM_OUTRNGCHK                */
#define _MODEM_BCRDEMODARR2_OUTRNGCHK_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR2         */
#define MODEM_BCRDEMODARR2_OUTRNGCHK_DEFAULT                 (_MODEM_BCRDEMODARR2_OUTRNGCHK_DEFAULT << 31)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR2 */

